{"full-text-retrieval-response": {
    "scopus-eid": "2-s2.0-85123012263",
    "originalText": "serial JL 312002 291210 291862 291881 31 Journal of Building Engineering JOURNALBUILDINGENGINEERING 2022-01-13 2022-01-13 2022-01-18 2022-01-18 2025-02-14T19:58:15 1-s2.0-S2352710222000419 S2352-7102(22)00041-9 S2352710222000419 10.1016/j.jobe.2022.104028 S300 S300.7 FULL-TEXT 1-s2.0-S2352710222X00028 2025-02-16T07:20:23.975935Z 0 0 20220515 2022 2022-01-13T18:36:43.880152Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body affil articletitle auth authfirstini authfull authkeywords authlast highlightsabst nomenclature orcid primabst ref 2352-7102 23527102 true 49 49 C Volume 49 32 104028 104028 104028 20220515 15 May 2022 2022-05-15 2022 article fla © 2022 Elsevier Ltd. All rights reserved. DEVELOPINGACONCEPTUALFRAMEWORKFORAPPLICATIONDIGITALTWINTECHNOLOGIESREVAMPBUILDINGOPERATIONMAINTENANCEPROCESSES ZHAO J Nomenclature 1 Introduction 2 Point of departure 2.1 Industry 4.0 and FM 2.2 BIM-Enabled FM 2.3 DT-Enabled FM 3 Methodology 4 Analyses and comparison of cases 4.1 DT for medical care facility services 4.1.1 DT technological framework of case A 4.1.2 Evaluation of case A 4.2 DT for school facility services 4.2.1 DT technological framework of case B 4.2.2 Evaluation of case B 4.2.3 DT technological framework of case C 4.2.4 Evaluation of case C 4.3 DT for warehouse facility services 4.3.1 DT technological framework of case D 4.3.2 Evaluation of case D 4.4 Comparison of the cases 5 Conceptual framework of adopting DT for FM 6 Conclusions and future work 6.1 Future work CRediT authorship contribution statement References CHOLAKIS P ROPER 2014 K FACILITYMANAGEMENTHANDBOOK WETZEL 2015 12 24 E DEMIAN 2014 1153 1165 P EASTMAN 2018 C BIMHANDBOOKAGUIDEBUILDINGINFORMATIONMODELINGFOROWNERSMANAGERSDESIGNERSENGINEERSCONTRACTORS HEATON 2019 172 186 J TEICHOLZ 2013 P BIMFORFACILITYMANAGERS MUNIR 2020 100 114 M TAN 2021 103451 T BOYES 2017 49 56 G PENG 2017 483 495 Y NAWARI 2019 209 238 N KONG 2020 12 15 L IEEEGLOBALCONFERENCEARTIFICIALINTELLIGENCEINTERNETTHINGS INTERACTIVEDIGITALTWINSFRAMEWORKFORASSETMANAGEMENTTHROUGHINTERNET TAO 2017 3563 3576 F LU 2019 392 404 Q INTERNATIONALWORKSHOPSERVICEORIENTATIONINHOLONICMULTIAGENTMANUFACTURING BIMTOWARDSDIGITALTWINSTRATEGYFUTUREDEVELOPMENTFORSMARTASSETMANAGEMENT ALONSO 2019 9 R XU 2018 90 M GUNDUZ 2017 221 227 M YU 2000 145 167 K CHANG 2018 1086 K OKORO 2019 C PROCEEDINGSCREATIVECONSTRUCTIONCONFERENCE2019 FUTUREROLEFACILITIESMANAGERSINERAINDUSTRY40 QI 2019 Q RUPPERT 2020 100174 T KASSEM 2015 261 277 M BIMINFACILITIESMANAGEMENTAPPLICATIONSACASESTUDYALARGEUNIVERSITYCOMPLEX WILLIAMEAST 2013 61 67 E LI 2019 354 365 Y CARBONARI G FALTEJSEK 2019 M PISHDADBOZORGI 2018 22 38 P LAVY 2007 363 372 S OGRADY 2021 107770 T DENG 2021 58 83 M JOHNSON 2020 1 12 A INFORMINGINFORMATIONREQUIREMENTSADIGITALTWINARAILINDUSTRYCASESTUDY MOTAMEDI 2014 73 83 A LU 2020 1 9 Q MOVINGBUILDINGINFORMATIONMODELSDIGITALTWINSFOROPERATIONMAINTENANCE SHAFTO M MUSSOMELI 2018 A INDUSTRY40ENABLESDIGITALTRANSFORMATIONSUPPLYCHAINS ZHENG 2018 137 150 P PARSANEZHAD 2014 P EFFECTIVEFACILITYMANAGEMENTOPERATIONSVIAABIMBASEDINTEGRATEDINFORMATIONSYSTEM LIM 2019 1313 1337 K LU 2020 Q BOLTON A GAMBHAVA 2020 D D65USECASEDEMONSTRATIONOMPLATFORMCOMMUNICATIONINTELLIGENTREPORTINGINFORMATIONVISUALISATIONPUPUBLICUSECASEDEMONSTRATIONOMPLATFORMCOMMUNICATION FATTAH 2017 2311 S LU 2020 103277 Q AIVALIOTIS 2019 1067 1080 P LEVY 2008 1 18 J STACKS 2013 D ENCYCLOPEDIAPUBLICRELATIONS REBEIZ 2012 421 428 K ZHUANG 2018 1149 1163 C WANG 2021 270 280 X NG 2021 1 17 M SEAWRIGHT 2008 294 308 J YIN 2013 R CASESTUDYRESEARCHDESIGNMETHODS GUERRA 2020 79 90 B ALSHORAFA 2019 397 423 R HOX 2005 593 599 J SCHOPFEL 2010 2029 2039 J ENCYCLOPEDIALIBRARYINFORMATIONSCIENCES GREYLITERATURE SONDERGAARD 2003 278 320 T JOHNSTON 2014 619 626 M PENG 2020 1 13 Y YOUSEFNEZHAD 2020 N INTERNATIONALCONFERENCEINDUSTRIALINFORMATICS PRODUCTLIFECYCLEINFORMATIONMANAGEMENTDIGITALTWINACASESTUDY WANG 2018 3892 3902 X ASHTARITALKHESTANI 2020 435 444 B DRATH 2009 34 R HE 2021 1 21 B NIEDERER 2021 313 320 S BANSAL 2015 42 50 S PARN 2017 45 55 E JUAREZ 2021 M 2019 INFORMATIONMANAGEMENTACCORDINGBSENISO19650GUIDANCEPART2PROCESSESFORPROJECTDELIVERYPUBLISHEDBY1GUIDANCEPART2PROCESSESFORPROJECTDELIVERY TANG 2019 127 139 S STEEL 2012 99 109 J FLYVBJERG 2006 219 245 B MAY 2017 M FACILITYMANAGERSGUIDEINFORMATIONTECHNOLOGY SONKOR 2021 M ZHAOX2022X104028 ZHAOX2022X104028XJ HEFCE none 2024-01-18T00:00:00.000Z 2024-01-18T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2022 Elsevier Ltd. All rights reserved. https://doi.org/10.15223/policy-017 https://doi.org/10.15223/policy-037 https://doi.org/10.15223/policy-012 https://doi.org/10.15223/policy-029 https://doi.org/10.15223/policy-004 item S2352-7102(22)00041-9 S2352710222000419 1-s2.0-S2352710222000419 10.1016/j.jobe.2022.104028 312002 2025-02-16T07:20:23.975935Z 2022-05-15 1-s2.0-S2352710222000419-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/MAIN/application/pdf/a629599713097e8c2639d89bbf919f5b/main.pdf main.pdf pdf true 2391263 MAIN 12 1-s2.0-S2352710222000419-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/PREVIEW/image/png/e5c02e2b1fdc511d42f4e75948bf08fc/main_1.png main_1.png png 45035 849 656 IMAGE-WEB-PDF 1 1-s2.0-S2352710222000419-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/gr1/DOWNSAMPLED/image/jpeg/a75ec0902bad0e607abffc63b2d7f5e1/gr1.jpg gr1 gr1.jpg jpg 41291 535 311 IMAGE-DOWNSAMPLED 1-s2.0-S2352710222000419-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/gr2/DOWNSAMPLED/image/jpeg/aa0ea4f714557c501d1c97a0bb641c6b/gr2.jpg gr2 gr2.jpg jpg 92926 739 600 IMAGE-DOWNSAMPLED 1-s2.0-S2352710222000419-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/gr1/THUMBNAIL/image/gif/962c47136e23f34c844938e7e2d96f66/gr1.sml gr1 gr1.sml sml 4885 163 95 IMAGE-THUMBNAIL 1-s2.0-S2352710222000419-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/gr2/THUMBNAIL/image/gif/4836637043f8dafdda449897629c49dc/gr2.sml gr2 gr2.sml sml 5645 164 133 IMAGE-THUMBNAIL 1-s2.0-S2352710222000419-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/THUMBNAIL/image/jpeg/4eddf6500e9e4974b1371263aa567b78/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 307563 2371 1378 IMAGE-HIGH-RES 1-s2.0-S2352710222000419-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352710222000419/HIGHRES/image/jpeg/5ba6b5833fae393e423aa90528001bfb/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 599448 3272 2656 IMAGE-HIGH-RES 1-s2.0-S2352710222000419-am.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:103KZM2N8BT/MAIN/application/pdf/f65aeaa007a24fcdcc982f22748a3487/am.pdf am am.pdf pdf false 790053 AAM-PDF JOBE 104028 104028 S2352-7102(22)00041-9 10.1016/j.jobe.2022.104028 Elsevier Ltd Fig. 1 Case study approach used for this study. Fig. 1 Fig. 2 A conceptual bottom-up framework. Fig. 2 Table 1 The application of DT in the four cases. Table 1 Case number Case type Case background DT applications Source Case A Medical care facility 24 floors above the ground level and two basement floors accommodating 500 beds with a total occupied area of 83,000 m2 • Technological framework • Real-time data collection • Decision-making • Predictive maintenance • Cost Reduction [65] Case B School facility The “Institute of Manufacturing (IfM)” building based in the West Cambridge buildings, covering over 3,700 m2 [44] Case C School facility 24 blocks with three floors and a total area of 34,000 m2 [66] Case D Manufacturing system An intelligent warehouse of a model car production system and other welding machines, control cabinets, and movable robot components [68] Table 2 Comparison of the case studies. Table 2 Project Application Building asset life cycle Real-time data collection Decision-making Predictive maintenance Cost reduction Plan, Design & Build O&M Functions supported Case A Continuous life cycle integration method using DT Yes Yes 1–7 ✓ ✓ Δ Δ Case B Building DT (Framework aligning with latest ISO standards and Gemini Principles) No Yes 1, 2, 4-7 ✓ ✓ ✓ ✗ Case C Product Lifecycle Information management with DT Yes Yes 1-4, 6, 7 ✓ Δ ✓ Δ Case D DT for the reconfiguration of an intelligent warehouse manufacturing system No Yes 1, 3–5, 7 ✓ ✗ ✗ ✓ Note: a. ‘✓’ parameter fully reflected in the use case; ‘Δ’ parameter partially reflected in the use case; and ‘✗’ parameter not reflected in the use case; b. Functions: 1. DT management throughout the building lifecycle; 2. Data integration and information management to support decision making; 3. Various types of fault detection through sensors in MEP systems; 4. Secured real-time static and dynamic data exchange between the virtual and physical model of the building; 5. Data gathering from different types of equipment for maintaining a common data space and easier to access; 6. Predictive maintenance of the assets within the building; and 7. Automatic repair and maintenance request management system for FM professionals. Developing a conceptual framework for the application of digital twin technologies to revamp building operation and maintenance processes Jianfeng Zhao Conceptualization Methodology Writing – original draft a Haibo Feng Conceptualization Data curation Supervision b ∗ Qian Chen Visualization Investigation c Borja Garcia de Soto Conceptualization Writing – review & editing c a Department of Architecture and Built Environment, Northumbria University, Newcastle, UK Department of Architecture and Built Environment Northumbria University Newcastle UK Department of Architecture and Built Environment, Northumbria University, Newcastle, UK. b Department of Mechanical and Construction Engineering, Northumbria University, Newcastle, UK Department of Mechanical and Construction Engineering Northumbria University Newcastle UK Department of Mechanical and Construction Engineering, Northumbria University, Newcastle, UK c S.M.A.R.T. Construction Research Group, Division of Engineering, New York University Abu Dhabi (NYUAD), Experimental Research Building, Saadiyat Island, P.O. Box 129188, Abu Dhabi, United Arab Emirates S.M.A.R.T. Construction Research Group Division of Engineering New York University Abu Dhabi (NYUAD) Experimental Research Building Saadiyat Island, P.O. Box 129188 Abu Dhabi United Arab Emirates S.M.A.R.T. Construction Research Group, Division of Engineering, New York University Abu Dhabi (NYUAD), Experimental Research Building, Saadiyat Island, P.O. Box 129188, Abu Dhabi, United Arab Emirates ∗ Corresponding author. Department of Mechanical and Construction Engineering, Northumbria University, Wynne Jones Building, Room 402, Newcastle, NE2 1XE, UK. Department of Mechanical and Construction Engineering Northumbria University Wynne Jones Building Room 402 Newcastle NE2 1XE UK Globally, the Architecture Engineering Construction (AEC) industry has seen a rise in the adoption of digital twin (DT) technologies due to their potential to enhance collaboration and information communication throughout the project lifecycle from the design to operation and maintenance (O&M) phase. However, empirical evidence on such adoption is fragmented, particularly for facility management (FM) activities during the O&M phase. Considering this gap, an illustrative case study approach is performed to analyze and compare the traditional practices of FM with DT-driven FM during the O&M phase using four geospatially representative cases. The findings show that DT technologies enable efficient and responsive planning and control of FM activities by providing real-time status of the building assets. However, barriers such as the misalignment of the data integration and data standards hamper their future implementation. To address this, a bottom-up conceptual framework is proposed to facilitate a wider implementation of DT technologies and support FM during the O&M phase of buildings. As such, this paper’s contribution is twofold: (1) it provides an aggregate landscape of DT application to manage facilities during the O&M phase, and (2) it develops an evidence-induced conceptual framework for stakeholders who are grappling with their FM decision-making processes. Keywords Building information modelling Case study Conceptual framework Digital twin Facility management Nomenclature AEC Architecture Engineering Construction AHU Air Handling Unit AI Artificial Intelligence AIR Asset Information Requirements API Application Programming Interface ASM Asset Management System BAS Building Automation Systems BIM Building Information Modelling CAFM Computer-aided Facility Management CDE Common Data Environment CMMS Computer Maintenance Management System COBie Construction-Operations Building information exchange DT Digital Twin FM Facility Management GPS Global Positioning System HTTP Hypertext Transfer Protocol ICT Information Communication Technology IoT Internet of Things LOD Level of Detail ML Machine Learning MR Mixed Reality O&M Operation and Maintenance O-DF Open Data Format O-MI Open Messaging Interface PLIM Product Lifecycle Information Management PLM Product Lifecycle Management RF Radio Frequency SMS Space Management System SOA Service-Oriented Architecture WSN Wireless Sensor Network 1 Introduction In recent years, technological advances in software, frameworks, and application tools have drastically transformed how the AEC sector manages its building assets throughout their lifecycle, particularly in automating FM activities to improve work efficiency during the O&M phase. The O&M phase has received considerable attention compared to other phases over the years since it accounts for circa 80% of the building whole lifecycle cost [1] and is considered as the longest - about 15–25 times more than the design and construction phases [2]. In addition, as multiple stakeholders are involved in this phase, identifying the accurate facility space location, managing the O&M records, and coordinating different formats of data obtained from various FM systems become even more challenging [3]. Therefore, the conventional approach to FM relying on manual work can be subjected to many shortfalls, including a significant number of errors, wasted time and cost, and data loss [4]. Those issues impose great challenges for FM managers to ensure adequate building performance for the owners and occupants. To address the problems associated with the traditional approach, the concept of Building Information Modelling (BIM) was brought to the fore as it is viewed to be able to engender significant benefits in the O&M phase of building projects [5,6]. To name a few [7], promoted the concept of the common data environment (CDE), whereby information of the assets is collaboratively maintained utilizing a digital model to improve interoperability. A recent study by [8] showed that an integrated BIM approach can reduce the time and cost of updating the databases of FM systems in the O&M phase compared to the conventional manual approach. Similarly [9], demonstrated the capability of BIM to enhance data integration and the efficiency of the decision-making process among multiple stakeholders. Given that BIM-based smart building asset management helped managers build and maintain a comfortable living environment for users [10], further innovations are desired to reinforce the connection of BIM usabilities to FM demands. A few studies have introduced innovative DT technologies as a game-changer for the BIM-FM connection. Through DT technologies, physical assets could be easily mapped to the digitally integrated platform using inexpensive and smart sensors, Internet of Things (IoT) equipment, machine learning (ML), artificial intelligence (AI), blockchain and big data analytics to analyze the condition and real-time status of the assets [11,12]. The bi-directional dynamic information flow and the quality data exchange can be established between the physical and the digital assets using CDE [13]. The visualization component for DT relies on an information-rich 3D model generated from the BIM process, and the real-time status of the building is obtained from various smart sensor networks [14]. During the O&T phase, DT can compensate for the shortcoming of BIM in whole-life cycle asset management by enabling dynamic learning and update of the physical twin [15]. Indeed, the Centre for Digital Built Britain (CDBB) (2018) contends that DT goes beyond a model of a physical asset as it integrates context, connectivity, and timely monitoring throughout the project lifecycle. Nevertheless, since the emergence of the DT concept, real-world use cases using DT technologies for FM during the O&M phase have been sporadic and ambiguous [16]. The questions of “to what extent have DT technologies been applied to FM in the O&M phase? And have the purported benefits been realized?” remain unanswered. To address these questions, this study performs an illustrative case studies approach to compare practical use cases of DT technologies and synthesize the findings from these cases to propose a conceptual implementation framework, which could be used as a catalyst for improving the efficiency of FM. The framework is considered a fundamental guide to help stakeholders make more informed decisions for FM activities and generate more efficient outcomes from their assets. It is also the starting point to fill the knowledge gap concerning the practical adoption of DT technologies for the AEC industry. The remainder of the paper is structured as follows. Section 2 reviews the state-of-the-art methods, technologies, and theories of DT applications in the AEC industry, including Industry 4.0 and FM, BIM-enabled FM and DT-enabled FM, followed by the illustrative case study approach presented in Section 3. Section 4 provides the findings of the case study analysis and compares the application of DT technologies among medical care facilities, school facilities, and warehouse facilities. In response to the empirical results, Section 5 develops a conceptual framework to guide the DT applications in future construction projects. Conclusions and future work are summarized in Section 6. 2 Point of departure 2.1 Industry 4.0 and FM According to the International Organisation for Standardisation [17]; p.1), FM is defined as “the organizational function which integrates people, place and process within the built environment with the purpose of improving the quality of life of people and the productivity of the core business”. Industry 4.0 has the potential to revolutionize the built environment and significantly contribute to improving the quality of human lives and FM-related activities [18]. The FM industry can enhance the way of operating the assets in the O&M phase and go digital with less manpower benefiting from its technologies like IoT, predictive analysis, ML, AI, Global Positioning System (GPS), and big data analytics [19]. Since the late 90s, when facility managers encountered Information Communication Technology (ICT) for the first time, various tools have been used for integrated FM that can share and exchange various databases of the FM systems [20]. This technology allowed managers to accomplish more tasks and increase the performance of FM systems (May and Williams, 2017). The connection of DT to the physical world via wireless sensor technology in a building can be used to gather data relating to the built environment, such as indoor comfort management, carbon monoxide levels, energy management, and space management. Generally, Industry 4.0 and the enabling technologies can benefit the FM manager and the business organization in the following ways: • Real-time data management and tracking can cut energy wastage by using the energy in particular places and reduce CO2 emission [21]. • Through smart sensors, predictive maintenance is made easy in smart buildings to resolve issues in advance [22]. • Total cost is reduced on FM activities in terms of cost spent on energy consumption, streamlining the smart process in the business organization, and reducing the wastage of resources [23]. • Data interoperability is enabled from different software databases and tools where FM professionals can easily simulate and predict the behavior of FM systems and prevent failures in the O&M phase [24]. 2.2 BIM-Enabled FM The traditional approach to managing facilities deals with large amounts of information in various formats such as spreadsheets, texts, databases, and paper-based O&M manuals [25]. Normally, data are handed over to asset owners in the form of boxes filled with O&M manuals, which are unsorted, unstructured, and difficult to manage, hindering the daily O&M work [26]. To upgrade this somewhat outdated way of information management, BIM has been identified as a key method in the AEC industry to transform the traditional FM processes [27]. For instance [28,29], outlined BIM benefits in the areas of knowledge capture, early FM engagement, supporting hard and soft services and strategic FM, and accessing real-time data. Specific to O&M work order management [30], proposed computer maintenance management systems (CMMSs) to record information such as service requests and work orders for convenient execution for FM professionals. Other intelligent tools alike have also been developed and used to enable facility managers to better plan, execute and monitor FM activities such as computer-aided facility management (CAFM) systems and building automation systems (BAS) [31,32]. Because of these benefits, BIM has been widely applied in the following specific FM realms: (1) real-time visualization; (2) supporting decision making, communication, and progress monitoring; (3) energy performance management; (4) indoor environment monitoring; (5) indoor thermal comfort tracking; (6) space management; and (7) easing the tracking of planning orders, space, activities, and labor [33]. Despite the benefits, limited studies investigated accurate decision-making, predictive maintenance, well-organized frameworks, and integrated platforms to manage the information and O&M standards critical for the FM activities [34]. For example, an implementation framework to match Asset Information Requirements (AIR), which lowers the value of Construction-Operations Building information exchange (COBie) data generated during this phase, is unavailable in the literature. According to British Standards Institution (BSI), the standards are still inadequate to address the core FM processes, data types, entities, and parameters mapping with FM systems [35,36]. 2.3 DT-Enabled FM The term “Digital Twin” was first coined by the American space agency NASA in 2010 and then revolutionized the aerospace and manufacturing sectors [37]. The concept originates from the fact that the engineers on the land can track the operations and real-time status of the remote aircraft in the sky. NASA defined it as “an integrated multi-physics, multi-scale, probabilistic simulation of a vehicle or system that uses the best available physical models, sensor updates, fleet history, etc., to mirror the life of its flying twin.” [37]. More recently [38], defines DT as “a realistic digital representation that combines data describing the physical assets, processes and systems in a digital format”. Due to the benefits of reducing cost, increase in performance, productivity, efficiency, and readability, its application was expanded to other sectors, including the AEC industry for the FM of buildings [39,40]. Compared to other industries, the AEC industry is characterized by fragmentation problems. Especially, FM lacks effective information management frameworks and comprehensive research and innovation in this regard [41]. AEC professionals started using this concept to identify the behavior of the built assets during the O&M phase, which integrates information such as previous and current behavior and different properties of the built assets to support the decision making and optimization process [42]. For example, the CDBB has developed a ‘digital framework for infrastructure data’ as stated in [43] in the United Kingdom (UK). In order for a DT framework to realize the static and dynamic bi-directional information flow between virtual and physical entities, five main architecture layers are needed, i.e., data acquisition layer, transmission layer, as-built digital modeling layer, data/model integration layer, and application/service layer [44]. A similar term to DT is the “Gemini principles,” which covers public good, value creation, insight, security, openness, quality, federation, curation, and evolution [45]. These principles were created by the Digital Framework Task Group as part of [46] for a city-level DT and can direct the FM industry to increase the performance of the assets using digitally connected data. At present, DT technologies have their hotspots in real-time data collection and monitoring [33], decision making [21], and predictive maintenance [47]. For instance [48], designed a building IoT service using sensors to track dynamic onsite conditions, with which reminders can be sent to its inhabitants to allow immediate actions. To facilitate FM decision-making [21], proposed a BIM-IoT DT model capable of visualizing sensor data and showing desired context values so that facility managers can adjust relevant FM systems. Such informed decisions often rely on an accurate prediction function. Taking the MEP system as an example [49], proved that detecting anomalies of pumps using Industry Foundation Classes-based DT can avoid system failures. Similarly [50], argued that prediction through DT automates the scheduling of maintenance activities and ensures the healthy status of each piece of equipment. In addition, both AI and ML techniques are used for enhanced predictive maintenance to instruct facility managers on when to act under different conditions [47]. However, it is still unclear how DT has impacted FM activities of buildings on a full scale (e.g., the overall costs and benefits) as these techniques currently concentrate on specific systems, such as the MEP system. Therefore, a timely investigation, e.g., through a case study approach, is needed to unearth the landscape of DT technological applications and develop a framework to support the adoption of DT for FM during the O&M phase. 3 Methodology To address the research questions, an illustrative case study approach (see Fig. 1 ) is adopted to understand the scenarios of DT application in the FM of buildings during the O&M phase and dissect their individual and collective benefits and barriers for future implementation. According to [51,52]; illustrative case studies serve primarily to make the unfamiliar familiar and to give readers a common language about the topic in question. The same approach has been performed in construction-related studies of a similar nature, such as [53–55]; and [56]. For instance [56], used four polar-type illustrative case studies to examine the workflows of application of digital fabrication, BIM and early contractor involvement that improve design management in construction projects. It is considered useful to help this study to demonstrate the empirical relevance of a theoretical proposition concerning the DT concept and its adoption in the real world when relevant, and representative use cases are identified, compared and synthesized. Three criteria are followed to curb the authors’ bias towards case selection [51]. According to [57]; the three criteria consider: (1) availability of data; (2) choosing a case sample that is representative and illustrates the differences in case characteristics (e.g., location, building types and scale and FM functions); and (3) ensuring that there are useful variations on the dimensions of theoretical interest. After searching, selecting, and cross-checking the relevant cases, four cases representing geographically different locations (e.g., China, the UK, Germany, and Finland) and different states of DT adoption (e.g., BIM became a ‘must’ in the UK) have been identified (as per criteria (2) and (3)), which appropriately followed the suggested three strategies [51]. In addition, as per criteria (2) and (3), the cases encompass different project types, from a hospital, university campuses to an intelligent manufacturing warehouse. Consistent with [57] on data availability, data on these four cases can be pragmatically collected (as per criteria (1)). It is noted that these cases, though being representative and distinct in case characteristics, remain similar in their attempted outcome to contribute to the improvement of FM performance during the O&M phase through DT applications. While many examples illustrate the use of a DT concept [57], argue that truly representative cases are in every sense challenging to be identified. Nevertheless, the cases used in this study are selected through the above criteria to examine the adoption of DT in the FM of buildings during the O&M phase [58]. In fact [59,60], have applied similar criteria in their studies, which support the case selection in this paper. Materials created by other researchers (i.e., secondary data) are increasingly available for reuse by the general research community [61]. The four cases are also sourced from the secondary data for this study, including the norm literature and the grey literature. Grey literature is defined as sources not formally published in books and journals but are found in technical reports, pre-prints, the media, and the like [62]. According to [63]; it gains its prominence as a reliable data source due to its value in disseminating scientific, technical, public, and practical information. Essentially, studies utilizing secondary data are prevalent and are as viable as those using primary data [64]. As such, data derived from this source are robust in underpinning the case analysis, which consists of information for (1) Case A - East Hospital Building in China; (2) Case B - West Cambridge Building in the UK; (2) Case C - Main Buildings of Aalto University in Finland; and (4) Case D - Intelligent Warehouse Building in Germany. Details of these cases are presented in Section 4. 4 Analyses and comparison of cases As shown in Table 1 , to unveil how DT has been applied, analyses of the case studies mainly focus on the technological frameworks of DT and the advantages and disadvantages (challenges) of the DT applications in each case in terms of real-time data collection, decision-making, predictive maintenance, and cost reduction. Additionally, a cross-case comparison was conducted to show the variances and consistencies of DT applications in the four cases (Section 4.4). 4.1 DT for medical care facility services Case A was built to provide high-level medical care services and medical security for the public [65]. The medical health care facility has complex systems such as gas systems, medical equipment systems, and sewage treatment systems that have to be well managed. The DT of the complex systems mentioned in this case study provides various management guidelines to facility buildings with similar functionalities. 4.1.1 DT technological framework of case A As the hospital building should run 24 h every day, timely decisions need to be made in the event of an emergency. As such, DT was proposed to solve the previous low operational productivity and maintenance efficiency issues. In addition, there are a total of seven dynamic operations data that were integrated using different connection protocols (e.g., Hypertext Transfer Protocol (HTTP), Application Programming Interface (API)) and processing networks (e.g., private cloud storage). The high-density data collected from different sensors were used in subsystems of each dynamic operation. For example, mixed reality (MR) for object mapping was used via MR application to cross-check if the data is consistent and accurate. Onsite object mapping was conducted to cross-check if the equipment data are the same as those in the virtual model. In terms of predictive maintenance, the service layer, a subsystem contained in the developed DT, supported the FM managers in handling repair requests and maintaining the service schedule effectively. The working process of the service layer was divided into repair initiation, task assignment, work order generation, maintenance processing, maintenance calendar, and maintenance plans. The applications of the service layer can be seen at the backend for abnormal electricity usage detection, air handling unit (AHU) fault prediction, low-quality maintenance checking, and frequent repair pattern recognition through the utilization of a diagnosis engine and big data. In short, the electrical consumption is maintained by power systems, and the data are monitored by 230 smart meters by using cluster algorithms. The DT system helped continuously monitor the electricity usage and detected fault electrical circuits below threshold values from the normal condition of circuits. This effective framework also detects faults in AHUs, and it can detect over 10 faults through long- and short-term memory networks such as low airflow, clogged filters, undercooling, etc. According to the facility manager, one innovation of this framework lies in using a lifecycle integration method that properly schedules activities through different phases of the building lifecycle. This salient feature is consistent with the finding stated in [50]. 4.1.2 Evaluation of case A Over the adoption of DT in the FM systems of the hospital, a survey showed a 10% increment in management staff satisfaction compared to the previous old building operation. Besides, 1% of overall energy consumption was saved every year, contributing to sustainable development in the long term. Furthermore, the innovative life cycle integration method made the integration of data throughout the lifecycle of the building easier. Despite the advantages that have materialized, it should be noted that the data backup can only last for 3 months but requires large amounts of hardware devices, generating financial risks, especially in this type of large-scale buildings. Although the facility managers do not need to deal with the book manual with the support of DT, they still have to manually assign the workers to solve the detected issue in the building. This creates an opportunity for DT to learn to make automatic control of the faulty equipment as currently, the real-time alarm of the faulty equipment was sent to the control center and received by FM managers. Another challenge revealed is the lack of standards in guiding the DT development. A possible solution can lead to the integration of building automation, maintenance, and space management systems using DT application for building a unified system according to the requirements of health care facilities. 4.2 DT for school facility services Case B and Case C were selected as representatives of DT application in school facility services. These two school buildings have advanced DT applications at the building and campus levels with abundant data availability. The generality of the DT set up in these two school facilities could be easily adopted by other school campuses globally. 4.2.1 DT technological framework of case B The technological framework for Case B mainly focused on as-is condition monitoring like temperature, humidity, motion detection, light meter, door status (Open/Closed), carbon monoxide in the air, vibration count in the pumps, lathe machines, etc. In addition, the future performance prediction of MEP equipment in the IfM building was considered. The data acquisition of the internal and external building was done by the IoT-enabled wireless sensor network (WSN). Clusters of the Monnit wireless sensors were used to collect the data within the range of 250–300 feet line of sight. The low-cost communication medium sensors over radio frequency (RF) helped the DT capture the MEP equipment in the building. Using API and.NET software hosted on the server through sensor manager software helped gather the data from the sensors. The collected data was stored in the cloud database using HTTP and generated a BIM model based on DT’s information requirements. However, the extent of information, i.e., level of detail (LOD), which plays an important role in understanding the BIM model generation used in the FM process, was not mentioned. 4.2.2 Evaluation of case B Compared with Case A, Case B considers the application of DT on the existing buildings rather than a new building. The real-time data sets captured through the DT system could ensure effective maintenance prediction of built assets within the building. The DT demonstration of Case B can be further expanded to infrastructures such as the water, transport, and utility sectors. Another benefit manifested is that real-time data sets ensured effective predictive maintenance of built assets within the building. There are also challenges aligned with opportunities to be overcome in the future, including (1) integration of data from BMS, asset management system (ASM), Space management system (SMS) and real-time sensor dataset; (2) generating BIM models based on the inappropriate as-built drawings of the existing model; (3) developing a data acquisition system from a large scale of sensor network; (4) measuring building performance and its impact on organizational productivity; and (5) combing the DT implementation with the Gemini principles mentioned above. Despite the advantages, the technological framework explains only the behavior of the pumps, excluding the other types of equipment used in the building. Moreover, it fails to explain the different faults detected in the assets and their automatic resolution method. 4.2.3 DT technological framework of case C This case mainly concentrated on the information management of the building lifecycle using the DT concept [66]. It was developed according to the system-based product lifecycle information management (PLIM) system throughout the building phases. An open standard web-API called ‘smart campus’ was used as a DT-PLIM system, which provided information regarding whole building energy consumption, total occupancy, and comfort level by integrating BIM models and IoT smart sensors. The data format used for exchange between different systems was Open Messaging Interface (O-MI) and Open Data Format (O-DF). Six iterative steps - virtual representation, data processing, product simulation, virtual control, real-time, two-way and secure connection, and data integration - were used to implement the effective functional DT for asset information management in this building. In addition, the number of visitors and their paths inside the building were recorded for effective tracking of human behaviors. To enhance the internal building environment, some of the unique sensors were used to capture the customers’ feedback to verify and improve their experience within the building. The implementation of PLIM and DT can be more effective than using only DT applications for buildings. In this case, PLIM refers to information of the individual product management throughout the lifecycle for better connection of information systems inside the smart building. 4.2.4 Evaluation of case C There are positive impacts resulting from the combination of PLIM and DT in this university building. Based on the case analysis, dynamic behaviors can be simulated and predicted, which could support the system optimization of multiple products in a real-time environment. Moreover, the O-MI-enabled actuators, which were part of the predictive maintenance system of the asset, were able to write and call requests of the issues unattended. Such advantages of applying the compound framework were reflected by a 50% efficiency improvement in the maintenance and operational stage. However, in comparison to the higher level of information security in the PLIM system, FM managers raised concerns about the security of the DT as it was hosted on a less secured O-MI web server. On the other hand, the standards and interoperability procedures were not well established in this DT application due to the complex structure within the building. Similarly [67], also report that compatibility and interoperability remain critical challenges for multiply systems. 4.3 DT for warehouse facility services 4.3.1 DT technological framework of case D Case D was equipped with 37 sensors, 25 actuators, programmable logic controllers, and Wireless LAN to communicate within the manufacturing system [68]. DT was implemented in the intelligent warehouse to test the efficiency increase (e.g., reduced set-up and conversion time) when reconfiguring the manufacturing system to adapt to new market demands (e.g., produce urgent customer-specific products). To do so, the efficiency of the flexible manufacturing system was evaluated by identifying and verifying the sequence and duration of the reconfiguration process in each method (with and without DT). For the DT scenario, an architecture of simulation interface, data acquisition interface, synchronization interface, and organizational and technical data was adopted. This architecture was complemented by tools such as NX-Modeling and Line Designer to create digital models/platforms of the automated system. The integration of data and different models into the DT generated by these various tools was considered the major task during implementation, realized by standardized neutral exchange formats as stated in [69] and semantic technologies. Notably, the synchronization process was supported by the service-oriented architecture (SOA) interface of the product lifecycle management (PLM) platform. On the other hand, the ‘without DT’ scenario applied the common reconfiguration process in the industry without the digital counterpart, which requires manual behavioral analysis of the system, expert discussion, components ordering, physical set-up, programming and test, and buffer time for error detection. Compared with the normal approach (i.e., without DT), the evaluation results identified a reduction in time by 33% using the anchor point method and DT in their standard process of reconfiguration system. In essence, the reconfiguration of the manufacturing system can be effectively carried out using the intelligent warehouse underpinned by DT, and it can remove the different unwanted processes in maintaining the manufacturing system. Nevertheless, there were many scenarios where the DT was unsuccessful, particularly in detecting the wide variety of changes and faults when operating the system. 4.3.2 Evaluation of case D Two scenarios of the intelligent warehouse were compared and contrasted to illustrate the function of DT in reconfiguring the manufacturing system. When DT was applied to the intelligent warehouse in Case D, a total of 58.5 h could be reduced in a single reconfiguration process. Specifically, the SOA interface and PLM platform permitted access to an assistance system, which helped automatically detect the changes and apply the necessary conversion for the reconfiguration. As a result, 4.8 and 23 h are saved for these two automations, respectively, because there was no need to analyze the existing system manually and ask for experts’ views on the new configuration. More importantly, the virtual commissioning and simulation process automatically corrected faulty components during the modification and verification process. This way, the reconfigured system can produce products (e.g., model cars in this case) that meet the clients’ needs without making mistakes. Therefore, the buffer time for error detection and production risk was reduced, and the availability of the manufacturing system was increased [70]. also stated a similar evaluation of manufacturing systems with DT application. In stark contrast, reconfiguring the manufacturing system without DT may require a repeatable process of ordering components, testing, and error detection due to a lack of simulation, which can incur a minimum of extra 30.7 h. This was because errors in products can only be found after the physical set-up was completed. Unsurprisingly, the intelligent warehouse without DT required the system engineer to locate and correct the changes, which is costly and time-consuming. For example, the components detected as faulty during the modification and verification process had to be manually rectified before the operation process. This ‘time’ was further extended because each reconfiguration step within the ‘non-DT’ method took more time, and the additional step (e.g., expert discussions) was required. Furthermore, the production risk was increased after the commissioning process due to the lack of a digital blueprint. 4.4 Comparison of the cases Table 2 presents a comparison of the four case studies. Some similarities and variances have been unveiled in understanding the actual application of DT to FM activities in the O&M phase, indicating the representativeness of the case selection. As shown in Table 2, DT was designed specifically for the O&M phase in Case B and Case D, while this was expanded to the front-end of buildings in Case A and Case C. The extension of the application range (plan, design & build, and O&M) may explain the extra number of functions supported by DT in these two cases. For instance, Case A showed the function of an automatic repair and maintenance request management system, and Case C demonstrated the secure data gathering and processing through the DT-PLIM model. However, one common feature is the realization of real-time data collection in all use cases, which provided a solid foundation for other activities (decision-making, predictive maintenance, and cost reduction). Although the concept of real-time data is not new [42], this study presented empirical evidence on the impact of this function on FM’s efficiency and performance. For example, with data collected in this study, some ‘uncomfortable knowledge’ was acquired in Case B and Case D, where DT did not always guarantee improved decision-making, predictive maintenance, or cost reduction. Similarly, an obvious cost advantage was not exhibited in Case A and Case C, which may be attributed to the high investment that was yet to recuperate. It concurs with [71] that significant investment has to be made in DT before its ‘power’ takes place. Nevertheless, more robust decision-making and better predictive maintenance in Case A, Case B, and Case C were not negligible. To name a few, more than 10% reduction in faults and repair requests and 1% less energy consumption every year were observed in Case A. Case B and Case C have uncovered the capability in future performance prediction through the open data platform and optimizing FM systems by simulating multiple behaviors, respectively. In sum, the impact DT technologies would have on the performance of FM in buildings was identified through the illustrative case study approach. Reflecting on the advantages of the continuous lifecycle integration method using DT, it is more of managing the data throughout the building lifecycle. This reinforces previous perceptional innovation about DT and can be used as a reference model for other different types of buildings. However, the primary challenge of the case studies was identified as decision-making support for FM managers and data planning and management over the different stages of the project. Furthermore, the ‘extract, transform and load’ workflow, one of the traditional methods of integrating data from heterogeneous systems, is still active in these use cases. It points out that the advantages of DT implementation in data mining and creating possible solutions, as outlined by [72]; could be further exploited during the integration process. Thus, a framework is needed to guide the better adoption of DT technologies if the aim is to ensure DT is suitable and its purported benefits can be realized. 5 Conceptual framework of adopting DT for FM The illustrative case studies, including hospitals, university buildings, and warehouses, were chosen to understand various technological DT frameworks developed for the FM of buildings. Evidence captured in Section 4 supports that DT can ameliorate the difficulties in real-time monitoring, predictive maintenance, decision-making, and cost performance. However, coupling with the supporting DT functions is the duality of the challenges that impede its wider implementation. For example, the results in Case C indicate the lack of standards and interoperability procedures. Therefore, the FM industry must establish a set of standards/guidelines on security, data privacy, and interoperability [73]. Similar to Case A [74], contend that the threshold of minimum US$50,000 and other cultural, ethical, and legal issues, discouraged the potential clients of DT applications. More importantly, DT was applied to these use cases mainly to compare against the traditional approach (Case D) and/or resolve the emerging problems (Case A) while overlooking the suitability of DT and its long-term impacts. This may explain the shortfalls as manifested by this study. In other words, there are fundamental issues that need to be fixed to accommodate DT. As [75] argues, both the skills of FM professionals at the practical level and the theoretical contribution made by academics are required to address this. Hence, to make headways in tackling some of these barriers while reinforcing the capabilities, a conceptual bottom-up framework is proposed in Fig. 2 to facilitate the implementation of DT in FM of buildings. Instead of focusing on the up-layer of the application directly, this framework dives into the bottom perquisites that sow the soil for the successive data acquisition, processing, transmission and validation, model integration, and application. To start with, the essence of Gemini principles [50], the information management framework as per ISO 19650 series [76], and open data format need to be conveyed to the clients and facility managers to support complex systems in the building and more importantly the security of the system as their skills will ensure the smooth application [75]. In the architecture of data collection such as COBie data, sensors, and IoT and data processing such as cleaning, structuring, and clustering, it should be noted that in the FM of buildings: (1) a comprehensive plan based on the requirements of the building type and the engagement of the contractor from the design stage can effectively generate the DT system; (2) appropriate data mapping with the as-built models and the physical environment should be chosen wisely as it will impact on the whole system; and (3) LOD of the as-built models should be decided before using them on the DT application for fetching the required information for data processing of MEP systems. Moving to a higher level is another important testbed in addition to the prerequisite verification, which examines the compatibility of different data formats with the platforms supported by AI, blockchain, ML, etc., in the following model integration layer [ [12,36,44,49]. Different platforms can generate different data formats [77], which causes the interoperability problem and offsets their benefits. Having the testbed in place would ensure a consistent way of information exchange [78]. Such entrance check and middle inspection will nip the problems in the bud and promote successful DT implementation in FM. Even in the case of ‘failure’ of the filters (e.g., the bottom DT prerequisite layer and the middle layer of data transmission and modeling), the visual dashboard (i.e., data control center) at the top level will feedback the problems such as incomplete monitoring data and interoperability issues to the downstream layers to seek resolutions. This feeding mechanism, combined with the bottom-up structure, creates mutual interactions within the DT system. By delineating a bottom-up view, FM practitioners can readily utilize this framework (Fig. 2) as a guide for action. It examines the applicability of DT at the outset and ensures that surfaced FM problems can be timely addressed. Taking Case D as an example, the potential of adopting DT to reconfigure the manufacturing system can be trialed by a compatibility test with the standardized interoperability procedure, data security, and open data format as outlined in the preparation layer. In doing so, clients of the intelligent warehouse are provided with a birds’ eye view of the future before inputting resources that may otherwise be futile. Equally, with the sensors that have already been installed, the acquisition and processing layer can be seamlessly applied without investing extra cost. In line with the nature of the manufacturing system, AI and ML embedded in the logic layer can be selected to make the most use of the data generated from the iterative manufacturing process. This logic layer is flexible as it provides other alternatives (e.g., simulation engines and blockchain) to fit other building types according to their individual characteristics. Having rigorous prerequisite verification and process-based supporting layers in place, DT can be ultimately utilized to buttress FM activities such as energy management, work orders management, and automatic fault prediction and rectification. 6 Conclusions and future work The concept of DT has pervaded the routine of academics and practitioners in the AEC industry. However, empirical evidence on the adoption of DT technologies is fragmented, particularly concerning the FM activities over the O&M phase. Addressing this gap and establishing a connection between FM demands and technological advancements, this research used the illustrative case studies approach to investigate the adoption of DT in the AEC industry, focusing on the role of DTs in the FM of buildings during the O&M phase. Answering how DT technologies have been applied to FM in the O&M phase and what benefits have materialized shows improved building performance and an increase in the efficiency of the MEP systems during the O&M phase. Specifically, real-time data collection and monitoring (Case A, B & C) support FM professionals in the decision-making process (Case A), predictive maintenance (Case B, C), and efficiency & cost reduction (Case A, B & D) are examined in terms of DT functions and their impact on the O&M phase of the building. Therefore, based on the four representative use cases and by following the steps of the illustrative case study approach, understandings are garnered on how DT can replace/or augment BIM and the traditional approach of FM and how it can be more conducive to solving the issues related to FM in the O&M phase, such as real-time data collection, effective data management and integration. A conceptual framework is developed to address the challenges manifested from the line of inquiry, such as the loose integration of BIM and FM models and their insufficient level of information within each component and the misalignment of the data integration and data standards. It provides a bottom-up pathway for FM practitioners to consider DT implementation, including the prerequisites before implementation, data acquisition from different sources, data processing, data transmission and modeling, model integration layer with various intelligence tools, and application and data visualization layer. Furthermore, the implementation of DT using ML and AI can increase the intelligence of the whole FM system and make a proper communication network between FM professionals and the real-time status of the assets. This research focused on analyzing empirical data based on four representative case studies to unravel the realistic situation of DT application in the AEC industry. While findings may be restricted to the four cases, this paper collectively showcases the landscape of DT implementation in buildings’ FM activities over the O&M stage and develops a pathway for practitioners’ guidance. It concurs with [79] argument that content-dependent knowledge (e.g., the single case-study) can be more valuable than universal ones and, therefore, is robust in stimulating scientific development. In this sense, the results presented here can instill confidence in practitioners’ future embark on DT technologies by showing their systemic impact rather than the piecemeal manner that pervades in the existing literature. In addition, despite the problems identified, this study contributes to the emergent DT body-of-knowledge by proposing a conceptual framework that can mitigate such problems and facilitate DT’s wider implementation in an era of digital construction. 6.1 Future work The conceptual nature stimulates an avenue for future research to be conducted. One direction could lead to a validation system/platform of the proposed framework to verify each layer to enhance the performance of the assets and cross-check each process to maintain consistency throughout the building operations. Although there currently is a lack of a visualization platform for different sets of parameters utilized in the case studies, real-time data visualizations in the data center will play a major role in better maintaining complex buildings and thus outperforming BIM [10]. Complementing the visualizations would require data mining and data clustering techniques to dig more into the asset information as [11] argue that they can extract the useful data by omitting the ‘meaningless’ data stored in the system. On the other hand, a data synchronization system/platform is necessary to continuously manage the most recent data after every cycle. This can be supported by intelligent Industry 4.0 tools such as AI and big data analytics as envisioned in the DT logic layer of the proposed framework [80]. have lauded their competitive strength in detecting the faults, automatically assigning work orders to FM managers, and increasing the quality of predictive maintenance function within the DT system. However, the transpire of the ‘blueprint’ calls for further interdisciplinary collaborations, particularly in computer science and communication for technical endeavors. Equally important, we need to be mindful of the environmental issues associated with the proposed technologies as the building sector has a high impact on global energy consumption and carbon emissions. Therefore, whether the technologies can play a role in tackling this challenge should be emphasized as we cannot develop simulation systems, AI, ML, etc., indefinitely in complexity. Coupling with the fast adoption of new technologies (e.g., DT), more attention should also be given to the cyber security implications (see, for example, [81]. CRediT authorship contribution statement Jianfeng Zhao: Conceptualization, Methodology, Writing – original draft. Haibo Feng: Conceptualization, Data curation, Supervision. Qian Chen: Visualization, Investigation. Borja Garcia de Soto: Conceptualization, Writing – review & editing. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References [1] P. Cholakis Operation & maintenance planning | WBDG - whole building design guide [online] Wbdg.org. Available at: https://www.wbdg.org/facilities-operations-maintenance/operation-maintenance-planning 2017 [1][13] Cholakis, P. (2017). Operation & Maintenance Planning | WBDG - Whole Building Design Guide. [online] Wbdg.org. Available at: https://www.wbdg.org/facilities-operations-maintenance/operation-maintenance-planning [Accessed 10 May 2021]. [2] K.O. Roper R. Payant The Facility Management Handbook 2014 Amacom [2][58] Roper, K.O. and Payant, R. (2014). The Facility Management Handbook. Amacom. [3] E.M. Wetzel W.Y. Thabet The use of a BIM-based framework to support safe facility management processes Autom. ConStruct. 60 2015 12 24 [online] https://www.sciencedirect.com/science/article/pii/S0926580515001971 Available at [3][74] Wetzel, E.M. and Thabet, W.Y. (2015). The use of a BIM-based framework to support safe facility management processes. Automation in Construction, [online] 60, pp.12-24. Available at: https://www.sciencedirect.com/science/article/pii/S0926580515001971. [4] P. Demian D. Walters The advantages of information management through building information modelling Construct. Manag. Econ. 32 12 2014 1153 1165 [4][14] Demian, P. and Walters, D. (2014). The advantages of information management through building information modelling. Construction Management and Economics, 32(12), pp.1153-1165. [5] C.M. Eastman P.M. Teicholz R. Sacks G. Lee BIM Handbook: a Guide to Building Information Modeling for Owners, Managers, Designers, Engineers and Contractors 2018 Wiley Hoboken, New Jersey [5][17] Eastman, C.M., Teicholz, P.M., Sacks, R. and Lee, G. (2018). BIM handbook: a guide to building information modeling for owners, managers, designers, engineers and contractors. Hoboken, New Jersey: Wiley. [6] J. Heaton A.K. Parlikad J. Schooling Design and development of BIM models to support operations and maintenance Comput. Ind. 111 2019 172 186 [6][25] Heaton, J., Parlikad, A.K. and Schooling, J. (2019). Design and development of BIM models to support operations and maintenance. Computers in Industry, 111, pp.172-186. [7] P.M. Teicholz BIM for Facility Managers 2013 Wiley Hoboken, New Jersey [7][70] Teicholz, P.M. (2013). BIM for facility managers. Hoboken, New Jersey: Wiley. [8] M. Munir A. Kiviniemi S. Jones S. Finnegan BIM-based operational information requirements for asset owners Architect. Eng. Des. Manag. 16 2 2020 100 114 [8][43] Munir, M., Kiviniemi, A., Jones, S. and Finnegan, S. (2020). BIM-based operational information requirements for asset owners. Architectural Engineering and Design Management, 16(2), pp.100-114. [9] T. Tan G. Mills E. Papadonikolaki Z. Liu Combing multi-criteria decision making (MCDM) methods with building information modelling (BIM): a review Autom. ConStruct. 121 2021 103451 [9][67] Tan, T., Mills, G., Papadonikolaki, E. and Liu, Z. (2021). Combing multi-criteria decision making (MCDM) methods with building information modelling (BIM): A review. Automation in Construction, 121, 103451. [10] G.A. Boyes C. Ellul D. Irwin Exploring BIM for operational integrated asset management –a preliminary study utilising real-world infrastructure data ISPRS Ann. Photogrammetr. Remote Sens. Spatial Inf. Sci. 2017 49 56 IV-4/W5 [10][8] Boyes, G.A., Ellul, C. and Irwin, D. (2017). EXPLORING BIM FOR OPERATIONAL INTEGRATED ASSET MANAGEMENT -A PRELIMINARY STUDY UTILISING REAL-WORLD INFRASTRUCTURE DATA. ISPRS Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences, IV-4/W5, pp.49-56. [11] Y. Peng J.-R. Lin J.-P. Zhang Z.-Z. Hu A hybrid data mining approach on BIM-based building operation and maintenance Build. Environ. 126 2017 483 495 [11][53] Peng, Y., Lin, J.-R., Zhang, J.-P. and Hu, Z.-Z. (2017). A hybrid data mining approach on BIM-based building operation and maintenance. Building and Environment, 126, pp.483-495. [12] N.O. Nawari S. Ravindran Blockchain technology and BIM process: review and potential applications J. Inf. Technol. Construct. 24 2019 209 238 [12][46] Nawari, N.O. and Ravindran, S. (2019). Blockchain technology and BIM process: review and potential applications. Journal of Information Technology in Construction, 24, pp.209-238. [13] L. Kong S. Harper D. Mitchell J. Blanche L. Chi W. Kong T. Lim D. Flynn Interactive Digital Twins framework for asset management through internet IEEE Global Conference on Artificial Intelligence and Internet of Things 2020 United Arab Emirates Dubai 12 15 December [13][32] Kong, L., Harper, S., Mitchell, D., Blanche, J., Chi, L., Kong, W., Lim, T. and Flynn, D. (2020). Interactive Digital Twins framework for asset management through internet. IEEE Global Conference on Artificial Intelligence and Internet of Things, Dubai, United Arab Emirates, 12-15 December. [14] F. Tao J. Cheng Q. Qi M. Zhang H. Zhang F. Sui Digital twin-driven product design, manufacturing and service with big data Int. J. Adv. Manuf. Technol. 94 9–12 2017 3563 3576 [online] https://link.springer.com/article/10.1007%2Fs00170-017-0233-1 Available at [14][69] Tao, F., Cheng, J., Qi, Q., Zhang, M., Zhang, H. and Sui, F. (2017). Digital twin-driven product design, manufacturing and service with big data. The International Journal of Advanced Manufacturing Technology, [online] 94(9-12), pp.3563-3576. Available at: https://link.springer.com/article/10.1007%2Fs00170-017-0233-1. [15] Q. Lu X. Xie J. Heaton A.K. Parlikad J. Schooling From BIM towards digital twin: strategy and future development for smart asset management International Workshop on Service Orientation in Holonic and Multi-Agent Manufacturing 2019 Springer Cham 392 404 [15][37] Lu, Q., Xie, X., Heaton, J., Parlikad, A.K. and Schooling, J. (2019). From BIM towards digital twin: strategy and future development for smart asset management. In International Workshop on Service Orientation in Holonic and Multi-Agent Manufacturing (pp. 392-404). Springer, Cham. [16] R. Alonso M. Borras R.H.E.M. Koppelaar A. Lodigiani E. Loscos E. Yöntem SPHERE: BIM digital twin platform Proceedings 20 1 2019 9 [16][2] Alonso, R., Borras, M., Koppelaar, R.H.E.M., Lodigiani, A., Loscos, E. and Yontem, E. (2019). SPHERE: BIM Digital Twin Platform. Proceedings, 20(1), p.9. [17] International Organisation for Standardisation ISO 41011: facility management---vocabulary Available at: https://cdn.standards.iteh.ai/samples/68167/3bec41b3c6a64fd881b735dd3ec1ae74/ISO-41011-2017.pdf 2017 [17][27] International Organisation for Standardisation (2017). ISO 41011: Facility management---vocabulary. Available at: https://cdn.standards.iteh.ai/samples/68167/3bec41b3c6a64fd881b735dd3ec1ae74/ISO-41011-2017.pdf [Accessed 2 Dec. 2021]. [18] M. Xu J.M. David S.H. Kim The fourth industrial revolution: opportunities and challenges Int. J. Financ. Res. 9 2 2018 90 [18][76] Xu, M., David, J.M. and Kim, S.H. (2018). The Fourth Industrial Revolution: Opportunities and Challenges. International Journal of Financial Research, 9(2), p.90. [19] M. Gunduz U. Isikdag M. Basaraner Integration of BIM, web maps and IoT for supporting comfort analysis ISPRS Ann. Photogrammetr. Remote Sens. Spatial Inf. Sci. 2017 221 227 IV-4/W4 [19][23] Gunduz, M., Isikdag, U. and Basaraner, M. (2017). Integration of BIM, web maps and IoT for supporting comfort analysis. ISPRS Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences, IV-4/W4, pp.221-227. [20] K. Yu T. Froese F. Grobler A development framework for data models for computer-integrated facilities management Autom. ConStruct. 9 2 2000 145 167 [20][79] Yu, K., Froese, T. and Grobler, F. (2000). A development framework for data models for computer-integrated facilities management. Automation in Construction, 9(2), pp.145-167. [21] K.-M. Chang R.-J. Dzeng Y.-J. Wu An automated IoT visualization BIM platform for decision support in facilities management Appl. Sci. 8 7 2018 1086 [21][12] Chang, K.-M., Dzeng, R.-J. and Wu, Y.-J. (2018). An Automated IoT Visualization BIM Platform for Decision Support in Facilities Management. Applied Sciences, 8(7), p.1086. [22] C. Okoro I. Musonda The future role of facilities managers in an era of industry 4.0 Proceedings of the Creative Construction Conference 2019 2019 [22][50] Okoro, C. and Musonda, I. (2019). The Future Role of Facilities Managers in an Era of Industry 4.0. Proceedings of the Creative Construction Conference 2019. [23] Q. Qi F. Tao T. Hu N. Anwer A. Liu Y. Wei L. Wang A.Y.C. Nee Enabling technologies and tools for digital twin J. Manuf. Syst. 2019 [23][56] Qi, Q., Tao, F., Hu, T., Anwer, N., Liu, A., Wei, Y., Wang, L. and Nee, A.Y.C. (2019). Enabling technologies and tools for digital twin. Journal of Manufacturing Systems. [24] T. Ruppert J. Abonyi Integration of real-time locating systems into digital twins J. Ind. Inf. Integrat. 20 2020 100174 [24][59] Ruppert, T. and Abonyi, J. (2020). Integration of real-time locating systems into digital twins. Journal of Industrial Information Integration, 20, p.100174. [25] M. Kassem G. Kelly N. Dawood M. Serginson S. Lockley BIM in Facilities Management Applications: a Case Study of a Large University Complex 2015 Built Environment Project and Asset Management 261 277 [online] 5(3) https://research.tees.ac.uk/en/publications/bim-for-facilities-management-evaluating-bim-standards-in-asset-r-3 Available at [25][31] Kassem, M., Kelly, G., Dawood, N., Serginson, M. and Lockley, S. (2015). BIM in facilities management applications: a case study of a large university complex. Built Environment Project and Asset Management, [online] 5(3), pp.261-277. Available at: https://research.tees.ac.uk/en/publications/bim-for-facilities-management-evaluating-bim-standards-in-asset-r-3 [Accessed 7 Jan. 2020]. [26] E. William East N. Nisbet T. Liebich Facility management handover model view J. Comput. Civ. Eng. 27 1 2013 61 67 [26][75] William East, E., Nisbet, N. and Liebich, T. (2013). Facility Management Handover Model View. Journal of Computing in Civil Engineering, 27(1), pp.61-67. [27] Y. Li Y. Zhang J. Wei Y. Han Status quo and future directions of facility management: a bibliometric – qualitative analysis Int. J. Strat. Property Manag. 23 5 2019 354 365 [27][35] Li, Y., Zhang, Y., Wei, J. and Han, Y. (2019). Status quo and future directions of facility management: a bibliometric - qualitative analysis. International Journal of Strategic Property Management, 23(5), pp.354-365. [28] G. Carbonari Sustainable facilities management with support of BIM [PhD Thesis], Available at: https://gala.gre.ac.uk/id/eprint/23657/1/Giulia%20Carbonari%202018%20-%20redacted.pdf 2018 [28][9] Carbonari, G. (2018). Sustainable Facilities Management with Support of BIM. [PhD Thesis] Available at: https://gala.gre.ac.uk/id/eprint/23657/1/Giulia%20Carbonari%202018%20-%20redacted.pdf [Accessed 16 Mar. 2021]. [29] M. Faltejsek B. Chudikova Facility management and building information modeling during operation and maintenance MATEC Web Conf. 277 2019 02022 [29][18] Faltejsek, M. and Chudikova, B. (2019). Facility management and building information modeling during operation and maintenance. MATEC Web of Conferences, 277, p.02022. [30] P. Pishdad-Bozorgi X. Gao C. Eastman A.P. Self Planning and developing facility management-enabled building information model (FM-enabled BIM) Autom. ConStruct. 87 2018 22 38 [30][55] Pishdad-Bozorgi, P., Gao, X., Eastman, C. and Self, A.P. (2018). Planning and developing facility management-enabled building information model (FM-enabled BIM). Automation in Construction, 87, pp.22-38. [31] S. Lavy I.M. Shohet Computer-aided healthcare facility management ASCE J. Comput. Civil Eng. 21 5 2007 363 372 [31][33] Lavy, S. and Shohet, I.M. (2007). Computer-aided healthcare facility management. ASCE Journal of Computing in Civil Engineering, 21(5), 363-372. [32] T. O’Grady H.Y. Chong G.M. Morrison A systematic review and meta-analysis of building automation systems Build. Environ. 195 2021 107770 [32][49] O’Grady, T., Chong, H.Y. and Morrison, G.M. (2021). A systematic review and meta-analysis of building automation systems. Building and Environment, 195, 107770. [33] M. Deng C.C. Menassa V.R. Kamat From BIM to digital twins: a systematic review of the evolution of intelligent building representations in the AEC-FM industry J. Inf. Technol. Construct. 26 2021 58 83 [33][15] Deng, M., Menassa, C.C. and Kamat, V.R. (2021). From BIM to digital twins: a systematic review of the evolution of intelligent building representations in the AEC-FM industry. Journal of Information Technology in Construction, 26, pp.58-83. [34] A. Johnson J. Heaton S. Yule S. Luke D. Pocock A.K. Parlikad J. Schooling Informing the Information Requirements of a Digital Twin: A Rail Industry Case Study 2020 Proceedings of the Institution of Civil Engineers - Smart Infrastructure and Construction 1 12 [34][28] Johnson, A., Heaton, J., Yule, S., Luke, S., Pocock, D., Parlikad, A.K. and Schooling, J. (2020). Informing the Information Requirements of a Digital Twin: A Rail Industry Case Study. Proceedings of the Institution of Civil Engineers - Smart Infrastructure and Construction, pp.1-12. [35] A. Motamedi A. Hammad Y. Asen Knowledge-assisted BIM-based visual analytics for failure root cause detection in facilities management Autom. ConStruct. 43 2014 73 83 [35][42] Motamedi, A., Hammad, A. and Asen, Y. (2014). Knowledge-assisted BIM-based visual analytics for failure root cause detection in facilities management. Automation in Construction, 43, pp.73-83. [36] Q. Lu X. Xie A.K. Parlikad J.M. Schooling E. Konstantinou Moving from Building Information Models to Digital Twins for Operation and Maintenance 2020 Proceedings of the Institution of Civil Engineers - Smart Infrastructure and Construction 1 9 [36][40] Lu, Q., Xie, X., Parlikad, A.K., Schooling, J.M. and Konstantinou, E. (2020c). Moving from Building Information Models to Digital Twins for Operation and Maintenance. Proceedings of the Institution of Civil Engineers - Smart Infrastructure and Construction, pp.1-9. [37] M. Shafto M. Rich D. Glaessgen C. Kemp J. Lemoigne L. Wang Modeling, SiMulation, inforMation technology & ProceSSing roadMaP technology area 11 [online]. Available at: https://www.nasa.gov/sites/default/files/501321main_TA11-ID_rev4_NRC-wTASR.pdf 2012 [37][62] Shafto, M., Rich, M., Glaessgen, D., Kemp, C., Lemoigne, J. and Wang, L. (2012). Modeling, SiMulation, inforMation technology & ProceSSing roadMaP Technology Area 11. [online]. Available at: https://www.nasa.gov/sites/default/files/501321main_TA11-ID_rev4_NRC-wTASR.pdf [Accessed 20 Mar. 2021]. [38] CDBB The approach to delivering a national digital twin for the United Kingdom summary report Available at: https://www.cdbb.cam.ac.uk/files/approach_summaryreport_final.pdf 2020 [38][11] CDBB (2020). The approach to delivering a National Digital Twin for the United Kingdom Summary report. Available at: https://www.cdbb.cam.ac.uk/files/approach_summaryreport_final.pdf [Accessed 21 Mar. 2021]. [39] A. Mussomeli D. Gish S. Laaper Industry 4.0 Enables the Digital Transformation of Supply Chains 2018 [39][44] Mussomeli, A., Gish, D. and Laaper, S. (2018). Industry 4.0 enables the digital transformation of supply chains. [40] P. Zheng H. wang Z. Sang R.Y. Zhong Y. Liu C. Liu K. Mubarok S. Yu X. Xu Smart manufacturing systems for Industry 4.0: conceptual framework, scenarios, and future perspectives Front. Mech. Eng. 13 2 2018 137 150 [40][80] Zheng, P., wang, H., Sang, Z., Zhong, R.Y., Liu, Y., Liu, C., Mubarok, K., Yu, S. and Xu, X. (2018). Smart manufacturing systems for Industry 4.0: Conceptual framework, scenarios, and future perspectives. Frontiers of Mechanical Engineering, 13(2), pp.137-150. [41] P. Parsanezhad J. Dimyadi EFFECTIVE FACILITY MANAGEMENT AND OPERATIONS VIA A BIM-BASED INTEGRATED INFORMATION SYSTEM 2014 [41][52] Parsanezhad, P. and Dimyadi, J. (2014). EFFECTIVE FACILITY MANAGEMENT AND OPERATIONS VIA A BIM-BASED INTEGRATED INFORMATION SYSTEM. [42] K.Y.H. Lim P. Zheng C.-H. Chen A state-of-the-art survey of Digital Twin: techniques, engineering product lifecycle management and business innovation perspectives J. Intell. Manuf. 31 6 2019 1313 1337 [42][36] Lim, K.Y.H., Zheng, P. and Chen, C.-H. (2019). A state-of-the-art survey of Digital Twin: techniques, engineering product lifecycle management and business innovation perspectives. Journal of Intelligent Manufacturing, 31(6), pp.1313-1337. [43] National Infrastructure Commission Data for the public good Available at: https://nic.org.uk/app/uploads/Data-for-the-Public-Good-NIC-Report.pdf 2017 3-5-2020 [43][45] National Infrastructure Commission (2017) Data for the public good. Available at: https://nic.org.uk/app/uploads/Data-for-the-Public-Good-NIC-Report.pdf. [Accessed: 3-5-2020]. [44] Q. Lu A.K. Parlikad P. Woodall G. Don Ranasinghe X. Xie Z. Liang E. Konstantinou J. Heaton J. Schooling Developing a digital twin at building and city levels: case study of West Cambridge campus J. Manag. Eng. 36 3 2020 05020004 [44][38] Lu, Q., Parlikad, A.K., Woodall, P., Don Ranasinghe, G., Xie, X., Liang, Z., Konstantinou, E., Heaton, J. and Schooling, J. (2020a). Developing a Digital Twin at Building and City Levels: Case Study of West Cambridge Campus. Journal of Management in Engineering, 36(3), p.05020004. [45] A. Bolton L. Butler I. Dabson M. Enzer M. Evans T. Fenemore F. Harradence E. Keaney A. Kemp A. Luck N. Pawsey S. Saville J. Schooling M. Sharp T. Smith J. Tennison J. Whyte A. Wilson C. Makri Gemini principles [online] www.repository.cam.ac.uk 2018 https://www.repository.cam.ac.uk/handle/1810/284889 Available at [45][7] Bolton, A., Butler, L., Dabson, I., Enzer, M., Evans, M., Fenemore, T., Harradence, F., Keaney, E., Kemp, A., Luck, A., Pawsey, N., Saville, S., Schooling, J., Sharp, M., Smith, T., Tennison, J., Whyte, J., Wilson, A. and Makri, C. (2018). Gemini Principles. [online] www.repository.cam.ac.uk. Available at: https://www.repository.cam.ac.uk/handle/1810/284889 [Accessed 29 Mar. 2021]. [46] CDBB National digital twin programme Available at https://www.cdbb.cam.ac.uk/what-we-do/national-digital-twin-programme 2018 17 [46][10] CDBB (2018). National digital twin programme. Available at: https://www.cdbb.cam.ac.uk/what-we-do/national-digital-twin-programme. [Accessed: 17-3-2021]. [47] D. Gambhava M. Gräfe D6.5 -Use-Case Demonstration into O&M Platform -Communication, Intelligent Reporting & Information Visualisation PU -Public Use-Case Demonstration into O&M Platform Communication 2020 intelligent reporting & information visualisation [47][21] Gambhava, D. and Grafe, M. (2020). D6.5 -Use-case demonstration into O&M Platform -Communication, intelligent reporting & information visualisation PU -Public Use-case demonstration into O&M Platform Communication, intelligent reporting & information visualisation. [48] S. Fattah N.-M. Sung I.-Y. Ahn M. Ryu J. Yun Building IoT services for aging in place using standard-based IoT platforms and heterogeneous IoT products Sensors 17 10 2017 2311 [48][19] Fattah, S., Sung, N.-M., Ahn, I.-Y., Ryu, M. and Yun, J. (2017). Building IoT Services for Aging in Place Using Standard-Based IoT Platforms and Heterogeneous IoT Products. Sensors, 17(10), p.2311. [49] Q. Lu X. Xie A.K. Parlikad J.M. Schooling Digital twin-enabled anomaly detection for built asset monitoring in operation and maintenance Autom. ConStruct. 118 2020 103277 [49][39] Lu, Q., Xie, X., Parlikad, A.K. and Schooling, J.M. (2020b). Digital twin-enabled anomaly detection for built asset monitoring in operation and maintenance. Automation in Construction, 118, p.103277. [50] P. Aivaliotis K. Georgoulias G. Chryssolouris The use of Digital Twin for predictive maintenance in manufacturing Int. J. Comput. Integrated Manuf. 32 11 2019 1067 1080 [50][1] Aivaliotis, P., Georgoulias, K. and Chryssolouris, G. (2019). The use of Digital Twin for predictive maintenance in manufacturing. International Journal of Computer Integrated Manufacturing, 32(11), pp.1067-1080. [51] J.S. Levy Case studies: types, designs, and logics of inference Conflict Manag. Peace Sci. 25 2008 1 18 [51][34] Levy, J.S. (2008). Case studies: types, designs, and logics of inference. Conflict Management and Peace Science, 25, 1-18. [52] D.W. Stacks R.L. Heath Encyclopedia of Public Relations 2013 SAGE Publications Newbury Park, CA, USA [52][65] Stacks, D.W. and Heath, R.L. (2013). Encyclopedia of Public Relations. Newbury Park, CA, USA: SAGE Publications. [53] K.S. Rebeiz Public–private partnership risk factors in emerging countries: BOOT illustrative case study J. Manag. Eng. 28 4 2012 421 428 [53][57] Rebeiz, K.S. (2012). Public-private partnership risk factors in emerging countries: BOOT illustrative case study. Journal of Management in Engineering, 28(4), 421-428. [54] C. Zhuang J. Liu H. Xiong Digital twin-based smart production management and control framework for the complex product assembly shop-floor Int. J. Adv. Manuf. Technol. 96 2018 1149 1163 Zhuang, C., Liu, J. and Xiong, H. (2018). Digital twin-based smart production management and control framework for the complex product assembly shop-floor. Int. J. Adv. Manuf. Technol., 96, 1149-1163. [55] X. Wang Y. Wang F. Tao A. Liu New paradigm of data-driven smart customisation through digital twin J. Manuf. Syst. 58 2021 270 280 B [55][73] Wang, X., Wang, Y., Tao, F. and Liu, A. (2021). New Paradigm of Data-Driven Smart Customisation through Digital Twin. Journal of Manufacturing Systems, 58 (part B), 270-280. [56] M.S. Ng K. Graser D.M. Hall Digital fabrication, BIM and early contractor involvement in design in construction projects: a comparative case study Architect. Eng. Des. Manag. 2021 1 17 [56][47] Ng, M.S., Graser, K. and Hall, D.M. (2021). Digital fabrication, BIM and early contractor involvement in design in construction projects: a comparative case study. Architectural Engineering and Design Management, 1-17. [57] J. Seawright J. Gerring Case selection techniques in case study research: a menu of qualitative and quantitative options Polit. Res. Q. 61 2 2008 294 308 [57][61] Seawright, J. and Gerring, J. (2008). Case selection techniques in case study research: a menu of qualitative and quantitative options. Political Research Quarterly, 61(2), 294-308. [58] R.K. Yin Case Study Research: Design and Methods 2013 Sage Publications Los Angeles, CA, USA 2013 [58][77] Yin, R.K. (2013). Case study research: design and methods. Los Angeles, CA, USA: Sage Publications, 2013. [59] B.C. Guerra F. Leite K.M. Faust 4D-BIM to enhance construction waste reuse and recycle planning: case studies on concrete and drywall waste streams Waste Manag. 116 2020 79 90 [59][22] Guerra, B.C., Leite, F. and Faust, K.M. (2020). 4D-BIM to enhance construction waste reuse and recycle planning: Case studies on concrete and drywall waste streams. Waste Management, 116, pp.79-90. [60] R. Alshorafa E. Ergen Determining the level of development for BIM implementation in large-scale projects: a multi-case study Eng. Construct. Architect. Manag. 28 1 2019 397 423 [60][3] Alshorafa, R. and Ergen, E. (2019). Determining the level of development for BIM implementation in large-scale projects: a multi-case study. Engineering, Construction and Architectural Management, 28(1), pp.397-423. [61] J.J. Hox H.R. Boeije Data collection, primary vs. secondary Encycl. Soc. Meas. 1 2005 593 599 [61][26] Hox, J.J. and Boeije, H.R. (2005). Data collection, primary vs. secondary. Encyclopedia of Social Measurement, 1, 593-599. [62] J. Schöpfel D.J. Farace Grey literature M.J. Bates M.N. Maack Encyclopedia of Library and Information Sciences 2010 CRC Press 2029 2039 3rd Ed [62][60] Scho¨pfel, J., and Farace, D.J. (2010). Grey Literature. In Encyclopedia of Library and Information Sciences, M. J. Bates and M. N. Maack, Eds. 3rd Ed.: CRC Press, pp. 2029-2039. [63] T.F. Søndergaard J. Andersen B. Hjørland Documents and the communication of scientific and scholarly information J. Doc. 59 3 2003 278 320 Soendergaard, T.F., Andersen, J. and Hjoerland, B. (2003). Documents and the communication of scientific and scholarly information, Journal of Documentation, 59(3), 278-320. [64] M.P. Johnston Secondary data analysis: a method of which the time has come Qual. Quan. Methods Libr. 3 2014 619 626 [64][29] Johnston, M.P. (2014). Secondary data analysis: a method of which the time has come. Qualitative and Quantitative Methods in Libraries, 3, 619-626. [65] Y. Peng M. Zhang F. Yu J. Xu S. Gao Digital twin hospital buildings: an exemplary case study through continuous lifecycle integration Adv. Civ. Eng. 2020 1 13 2020 [65][54] Peng, Y., Zhang, M., Yu, F., Xu, J. and Gao, S. (2020). Digital Twin Hospital Buildings: An Exemplary Case Study through Continuous Lifecycle Integration. Advances in Civil Engineering, 2020, pp.1-13. [66] N. Yousefnezhad A. Kaur Malhi T. Keyriläinen K. Främling M. Huotari Product lifecycle information management with digital twin: a case study International Conference on Industrial Informatics 2020 [66][78] Yousefnezhad, N., Kaur Malhi, A., Keyrilainen, T., Framling, K. and Huotari, M. (2020). Product Lifecycle Information Management with Digital Twin: A Case Study. In: International Conference on Industrial Informatics. [67] X.V. Wang L. Wang Digital twin-based WEEE recycling, recovery and remanufacturing in the background of Industry 4.0 Int. J. Prod. Res. 57 12 2018 3892 3902 [67][72] Wang, X.V. and Wang, L. (2018). Digital twin-based WEEE recycling, recovery and remanufacturing in the background of Industry 4.0. International Journal of Production Research, 57(12), pp.3892-3902. [68] B. Ashtari Talkhestani M. Weyrich Digital Twin of manufacturing systems: a case study on increasing the efficiency of reconfiguration Automatisierungstechnik 68 6 2020 435 444 [68][5] Ashtari Talkhestani, B. and Weyrich, M. (2020). Digital Twin of manufacturing systems: a case study on increasing the efficiency of reconfiguration. at - Automatisierungstechnik, 68(6), pp.435-444. [69] R. Drath V. Miegel AutomationML verbindet werkzeuge der Anlagenplanung - Automatisierungstechnische Praxis 51 2009 34 07, atp edition [69][16] Drath, R. and Miegel, V. (2009). AutomationML verbindet Werkzeuge der Anlagenplanung. atp edition - Automatisierungstechnische Praxis, 51(07), p.34. [70] B. He K. Bai Digital twin-based sustainable intelligent manufacturing: a review Adv. Manufac. 9 2021 1 21 [70][24] He, B. and Bai, K. (2021). Digital twin-based sustainable intelligent manufacturing: a review. Advances in Manufacturing, 9, 1-21. [71] S.A. Niederer M.S. Sacks M. Girolami K. Willcox Scaling digital twins from the artisanal to the industrial Nat. Comput. Sci. 1 2021 313 320 [71][48] Niederer, S.A., Sacks, M.S., Girolami, M. and Willcox, K. (2021). Scaling digital twins from the artisanal to the industrial. Nature Computational Science, 1, 313-320. [72] S.K. Bansal S. Kagemann Integrating big data: a semantic extract-transform-load framework Computer 48 3 2015 42 50 [72][6] Bansal, S.K. and Kagemann, S. (2015). Integrating Big Data: A Semantic Extract-Transform-Load Framework. Computer, 48(3), pp.42-50. [73] E.A. Pärn D.J. Edwards M.C.P. Sing The building information modelling trajectory in facilities management: a review Autom. ConStruct. 75 2017 45 55 [73][51] Parn, E.A., Edwards, D.J. and Sing, M.C.P. (2017). The building information modelling trajectory in facilities management: A review. Automation in Construction, 75, pp.45-55. [74] M.G. Juarez V.J. Botti A.S. Giret Digital twins: review and challenges J. Comput. Inf. Sci. Eng. 21 3 2021 [74][30] Juarez, M.G., Botti, V.J. and Giret, A.S. (2021). Digital Twins: Review and Challenges. Journal of Computing and Information Science in Engineering, 21(3). [75] Arup Digital twin [online]. Available at: https://www.arup.com/-/media/arup/files/publications/d/digital-twin-report.pdf 2019 [75][4] Arup (2019). Digital twin. [online]. Available at: https://www.arup.com/-/media/arup/files/publications/d/digital-twin-report.pdf [Accessed 11 May 2021]. [76] UK BIM Alliance Information Management According to BS EN ISO 19650 Guidance Part 2: Processes for Project Delivery Published by | 1 Guidance Part 2: Processes for Project Delivery 2019 [76][71] UK BIM Alliance (2019). Information management according to BS EN ISO 19650 Guidance Part 2: Processes for Project Delivery Published by | 1 Guidance Part 2: Processes for Project Delivery. [77] S. Tang D.R. Shelden C.M. Eastman P. Pishdad-Bozorgi X. Gao A review of building information modeling (BIM) and the internet of things (IoT) devices integration: present status and future trends Autom. ConStruct. 101 2019 127 139 [77][68] Tang, S., Shelden, D.R., Eastman, C.M., Pishdad-Bozorgi, P. and Gao, X. (2019). A review of building information modeling (BIM) and the internet of things (IoT) devices integration: Present status and future trends. Automation in Construction, 101, pp.127-139. [78] J. Steel R. Drogemuller B. Toth Model interoperability in building information modelling Software Syst. Model 11 1 2012 99 109 [78][66] Steel, J., Drogemuller, R. and Toth, B. (2012). Model interoperability in building information modelling. Software & Systems Modeling, 11(1), pp.99-109. [79] B. Flyvbjerg Five misunderstandings about case-study research Qual. Inq. 12 2 2006 219 245 [79][20] Flyvbjerg, B. (2006). Five misunderstandings about case-study research. Qualitative Inquiry, 12(2), pp.219-245. [80] M. May G. Williams The Facility Manager's Guide to Information Technology 2017 International Facility Management Association [80][41] May, M. and Williams, G. (2017). The facility manager’s guide to information technology. International Facility Management Association. [81] M.S. Sonkor B. García de Soto Operational technology on construction sites: a review from the cybersecurity perspective J. Construct. Eng. Manag. 147 12 2021 04021172 Sonkor, M.S. and Garcia de Soto, B. (2021). Operational technology on construction sites: a review from the cybersecurity perspective. J. Construct. Eng. Manag., 147(12), 04021172.",
    "scopus-id": "85123012263",
    "coredata": {
        "eid": "1-s2.0-S2352710222000419",
        "dc:description": "Globally, the Architecture Engineering Construction (AEC) industry has seen a rise in the adoption of digital twin (DT) technologies due to their potential to enhance collaboration and information communication throughout the project lifecycle from the design to operation and maintenance (O&M) phase. However, empirical evidence on such adoption is fragmented, particularly for facility management (FM) activities during the O&M phase. Considering this gap, an illustrative case study approach is performed to analyze and compare the traditional practices of FM with DT-driven FM during the O&M phase using four geospatially representative cases. The findings show that DT technologies enable efficient and responsive planning and control of FM activities by providing real-time status of the building assets. However, barriers such as the misalignment of the data integration and data standards hamper their future implementation. To address this, a bottom-up conceptual framework is proposed to facilitate a wider implementation of DT technologies and support FM during the O&M phase of buildings. As such, this paper’s contribution is twofold: (1) it provides an aggregate landscape of DT application to manage facilities during the O&M phase, and (2) it develops an evidence-induced conceptual framework for stakeholders who are grappling with their FM decision-making processes.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2022-05-15",
        "openaccessUserLicense": null,
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S2352710222000419",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Zhao, Jianfeng"
            },
            {
                "@_fa": "true",
                "$": "Feng, Haibo"
            },
            {
                "@_fa": "true",
                "$": "Chen, Qian"
            },
            {
                "@_fa": "true",
                "$": "Garcia de Soto, Borja"
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S2352710222000419"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S2352710222000419"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": null,
        "pii": "S2352-7102(22)00041-9",
        "prism:volume": "49",
        "articleNumber": "104028",
        "prism:publisher": "Elsevier Ltd.",
        "dc:title": "Developing a conceptual framework for the application of digital twin technologies to revamp building operation and maintenance processes",
        "prism:copyright": "© 2022 Elsevier Ltd. All rights reserved.",
        "openaccess": "0",
        "prism:issn": "23527102",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Building information modelling"
            },
            {
                "@_fa": "true",
                "$": "Case study"
            },
            {
                "@_fa": "true",
                "$": "Conceptual framework"
            },
            {
                "@_fa": "true",
                "$": "Digital twin"
            },
            {
                "@_fa": "true",
                "$": "Facility management"
            }
        ],
        "openaccessArticle": "false",
        "prism:publicationName": "Journal of Building Engineering",
        "openaccessSponsorType": null,
        "prism:pageRange": "104028",
        "pubType": "fla",
        "prism:coverDisplayDate": "15 May 2022",
        "prism:doi": "10.1016/j.jobe.2022.104028",
        "prism:startingPage": "104028",
        "dc:identifier": "doi:10.1016/j.jobe.2022.104028",
        "openaccessSponsorName": null
    },
    "objects": {"object": [
        {
            "@category": "standard",
            "@height": "535",
            "@width": "311",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-gr1.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "41291",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "739",
            "@width": "600",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-gr2.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "92926",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "163",
            "@width": "95",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-gr1.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "4885",
            "@ref": "gr1",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "133",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-gr2.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "5645",
            "@ref": "gr2",
            "@mimetype": "image/gif"
        },
        {
            "@category": "high",
            "@height": "2371",
            "@width": "1378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-gr1_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "307563",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "3272",
            "@width": "2656",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-gr2_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "599448",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352710222000419-am.pdf?httpAccept=%2A%2F%2A",
            "@multimediatype": "Acrobat PDF file",
            "@type": "AAM-PDF",
            "@size": "790053",
            "@ref": "am",
            "@mimetype": "application/pdf"
        }
    ]},
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/85123012263"
    }
}}