{"full-text-retrieval-response": {
    "scopus-eid": "2-s2.0-85118123505",
    "originalText": "serial JL 271089 291210 291731 291800 291881 31 90 Energy and Buildings ENERGYBUILDINGS 2021-10-16 2021-10-16 2021-10-29 2021-10-29 2024-02-02T14:57:46 1-s2.0-S0378778821008562 S0378-7788(21)00856-2 S0378778821008562 10.1016/j.enbuild.2021.111572 S300 S300.1 FULL-TEXT 1-s2.0-S0378778821X00217 2024-02-02T15:25:20.445111Z 0 0 20220101 2022 2021-10-16T06:20:00.351281Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid fundingbodyid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder sponsoredaccesstype srctitle srctitlenorm srctype ssids alllist content oa subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast footnotes grantnumber grantsponsor grantsponsorid orcid primabst ref 0378-7788 03787788 UNLIMITED EPSRCPP true 254 254 C Volume 254 28 111572 111572 111572 20220101 1 January 2022 2022-01-01 2022 Research Articles article fla © 2021 The Author(s). Published by Elsevier B.V. ENERGYSAVINGSDOMESTICZONALHEATINGCONTROLSROBUSTEVIDENCEACONTROLLEDFIELDTRIAL LOMAS K 1 Introduction 2 Trial protocols and methods 2.1 Trial design and research questions 2.2 Analysis method 2.3 Project schedule and activities 2.4 Data collection 2.5 Data cleaning 2.6 The trial homes 3 Results 3.1 Calculated savings in gas demand 3.1.1 Annual savings in gas demand: Simple analysis 3.1.2 Savings in gas demand: weather-corrected analysis 3.1.3 Reduction in gas demand on cold days 3.2 Gas demand savings in individual homes 3.3 Gas demand and whole house temperatures on cold days 3.4 Changes of temperature in individual rooms 3.5 Statistical analysis of house or household characteristics 4 Discussion 4.1 Zonal controls, energy savings and room temperatures 4.2 Field trial methodology 4.3 Wider relevance 4.4 Study limitations 5 Conclusions References BEIZAEE 2015 29 44 A COCKROFT 2017 1 11 J CONNOLLY 2014 475 489 D LOMAS 2019 90 117 K LOMAS 2018 52 75 K MALLABAND 2016 B BEHAVE20164THEUROPEANCONFERENCEBEHAVIOURENERGYEFFICIENCY8TH9THSEPTEMBER2016 INTELLIGENTHEATINGCONTROLSOUTSMARTORDINARYUSERS MARSHALL 2016 98 108 E PALMER J ROBERTS 2018 29 38 B RODRIGUEZPERTUZ 2020 110006 M LOMASX2022X111572 LOMASX2022X111572XK Full 2021-10-14T06:34:39Z FundingBody Engineering and Physical Sciences Research Council http://creativecommons.org/licenses/by/4.0/ HEFCE none 2022-10-29T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY license. © 2021 The Author(s). Published by Elsevier B.V. 2021-11-09T06:17:32.443Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/aggregated-refined John Unwin Electrical Contractors Ltd Centre for Doctoral Training in Energy Demand Kingfisher plc Digital Economy and Energy Programme of Research Councils UK Mark Group Ltd. Secure Meters UK Department for Business, Energy and Industrial Strategy BEIS Department for Business, Energy and Industrial Strategy, UK Government http://data.elsevier.com/vocabulary/SciValFunders/100011693 http://sws.geonames.org/2635167/ Digital Energy Feedback and Control Technology Optimisation Engineering and Physical Sciences Research Council EP/K00249X/1 EP/L01517X/1 EPSRC Engineering and Physical Sciences Research Council http://data.elsevier.com/vocabulary/SciValFunders/501100000266 http://sws.geonames.org/2635167/ The data was collected and analysed as part of the Digital Energy Feedback and Control Technology Optimisation (DEFACTO) project. The project was funded through the Digital Economy and Energy Programme of Research Councils UK, by the Engineering and Physical Sciences Research Council (EPSRC grant EP/K00249X/1 ). Additional support was through the Centre for Doctoral Training in Energy Demand (LoLo) (EPSRC grant EP/L01517X/1 ). The data was collected and analysed as part of the Digital Energy Feedback and Control Technology Optimisation (DEFACTO) project. The project was funded through the Digital Economy and Energy Programme of Research Councils UK, by the Engineering and Physical Sciences Research Council (EPSRC grant EP/K00249X/1). Additional support was through the Centre for Doctoral Training in Energy Demand (LoLo) (EPSRC grant EP/L01517X/1). The research would not have been possible without the dedicated contribution of many researchers in addition to those authoring this paper, in particular: Dr Becky Mallaband, Dr Andrea Burris, Dr Ehab Foda, Dr Sven Hallin and Dr Dan Wright. The research team were supported by an advisory board with representatives from: the UK Department for Business, Energy and Industrial Strategy (BEIS), Kingfisher plc, the Mark Group Ltd. Secure Meters (UK) Ltd, the Energy Systems Catapult and Honeywell Home, Resideo, who provided guidance on interrogating and installing the zonal control systems. Sub-contractors were also important to the project's success: Accent, the Evolve Partnership Ltd. SMS (Smart Metering Systems) plc, Seluxit, Mere End Consultants Ltd. and John Unwin Electrical Contractors Ltd. The research team is also grateful to the many, tolerant households that participated in our study. The research team were supported by an advisory board with representatives from: the UK Department for Business, Energy and Industrial Strategy (BEIS), Kingfisher plc, the Mark Group Ltd., Secure Meters (UK) Ltd, the Energy Systems Catapult and Honeywell Home, Resideo, who provided guidance on interrogating and installing the zonal control systems. item S0378-7788(21)00856-2 S0378778821008562 1-s2.0-S0378778821008562 10.1016/j.enbuild.2021.111572 271089 2024-02-02T15:25:20.445111Z 2022-01-01 UNLIMITED EPSRCPP 1-s2.0-S0378778821008562-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/MAIN/application/pdf/59cd46d3a567681b8e20d3db212d6702/main.pdf main.pdf pdf true 803938 MAIN 12 1-s2.0-S0378778821008562-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/PREVIEW/image/png/43c908d06bd336d9d337f88be2048a05/main_1.png main_1.png png 60610 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0378778821008562-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr1/HIGHRES/image/jpeg/c5e9f873d62f202685886ee681d1d0cf/gr1.jpg gr1 gr1.jpg jpg 15898 201 378 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821008562-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr2/DOWNSAMPLED/image/jpeg/f722c1302306ff4cd81e1f275663ae93/gr2.jpg gr2 gr2.jpg jpg 13833 310 378 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821008562-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr3/DOWNSAMPLED/image/jpeg/7424564ff81f9228e968ed23b243ebc9/gr3.jpg gr3 gr3.jpg jpg 22098 323 378 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821008562-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr4/THUMBNAIL/image/jpeg/a03534346573fe2af9ea0549d3ab7672/gr4.jpg gr4 gr4.jpg jpg 20812 325 378 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821008562-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr5/DOWNSAMPLED/image/jpeg/75c0666cb246a0a050de2964db20ae5f/gr5.jpg gr5 gr5.jpg jpg 22925 292 378 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821008562-gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr6/DOWNSAMPLED/image/jpeg/c79276c8e5cc835927cbd8e533564f26/gr6.jpg gr6 gr6.jpg jpg 14964 277 378 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821008562-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr1/DOWNSAMPLED/image/gif/f25dae11393f0b77e7a0467d5e98029d/gr1.sml gr1 gr1.sml sml 10281 117 219 IMAGE-THUMBNAIL 1-s2.0-S0378778821008562-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr2/THUMBNAIL/image/gif/1959f351edec333db5a9c46a733a1bce/gr2.sml gr2 gr2.sml sml 2907 163 199 IMAGE-THUMBNAIL 1-s2.0-S0378778821008562-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr3/THUMBNAIL/image/gif/49e12a08a8a0426cb8b4fc7937a2b85a/gr3.sml gr3 gr3.sml sml 5632 164 192 IMAGE-THUMBNAIL 1-s2.0-S0378778821008562-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr4/THUMBNAIL/image/gif/106246f9cb6c5326be281430f74227a5/gr4.sml gr4 gr4.sml sml 4941 164 190 IMAGE-THUMBNAIL 1-s2.0-S0378778821008562-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr5/THUMBNAIL/image/gif/207d8829895e13f92e3ee5629805b19d/gr5.sml gr5 gr5.sml sml 5820 164 212 IMAGE-THUMBNAIL 1-s2.0-S0378778821008562-gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/gr6/DOWNSAMPLED/image/gif/6d99398728e3ffd6aab1cad1be59b6c1/gr6.sml gr6 gr6.sml sml 4267 160 219 IMAGE-THUMBNAIL 1-s2.0-S0378778821008562-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/HIGHRES/image/jpeg/e5b3e2b215a574b98f9dc9fbb061bd3d/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 97308 891 1673 IMAGE-HIGH-RES 1-s2.0-S0378778821008562-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/HIGHRES/image/jpeg/c611dd3b16f5ed7756c353129d9b5e05/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 85545 1374 1673 IMAGE-HIGH-RES 1-s2.0-S0378778821008562-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/MAIN/image/jpeg/2415b98d1dcc7c692e472cfe07b6d7a3/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 156241 1429 1673 IMAGE-HIGH-RES 1-s2.0-S0378778821008562-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/HIGHRES/image/jpeg/07ce66720bf8abf50c4a94d103893c9b/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 128210 1440 1673 IMAGE-HIGH-RES 1-s2.0-S0378778821008562-gr5_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/HIGHRES/image/jpeg/688fad310a4e5fd617cc2e4271546244/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 168263 1293 1673 IMAGE-HIGH-RES 1-s2.0-S0378778821008562-gr6_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821008562/HIGHRES/image/jpeg/4b39c56172c69b7627e44d4ab36a83bf/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 85170 1225 1673 IMAGE-HIGH-RES 1-s2.0-S0378778821008562-am.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10MJ8X57RG1/MAIN/application/pdf/364849d4344bf85e815a58a2dffa59e7/am.pdf am am.pdf pdf false 422209 AAM-PDF ENB 111572 111572 S0378-7788(21)00856-2 10.1016/j.enbuild.2021.111572 The Author(s) Fig. 1 Honeywell Evohome controller and HR92 smart radiator valve (source, Honeywell [26]). Fig. 2 Percentage change in the annual weather-corrected gas demands between Year 1 and Year 2, for homes in the Zonal Control Group and Matched Group. Fig. 3 The change in whole-house temperature on cold days between Years 1 and 2 and the corresponding change in weather-corrected gas demand. Fig. 4 The change in the indoor temperatures on cold days between Year 1 and Year 2 in the Zonal Control Group and the Matched Group: changes for the mean whole house, bedrooms, living room and other rooms. Fig. 5 Mean half-hourly temperatures in the bedrooms during the heating season in Year 1 and Year 2 for the Zonal Control Group and Matched Group of homes. Fig. 6 Annual SAP-calculated space heating demand for homes in the Zonal Control Group: comparison of homes that reduced gas demand in Year 2 with homes that used more gas in Year 2. Table 1 Schedule of field trial activities and data collection. Field trial activities and data collection Dates Development of research methods 1st Nov 2012 − 31st Oct 2014 Pilot study1 1st Feb 2014 – 31st Mar 2015 Main trial recruitment 1st Nov 2014 – 31 Mar 2015 Initial winter of data collection 1st Oct 2015 – 28th Feb 2016 Home energy survey 4th Dec 2015 – 30th Mar 20162 Questionnaire 1 responses received 19th Nov 2015 – 18th May 2016 Baseline data collection, referred to as ‘Year 1′3 3rd Nov 2015 – 1st Nov 20164 Zonal controls installed in willing homes 1st Nov 2016 – 7th Mar 2017 Post-intervention data collection, referred to as ‘Year 2′5 8th Mar 2017 – 7th Mar 2018 Questionnaire 2 responses received 30th August 2018 – 25th Oct 2018 Feedback and decommissioning 19th Jun 2018 − 13th Nov 2018 1The pilot homes were retained and analysed in a parallel activity to the main study. 2By when 95% of surveys were complete, the remainder took until October 2016. 3The year finished immediately before the first zonal controls were installed. 42016 was a leap year, so to make a fair comparison, a 365-day period of data was selected for Year 1 and Year 2, leading to the unexpected end date of Year 1. 5The year starts immediately after the last zonal controls were installed. Table 2 Characteristics of the dwellings, occupants and heating controls in each Group. Parameter Zonal control group Matched group Number of homes 37 31 Dwelling characteristics Average occupied floor area / m2 1 100 97 Average number of heated rooms 6.1 6.1 Number with two bedrooms or less 1 0 Average energy efficiency rating and band from EPC 2 62 / D 63 / D Minimum and maximum energy efficiency rating 43–78 45–87 Annual space heating demand stated on EPC / kWh 13,730 12,290 Occupancy characteristics Average number of people in household 3.5 2.6 Number of single person households 2 4 Number of households with retired people 6 13 Number of households with HRP3 over 65 years old 6 6 Number with households with estimated income less than £20,000 9 8 Number with permanent or all-day occupancy 15 19 Heating system Number with combi boiler4 32 23 Number with condensing boiler5 27 23 Number with secondary heating used sometimes / often 17 / 4 12 / 5 Heating controls Programmer only 3 1 Programmer and room thermostat 4 2 Programmer, TRVs and bypass 8 5 Programmer, room thermostat and TRVs 21 22 TRVs and bypass 1 1 1The average floor area of English homes in 2018 was: all tenures, 95 m2; owner-occupied homes 108 m2 [35]. 2In English homes, the average Energy Performance Certificate rating band, in 2018 was 63, 46% of all English homes are in rating band D [35]. 3Household Representative Person, that completed the recruitment questionnaire. 4Remaining homes have conventional boilers. 5Remainder have non-condensing boilers. Table 3 Changes in annual gas demand for the two groups of homes. Zonal Control Matched Year 1 Year 2 Year 1 Year 2 Number of homes 37 31 Mean floor area (m2)1 100 97 Annual gas demand Mean annual gas demand (kWh)2 15,953 16,443 14,987 16,008 Mean daily gas demand (kWh) 43.71 45.05 41.06 43.86 Mean normalised gas demand (kWh/m2)3 160 165 158 169 Change in mean gas demand +3.07% +6.81% Median change in gas demand +2.47% +8.31% Weather-corrected annual gas demand Mean heating degree days (HDD) (°C days)4 1,985 2,174 1,974 2,164 Mean weather-correction factor4 1.018 0.930 1.024 0.934 Mean gas demand (kWh) 5 16,295 15,322 15,332 14,955 Change in mean gas demand −5.97% −2.46% Median change in gas demand −6.29% −1.28% 1The average floor area of English homes, in 2018 was: all tenures 95 m2 owner-occupied homes 108 m2 [35]. 2In the period from 1/10/15 to 30/09/16, the mean and median weather-corrected gas usage in English homes were 13,077 kWh and 11,641 kWh respectively, and in the East Midlands, where the DEFACTO homes are located, 13,322 kWh and 12,114 kWh, respectively ([1], Table 6). 3Based on the normalised demand of the individual homes in the Group. 4Calculated annual mean HDD to base 15.5 °C (HDD15.5) for all weather stations associated with each group of homes. The correction factor is the standard HDD value of 2021 °C.days [13] divided by HDD15.5. 5Mean gas demand after weather-correcting each homes’ gas demand using the locally-recorded HDD15.5 values. Table 4 Changes in gas demand on cold days for the two groups of homes. Zonal Control Matched Year 1 Year 2 Year 1 Year 2 Number of homes 37 31 Mean floor area (m2) 100 97 Gas demand on cold days1 Mean gas demand (kWh) 15,241 15,827 14,318 15,433 Mean daily gas demand (kWh)2 51.23 50.98 47.98 49.88 Mean normalised gas demand (kWh/m2) 152 158 148 159 Mean change in mean daily gas demand3 −0.48% +3.96% Median change in mean daily gas demand −0.65% +5.64% Weather-corrected gas demand on cold days Mean weather-corrected gas demand (kWh) 15,515 14,719 14,662 14,414 Change in mean gas demand −5.13% −1.69% Median change in gas demand −4.78% −0.46% House temperature on cold days Mean whole house temperature (oC) 19.04 18.82 19.52 19.59 Median whole house temperature (oC) 18.71 18.62 19.21 19.37 1Days in the year when the daily mean outdoor air temperature at each homes’ local weather station was below 15.5 °C. 2The number of cold days differs for each home in the trials. 3The analysis is based on the Mean Daily Gas Demand of each house rather than the Mean Gas Demand for the Group/Year. Energy savings from domestic zonal heating controls: Robust evidence from a controlled field trial K.J. Lomas a ⁎ D. Allinson a S. Watson a A. Beizaee a V.J. Haines b M. Li a a Building Energy Research Group, School of Architecture, Building and Civil Engineering, Loughborough University, Loughborough, Leics. LE11 3TU, UK Building Energy Research Group School of Architecture, Building and Civil Engineering Loughborough University Loughborough Leics. LE11 3TU UK Building Energy Research Group, School of Architecture, Building and Civil Engineering, Loughborough University, Loughborough, Leics. LE11 3TU, UK b User centred Design Research Group, Design School, Loughborough University, Loughborough, Leics. LE11 3TU, UK User centred Design Research Group Design School Loughborough University Loughborough Leics. LE11 3TU UK User centred Design Research Group, Design School, Loughborough University, Loughborough, Leics. LE11 3TU, UK ⁎ Corresponding author. Domestic zonal heating controls enable hydronic systems to heat rooms to different temperatures at different times. The first credible evidence known to the authors, of the in-use energy savings of such controls, is reported. The results and research methods are globally relevant. The energy demands and room temperatures in 68, gas-heated, owner-occupied, semi-detached homes, in the English Midlands were monitored for a year before zonal controls were fitted in 37 of the homes prior to the second year of monitoring. The other homes retained the existing heating controls and so provided a matched (control) group. Surveys and questionnaires characterised the dwellings, heating systems and households. In two thirds of the homes with zonal controls the annual gas demand decreased, in one third it increased. Overall, the mean gas demand decreased by 3.5% relative to the homes that retained their existing controls. Savings were achieved primarily by reducing bedroom temperatures, especially in the evenings. Wireless, digital zonal controls are unlikely to provide an acceptable payback through reductions in energy bills at today’s prices, but they offer households the flexibility to react to time-of-use energy pricing. A matched (control) group is essential for the reliable calculation of energy demand changes arising from interventions in occupied homes. Keywords Zonal heating controls Occupied homes Field measurement Control group Energy savings Room temperatures 1 Introduction In 2014, the buildings sector accounted for 31% of total global final energy use, 54% of final electricity demand, and 8% of energy-related CO2 emissions or 23% if emissions from upstream electricity generation is accounted for [28] 1 1 The IPCC refers to 2017 figures by the International Energy Agency. . In the UK, approximately 14% of total emissions comes from heating homes but the current annual emissions trajectory is incompatible with achieving a net-zero economy by 2050 [23] and so energy efficiency improvements are an imperative. Gas-fired, hydronic heating systems dominate the English housing stock with some 93% of the 24.4 million English homes having such systems [35]. Consequently, gas represents 64% of all domestic energy consumption [2] and 18.6% of total UK energy consumption by final end use [3]. Similarly, in the 27 EU countries of 2010, 30% of energy use was for heating buildings, of which 64% was gas, oil or coal [14]. The global need to combat climate change, will drive a shift in home heating away from fossil fuels towards electricity supplied from renewable sources both in the UK [11] and as a component of net zero energy homes in Europe [40]. Hydronic heating systems based on heat pumps will become common place in Europe [18] and elsewhere [28]. The energy demand for space heating and any consequential CO2 emissions can be reduced by any combination of increased thermal resistance and airtightness of the building fabric, increased efficiency of the space heating system, or reduction of the average indoor temperature by reducing the set-point or limiting the duration and/or spatial extent of heating. Evidence for the energy saving achieved by insulating the building fabric and installing more efficient heating systems is relatively robust [4]. However, reducing indoor temperatures depends on the actions and choices of the household and, because predicting what people might do is difficult, it is particularly challenging to quantify the potential for energy savings. Whilst fabric efficiency measures might be effective for decades, the long-term durability of any savings from occupants’ changes in heating behaviour is less secure. Space heating controls are essential for the safe and cost-effective operation of heating systems. They also enable households to achieve a desired, comfortable indoor temperature and, perhaps, save energy by heating their home only when and where it is needed. Typically, a programmable timer controls when heat is delivered for space heating, and separately for domestic hot water. A whole house thermostat limits the heat output when the house is up to the set-point temperature 2 2 In the English domestic stock as a whole, 99% of homes have a programmer and 85% a room thermostat, 76% of English homes have TRVs [36]. In some homes there is no room thermostat and TRVs alone control the room temperatures. The heating system is then fitted with a bypass to maintain circulation when heat demands are low. . In the EU, heating controls must comply with the Energy Performance of Buildings Directive [40], therefore since October 2010, new UK homes over 150 m2 have separately zoned temperature and time control for living areas and sleeping areas [22]. This is usually achieved by installing two separately-controlled hydronic circuits and is therefore difficult to retrofit into existing homes. Wall mounted radiators are the most common method of delivering heat to European homes, with underfloor heating being an alternative. Conventional thermostatic radiator valves (TRVs) enable limited control of the set-point temperature on a room-by-room basis. Innovation using digital and wireless technologies has enabled the creation of programmable TRVs which can control both the room set-point temperature and the timing of heat delivery by setting different set-points at different times in different rooms. The programming of domestic hot water heating is unaffected. These ‘smart TRVs’ are relatively easy to fit to existing radiators and can be programmed from a wireless controller or even from a smartphone app. Typical systems are marketed by most of the leading heating controls manufacturers, e.g., Drayton [17], Hive [21], Tado [47], Worcester Bosch [49] and Honeywell [24] (Fig. 1 ). Market analysts predict significant growth in the global smart thermostat market (e.g., [19] and the European market for smart TRVs (e.g., [10]). Standalone, programmable TRVs are not linked to a central controller or the boiler and only control heat delivery and room temperature when the central timer has the heating switched on. Typical TRVs of this type are manufactured by Honeywell [25] and Pegler [42]. Professional installation of a complete wireless system can cost more than £1000, depending on the number of radiators and the complexity of the installation, while individual programmable valves may be purchased for DIY installation for less than £20. How much energy can be saved by retrofitting zonal space heating controls in homes? The answer to this complex socio-technical problem depends on how well the heating system was controlled (either manually or ‘automatically’) prior to installing the new controls and how the household interacts with the new controls: from the initial set-up of time/temperature schedules to the ad-hoc interactions that change or override that programme. A 2014 study observed that very few UK studies have rigorously evaluated the overall effect of providing households with technologically improved heating controls in terms of energy saved [15,16]. A later meta-analysis of also revealed the lack of robust evidence to support the energy saving potential of nearly all space heating controls, and noted that most studies adopted an experimental protocol that could never have provided robust, conclusive evidence [30]. However, the analysis revealed that zonal space heating controls had more potential than other heating controls based on some small-scale UK trials - experiments in test houses and dynamic thermal simulation. Savings of 8–18% were found in a two-home study using a novel predictive controller [46] and rigorous experiments in a matched pair of test houses with synthetic occupancy [43] showed savings of around 12% [8]. Predictions using dynamic thermal simulation indicated that the absolute and percentage energy savings would be between 0.2 and 2.2 percentage points lower, in well-insulated dwellings, depending on location [7]. The costs of the zonal control systems when compared to the absolute energy cost savings produced long payback times, especially so in well-insulated homes [7,8]. In other UK modelling studies, energy savings of 10–15% [33] and 8–37% [12] have been reported. Elsewhere, using dynamic thermal simulation, zonal space heating controls have been reported to be ‘cost effective’ for homes in Mediterranean climates [44]. A short duration, single home study in Canada claimed savings of c36% [27]. However, all these studies, and particularly those that rely on modelling, make assumptions about how households will interact with the controls and space heating system, so do not provide reliable evidence of the systems’ in-use performance. A qualitative survey of 100 UK households with zonal controls observed ‘that consumers use heat in diverse and ever-varied ways’ [9]. Neither this, or earlier field studies, provided robust evidence about which households are most likely to save energy and how much energy may be saved. Field trials to identify the energy savings from interventions in homes are notoriously challenging, and especially when these relate to space heating. Many studies compare the measured energy use after an intervention with the energy use before and try to account for the different weather during each period using heating or cooling degree days. For example, in the well-documented CalTRACK approach [39]. In practice though, energy demands, both before and after an intervention, depend on many things besides the outdoor temperature: the dwelling characteristics 3 3 Which may change, for example if occupants open windows more or less often after an intervention than before. , the pre-existing heating system and controls, occupant behaviour, other weather features, such as solar radiation and wind, and diverse exogenous factors such as fuel prices and economic and social pressures. ‘Before and after’ comparisons simply cannot account fully for all these effects. The problem of devising a robust trial methodology is magnified when trials seek to identify relatively small energy savings, perhaps less than 10% for heating controls. This paper presents the results of a multi-year field trial capable of revealing the changes in heating energy demand resulting from the installation of zonal space heating control systems in occupied homes. Some variables were controlled (the house type, heating system type and home ownership) whilst others (the prior heating controls, the weather and diverse exogenous factors) were accounted for by ensuring that the homes with the zonal heating systems were matched with others having no intervention, i.e., a control group. The difference in energy demand between the Matched Group and Zonal Control Group provides a robust measure of the energy savings. To the authors’ knowledge, a quantitative field trial of zonal controls of the scale and rigour presented here has not been attempted before. The trial provides the first robust evidence of the in-use performance of zonal control systems, not only of their energy savings but, in a parallel project, how the controls were used [50]. The findings are relevant in all countries where hydronic space heating is used, whether heating is by a gas boiler, heat pump or other systems. The results are of value to energy policy makers, controls manufacturers, house builders, housing associations and home-owners. The methodology may assist other researchers wishing to collect robust evidence of energy savings in the domestic sector. 2 Trial protocols and methods 2.1 Trial design and research questions The field trial was conducted by a multi-disciplinary group of engineers, ergonomists and social scientists as part of the larger EPSRC-funded, Digital Energy Feedback and Control Technology Optimisation (DEFACTO) project [31]. Initially, 400 homes were recruited and following a year of monitoring, in which the gas and electricity demands, and internal temperatures were measured, selected homes were separated into two groups, one in which zonal controls were fitted and a ‘Matched Group’ in which the space heating controls remained unchanged. The homes were then monitored for a second year. The changes in heating energy demand of the homes in the Matched Group between Year 1 and Year 2 provides the benchmark against which the heating energy demand changes in the Zonal Control Group were compared. Individual homes could use more energy, or less energy, in Year 2 than Year 1 depending on changes to the weather and occupant heating behaviours driven, for example, by exogenous factors. The key research question addressed by this research was therefore: ‘Compared to the Matched Group, does the Zonal Controls Group have a significantly greater decrease or smaller increase in heating energy demand in Year 2 compared to Year 1?’ Theoretically of course, one would expect homes where the heating energy demand decreases to also have lower time-averaged and/or space-averaged internal temperatures. Conversely, if occupants choose to use their new controls to improve thermal comfort, i.e., to increase the internal temperature or heat for longer, heating energy demands might increase. Individual room temperatures thus provide an insight into how and why the changes in heating energy demand are occurring. This enables the following question to be addressed: ‘Are the changes in heating energy demand resulting from the use of zonal controls consistent with the observed changes in average indoor temperature?’. Information about the dwelling and household, obtained through surveys and questionnaires, ensures that there were no other changes to the homes, such as refurbishments or changes to the occupancy between Year 1 and Year 2. This information provides an opportunity to explore a third question: ‘For which homes, occupied by which people might zonal controls be most beneficial?’. 2.2 Analysis method To address the research questions, statistical analyses sought to identify whether the change between Years 1 and 2 in the annual heating energy demand of the two groups was, or was not, significant after accounting for the variations in individual homes’ heating energy demand changes. Throughout, the measured gas demand was used as the indicator of heating energy demand, although it contains components related to domestic hot water heating and, in some homes, gas cooking. The non-normal distribution of the gas demand data required that the non-parametric Mann-Whitney-Wilcoxon test be used for this analysis [45]. To understand, and in some analyses, account for changes in the weather, each home was associated with a local weather station and the analysis repeated after applying degree day corrections to the annual gas demand data. Similar statistical analyses focussed on the gas demands on cold days when space heating would dominate over the gas used for domestic hot water and cooking. For these cold days, analyses also explored whether the changes in whole house, or individual room temperatures, were significantly different between the two groups, again using the Mann-Whitney-Wilcoxon test. Finally, despite having a relatively small sample of homes, an attempt was made to identify whether the changes in internal temperatures and gas demand arising from the installation of zonal controls were significantly influenced by the characteristics of the dwelling and household. 2.3 Project schedule and activities The six-year DEFACTO project ran from 2012 to 2018 (Table 1 ). The main cohort consisted of 393 owner-occupied, broad-band connected 4 4 To enable transmission of the data collected and the operation of the zonal control system. , gas-heated, semi-detached homes located in the Midlands region of England. In the English housing stock as a whole, 64% are owner-occupied and 25% of homes are semi-detached (30% of the owner-occupied homes) [35]. This complex project included a home energy survey, a survey of the existing heating system, two occupant questionnaires, gas and electricity monitoring, room temperature monitoring, and the heating controls intervention. The research tools and methods were developed following a pilot study [31,32,37,38]. The main trial, which was undertaken between November 2014 and November 2018, is described fully in Haines et al. [20], which includes all the survey materials used in the pilot study (Appendix A) and the main trial (Appendix B). The energy demand, energy rating and other characteristics of the homes are explored in Lomas et al. [29]. Here, only the aspects of the project relevant to the evaluation of the heating controls intervention are described in detail. The homes used for the heating controls trial were selected following the first winter of monitoring and were monitored for a year before the homes that would receive the zonal controls were selected. A second full year of monitoring was then undertaken (Table 1). The study received Loughborough University ethical approval for both the pilot study and main study, with updates approved when there were significant changes to the study protocol that affected participants. Risk Assessments were also completed for visits to participants’ properties. Data were collected and stored in accordance with the Data Protection Act (1998) and the Project Data Management Plan. Electronic data were stored on secure servers hosted by Loughborough University, with access only by the project team. 2.4 Data collection During 2015, 186 of the DEFACTO homes were fitted with gas and electricity demand monitoring equipment and temperature sensors. These communicated with a server via an in-home gateway to enable remote data retrieval. Gas demand (in cubic meters to an accuracy of +/−1%) was recorded at 30-minute intervals via a newly installed utility meter with an automated meter reading device connected. Electricity use (cumulatively in kWh to an accuracy of ± 1%) was recorded at two-minute intervals. Indoor air temperatures (degrees Celsius to an accuracy of +/−0.5 °C) were recorded at five-minute intervals. The temperature sensors were placed on furniture or shelving at approximately mid-room height in every room 5 5 Rooms included living room, kitchen, dining room, office/study, conservatory, utility room, hall/landing, main bedroom, other bedrooms, bathroom, toilet and other. Between five and 11 sensors were installed in each home, with a mean of 8.6 sensors. (where possible) and avoiding direct sunlight or other heat sources. Each home was associated with one of seven local weather stations run by the UK Meteorological Office [34]. These provided hourly temperature, solar radiation and wind data and enabled standard weather-corrections to energy demands to be undertaken as necessary (e.g., [29]). The Evohome system delivered data to a Honeywell server. This included set-point temperatures, thermostat temperatures, system modes and interactions with the controller. The homeowners were asked to consent to these data being sent by Honeywell to the researchers to enable detailed analysis of the system. This is work is reported elsewhere [50]. During the winter of 2015/16, a home energy survey was carried out at each property by trained and certified assessors to undertake an Energy Performance Certificate (EPC) assessment using RdSAP v9.92 [15,16] and to collect additional information including: floor plans; the locations of radiators and presence of TRVs; the make and model of the boiler and heating controls (with photographs); and a list of secondary heating devices. This information was checked carefully by the research team 6 6 The data collected in home energy surveys is notoriously unreliable. The project expend considerable effort to obtain a robust set of data [20]. and errors corrected, in some cases by repeat visits to the homes by research team members. Ultimately, a high quality set of dwelling description data was obtained. Two online questionnaires were completed by the householders to provide information about the household and their use of their home and heating system. The first, delivered prior to the Year 1 monitoring starting 19th November 2019, captured data on: household demographics and occupancy; the use and control of the heating system in winter and summer; and the use of secondary heating (single point gas or electric fires). The second, delivered after the Year 2 monitoring from 30th August 2018, had two versions, one for households in the Zonal Control Group and one for those in the Matched Group. The questionnaire sought to capture: any changes to the property or household since the start of the project; the use and control of the heating system in winter and summer, the ease of use of heating controls, and, for the Zonal Control Group only, any use of the Honeywell Evohome app. Throughout the study there were numerous troubleshooting visits to the homes by the researchers and contractors and a protracted campaign of replacing the batteries in the temperature loggers during Year 2. Effort was also expended on cohort retention throughout the project. 2.5 Data cleaning To assure that the DEFACTO dataset was reliable, the gas, electricity and temperature data was inspected and cleaned. The gas data was mainly robust, though sometimes strings of zeroes were recorded. In these cases, the indoor air temperatures and the electricity demand profiles were examined, and, in a few cases, homes were eliminated from further analysis if the zeros could not be attributed to a household being away from home for example 7 7 The volumetric gas demands were converted to an energy demand using a calorific value for 2018 of 39.7MJ/m3 [5]. . Electricity data included some extreme positive and negative spikes which were clearly erroneous and always followed by ‘normal’ values. These were identified and removed from the dataset as they were less than 0.2% of the sample. Temperature data included erroneous values: extreme data points (temperatures below absolute zero and above 80 °C), duplicate records (an anomaly of the data logging process), and isolated spikes (whenever the gradients both before and after a single value had a magnitude greater than 1 °C per minute). These were identified and removed from the dataset and accounted for less than 0.1% of the sample. Additionally, there were periods of missing temperature data for some rooms that could not be recovered. Therefore, checks were made to ensure that the same set of sensors was used in Year 1 and Year 2 and homes rejected if more than 10% of daily data points were missing during the heating season. Some homes withdrew before the end of the monitoring period and were therefore excluded from further analysis. 2.6 The trial homes Initially, 100 homes were selected for the heating controls trial using the following criteria: they all had gas boilers less than ten years old and had radiators rather than underfloor heating; they were providing reliable gas and electricity data 8 8 Data quality was affected by a combination of sensor failure and communications failure leading to incomplete data sets. ; they had undergone the home energy survey; the household had completed the first questionnaire; and none had a pre-existing ‘smart’ thermostat or zonal control system. Towards the end of ‘Year 1’ (Table 1), homes were randomly assigned to either the ‘Zonal Control Group’ or the ‘Matched Group’. The Honeywell Evohome zonal control systems were offered to 50 homes, free of charge, and installed by an approved installer in 49. The system was set up with the occupants through a standardised process 9 9 Occupants were offered temporary electric heating whilst the system was installed. In some homes the existing TRV’s could simply be replaced, in others the system had to be drained down to install the programmable TRVs. . The installer made an initial visit to each home to assess the home and identify the number of TRVs needed, as well as providing an opportunity for householders to ask questions. They were asked to indicate the rooms in which the programmable TRVs should be installed and schedules for these zones so the system could be set up accordingly. At the installation visit, householders were shown the system and given a User Manual to keep. As part of the familiarisation process, householders were advised to ‘play around’ with the controls having been reassured that they could not break anything. Subsequent drop-out of participants and further data quality problems 10 10 Several households had smart meters installed by their utility company. These were incompatible with the automated meter reading device and so gas data collection ended. resulted in 68 homes suitable for further analysis: 37 in the Zonal Control Group and 31 in the Matched Group. Each Group was then monitored for a second year, Year 2 (Table 1). The characteristics of the dwelling, occupants, heating and control systems in each Group of homes is indicated in Table 2 . The average floor area of the homes, 99 m2, is similar to the averages for all English homes (94 m2) and owner occupied homes (108 m2) and the mean energy efficiency rating, as calculated RdSAP v9.92 [15,16], was D, which is the most common rating of English homes. The two Groups were well-matched in terms of: the dwelling characteristics (house sizes, number of heated rooms, energy efficiency and calculated energy demands); the heating system (notably the number that used secondary heating often); and the pre-existing heating controls. There were similar numbers of households on low income in the two groups, but in the Matched Group there were fewer people per dwelling on average, more homes occupied by retired people and more homes occupied all day compared to the Zonal Control Group. Following the second year of monitoring, the participating households were sent a short booklet explaining our findings and providing them with feedback about their energy demand and how it compared to that of others in the study. All equipment was removed and disposed of appropriately except for the zonal control systems which the households wanted to keep. 3 Results 3.1 Calculated savings in gas demand The reduction in gas demands due to installing zonal controls can be calculated in a number of ways. The simplest approach (Section 3.1.1) focusses on the total annual gas demand and requires no weather-corrections to the data. The approach is valid because the Matched and Zonal Control Groups were exposed to the same weather conditions. Small differences in the weather exposure of each individual home can be accounted for by weather-correcting the gas demands, and this provides a second approach to calculating the annual gas demand savings from Zonal Controls (Section 3.1.2). We would not expect the percentage savings produced by the two methods to differ very much. Annual calculations include warm days during which gas is used only, or primarily, for domestic hot water heating and perhaps cooking, and this gas use is not affected by zonal controls. To produce an alternative, perhaps more relevant measure of zonal controls’ effectiveness, analyses were undertaken using data from ‘cold days’ only - when the heating system is likely to be in use 11 11 The data did not permit a clean approach to disaggregating the gas demands for domestic hot water demands from the space heating demands. Cold days also include gas use for DHW, but space heating demands will dominate, especially as the outdoor temperature decreases. (Section 3.1.3). If zonal controls are effective, the calculated savings should be greater than those calculated using the annual analyses. 3.1.1 Annual savings in gas demand: Simple analysis In Year 1 (3/11/15-1/11/16), the mean gas demand in the Zonal Control Group was larger than in the Matched Group, 16 MWh cf. 15 MWh (Table 3 ). However, after normalising by the floor areas of the two groups, the Year 1 demand of the Matched Group was just 3% less than the Zonal Control Group (159 kWh/m2 cf. 160 kWh/m2). The mean gas demand per home increased between Year 1 and Year 2 in both Groups (Table 3), however, the mean increase in the Matched Group (+6.81%) was more than double that in the Zonal Control Group (+3.07%). Considering the change in gas demand from Year 1 to Year 2 for each home individually, the median change for homes in the Matched Group (+8.31%) was more than three times that in the Zonal Control Group (+2.47%). A Mann-Whitney-Wilcoxon test 12 12 The percentage changes in gas demand between the two years were not normally distributed. revealed that this difference in the median percentage change of gas demand between the two Groups was significant at the 5% level (p = 0.04) 13 13 The percentage changes in gas demand and the results of the Mann-Whitney-Wilcoxon test will be the same if analysis is done on a gas demand per unit floor area (kWh/m2) basis. . The mean change in the gas demand of the Matched Group (+6.81%) acts as the benchmark against which to compare the change for the Zonal Control Group. Thus, all things being equal, one would expect the gas demand of the Zonal Control Group in Year 2 to be 17,040 kWh (i.e., 15,963 kWh × 1.0681). The actual mean gas demand of 16,443 kWh therefore represents a 3.50% saving in the mean gas demand. This then, is the gas demand savings we deduce from this simple analysis of the data. 3.1.2 Savings in gas demand: weather-corrected analysis The increase in gas demand between the years is likely to be because Year 2 was colder than Year 1, 2174 heating degree days (HDD) compared to 1985 HDD. Weather correction can be used to ‘normalise’ heating energy demands to a standard year. In the UK, a HDD base temperature of 15.5 °C is used, and for calculating the operational ratings in non-domestic buildings a standard of 2021 °C.days [13]. Coincidentally, this was also the HDD value measured for the UK as a whole in 2016 [6] 14 14 The calculated change in gas demand between Years 1 and 2 is rather insensitive to the exact value for the standard HDD. . After weather correcting, both the Zonal Control Group and the Matched Group show decrease in the mean annual gas demand between Year 1 and Year 2, of −5.97% and −2.46% respectively (Table 3). The Mann-Whitney-Wilcoxon test indicated that the median changes for the two Groups were significantly different at the 10% level (p = 0.05). With the Matched Group as the benchmark, the expected gas demand in the Zonal Control Group in Year 2 would be 15,871 kWh (i.e., 16,295 × 0.974). The actual weather-corrected mean gas demand was 15,322 kWh, a reduction of 572 kWh, or 3.60% compared to the expected demand 15 15 Had the calculation been based on the mean gas demand of the groups and the mean HDD experienced by the group, rather than by weather correcting each home’s gas demand individually before taking the mean, the savings calculated would have been the same. . This is a very similar value to that calculated without weather correction, which is to be expected. 3.1.3 Reduction in gas demand on cold days To focus only on days when the heating system is likely to be in use, and to exclude days when gas is used only for domestic hot water and possibly cooking, the energy saving analysis was repeated using gas data measured on ‘cold days’. These were defined as days when the weather station local to each house recorded a mean daily temperature below 15.5 °C 16 16 The number of cold days therefore differs from one house to the next and days with a mean temperature above 15.5°C are interspersed with those where the temperature is below 15.5°C, especially at the end of the traditional heating season. . The nine weather stations that covered the 68 homes recorded between 276 and 312 (mean 291) cold days in Year 1 and between 281 and 329 (mean 297) in Year 2. Firstly, comparisons of gas demand without weather correction are made based on the mean daily demand on cold days (the number of such days differs between the homes). The mean daily gas demand between Year 1 and Year 2 in the Matched Group increased by 3.96%, in contrast the mean daily gas demand of the Zonal Control Group decreased by 0.48% (Table 4 ). The median changes in the gas demand between the two groups were significantly different at the 5% level (Mann-Whitney-Wilcoxon test, p = 0.03). With the Matched Group as the benchmark, the expected mean daily gas demand in the Zonal Control Group in Year 2 would be 53.26kWh (i.e., 51.23 × 1.0396). The actual mean daily gas demand was 50.98kWh, a reduction of 2.28kWh, or 4.28% compared to the expected demand. As anticipated, this is a little greater than the figures calculated for the annual gas demand savings. The cold day analysis was repeated but the gas demands of each house were individually weather corrected. This inherently accounts for the different number of cold days at each home and so comparisons can be made on the basis of each Group’s mean weather-corrected gas demand. The mean gas demand of the Zonal Control Group decreased by more than the demand of the Matched Group (Table 4). The median changes in the gas demand between the two groups were significantly different at the5%level (Mann-Whitney-Wilcoxon test, p = 0.04). With the Matched Group as the benchmark, the expected mean daily gas demand in the Zonal Control Group in Year 2 would be 15,252 kWh (i.e., 15,515 kWh × 0.983). The actual mean daily gas demand was 14,719 kWh, a reduction of 533 kWh, or 3.5% compared to the expected demand. This is the same as the calculation of savings based on annual demand (Sections 3.1.1 and 3.1.2). Room temperatures were available for 21 of the homes in the Zonal Control Group and 16 in the Matched Group. For these homes, a whole house temperature was calculated for both years by averaging the room temperatures 17 17 Temperatures were available for between 5 and 10 rooms, median 8, in these 37 homes. recorded at every half hour on every cold day. The mean and median values of this (space and time averaged) house temperature (Table 4), suggest that, as expected, reductions in energy demand achieved by zonal controls are associated with reduced indoor temperatures. The matter is investigated in more detail in Section 3.3. 3.2 Gas demand savings in individual homes The year-to-year change in the annual weather-corrected gas demands of the individual homes showed marked differences between the Zonal Control and Matched Groups (Fig. 2 ) 18 18 Remarkably similar variations were revealed in the weather-corrected gas demands on cold days. . In the Matched Group, the median change in gas demand was −1.28% (Table 3) and the number of homes that used less gas was similar to the number that used more: 55% using less gas in Year 2 (up to 18% less) and 45% used more gas (up to 13% more). In the Zonal Control Group, the median change in gas demand was −6.29% (Table 3), with 70% of the homes using less energy (up to 31% less) and 30% more (up to 15% more, excluding the outlier). The median percentage change in the gas demand between the two groups was significant at the 10% level (Mann-Whitney-Wilcoxon test, p = 0.05). The much wider variation in the change of gas demand in the Zonal Control Group might be expected because the new controls would provoke households to pro-actively consider how to heat their home. The greater number of homes using less energy in the Zonal Control Group is notable, as are the high energy savings achieved in some homes; 14 of the 37 homes with Zonal Controls made annual reductions in the weather-corrected gas demand of 10% or more. There was no significant relationship between pre-existing controls in the homes and whether the installation of zonal controls and the pre-existing controls resulted in energy savings (or not). 3.3 Gas demand and whole house temperatures on cold days It has been noted above, that if heating controls are to save energy, then, all other things being equal, one would expect the time and space-averaged whole-house temperature to be lower. The overall results for the cold-day analyses (Section 3.1.3) suggested that this was so, at least for the homes with zonal controls. To investigate further, for the 37 homes for which room temperatures were available, the change in whole house temperature (between Years 1 and 2) was compared to the corresponding change in the weather-corrected gas demand (Fig. 3 ). As expected, homes in which the whole-house temperature increased in Year 2 also used more gas (quadrant Q1). Conversely, homes that had a lower whole-house temperature in Year 2, also used less gas (Q3). However, six homes did not follow this trend (Q2 and Q4). This could be because the calculated whole-house air temperatures was not representative of the true whole-house temperature (every room did not have a temperature sensor) or it could be due to other changes between heating seasons (e.g., differences in internal heat gains or window-opening behaviour). Interestingly, although the regression is not strong, (R2 = 0.5), the gas demand decreased by about 15% per 1 °C decrease in the calculated whole-house temperature, which is comparable to the sensitivity others have quoted 19 19 Others have indicated savings of around 13% for a 1K change in thermostat setting [41] and 10% for a 1K change [48] . 3.4 Changes of temperature in individual rooms To understand how households were using zonal controls, the change of indoor temperature on cold days was examined for: the whole house; the mean temperatures in all bedrooms; the mean living room temperature; and the mean temperature in other rooms’ (Fig. 4 ). It can be seen that, in both groups, some households decreased the median whole-house and room temperatures, but some increased it. In all cases (whole house and all rooms) the inter-quartile range in temperature change was greater for the Zonal Control Group than the Matched Group, which suggests, as noted above, that installation of the zonal control provoked engagement with the heating system and changes to heating practices. For the whole house, the median temperature change in the Zonal Control Group of −0.12 K was significantly different from the median change in in the Matched Group, +0.18 K (Mann-Whitney-Wilcoxon test, p = 0.04). This whole house observation arises primarily due to changes in the temperature of the bedrooms. In 17 of the 21 monitored homes that had zonal controls (81%), the mean temperature in the bedrooms was lower after the controls were fitted; in all other rooms the mean temperature change was close to zero (Fig. 4). The median change in the mean temperature of the bedrooms in the Zonal Control Group was −0.45 K, which was significantly different from the median change in the Matched Group, +0.12 K, at the 5% level (Mann-Whitney-Wilcoxon test, p = 0.01). For the living room and the combined other rooms, the changes of median temperature between the Zonal Control Group and Matched Group were not significantly different. To explore further, the mean temperature in the bedrooms, as measured at each half hour on cold days, was compared for each Group for Year 1 and Year 2 (Fig. 5 ). In Year 1, the homes in the Zonal Control Group had a mean bedroom temperature in the evening, after 17:00, that was about 0.7 K lower than in the Matched Group. In Year 2, the evening temperatures in the Matched Group changed very little, but the evening temperature in the Zonal Control Group decreased by between 0.3 K, at c17:00, and 0.7 K, at 21:00 (Fig. 5). The bedroom temperatures start to decrease earlier in the evening after the controls were fitted than before. This suggests that, for this sample of homes, reducing the temperature of the bedrooms, during the evening heating period, and perhaps heating them for a shorter period, was the preferred energy saving opportunity. 3.5 Statistical analysis of house or household characteristics For the homes in the Zonal Control Group, further analysis was undertaken to determine if dwelling and household characteristics influenced whether or not the homes used less gas in Year 2 than Year 1. 20 20 The analyses were conducted using the annual gas demand, but the results were the same when the weather-corrected annual gas demand was used for the analyses. , 21 21 Homes were considered to use less gas in Year 2 than Year 1 if their percentage change from Year 1 to Year 2 was less than the median percentage change from Year 1 to Year 2 for the Matched Group. A number of characteristics were examined: floor area, SAP-calculated space heating demand per unit floor area; number of occupants and number per unit floor area; occupants’ age band; employment status of the principal home occupant; annual household income band; and the Domestic Operational Rating in Year 1 [29]. Of these, only the annual, SAP-calculated, space heating demand proved to be statistically significant. Even though the differences in the median annual space heating energy demands were small, 1.3 MWh.pa in the homes that saved energy and 1.2 MWh.pa in the homes that did not (Fig. 6 ), this difference was significant at the 5% level (Mann-Whitney-Wilcoxon test, p = 0.04). This suggests that households living in less thermally-efficient dwellings are more likely to reduce their gas demands by using zonal controls. 4 Discussion 4.1 Zonal controls, energy savings and room temperatures To the present authors’ knowledge, this paper provides the first robust, field evidence of the space heating energy savings likely from zonal controls. By retrofitting zonal space heating controls in typical UK homes, the annual gas demand and the average gas demand on cold days was reduced by an average of 3.5% compared with homes that had no intervention. These heating energy savings are much lower than the 8–37% that previous literature has suggested [7,8,12,33,46]. The effects on heating energy demand of installing zonal controls was varied between the homes. Whilst six of the 37 households in the Zonal Control Group reduced their gas demand by over 10% (one household by 31%), the gas demand of six households increased. It seems that the new zonal controls were used by some households to improve thermal comfort whilst in others the controls were employed to save energy. As Sovacool et al. [9] note, “people care about being warm and comfortable at home, ….. and we …. recognize that not everyone wants to minimize cost….”. The data set reported here has been used elsewhere to understand the non-energy benefits of zonal controls [50]. In the homes where the gas demand reduced after the installation of zonal controls, the whole house temperatures on cold days was also lower. This overall difference was primarily because bedrooms were 0.3 K to 0.7 K cooler in the evening and the bedroom heating appeared to be turned off earlier. Perhaps the bedrooms were previously being over-heated or heated when unoccupied. This work therefore supports the separate control of living and sleeping areas as mandated for larger new homes in the UK Building Regulations [22]. Extending this mandate to refurbishment of existing homes could be beneficial. Standalone programmable TRVs could be a cost-effective retrofit solution. Households living in dwellings with a larger estimated space heating energy demand (as calculated by the SAP) reduced gas demand significantly more after installing the zonal controls than households in homes with lower space heating demands. Given that the floor area and the number of occupants were not significantly different, this suggests that energy savings were greater in less thermally efficient dwellings. Although in this work, the differences were small, the result does align with that from modelling studies [7] – and is to be expected. In poorly insulated homes, small changes in room temperature, especially bedroom temperature, will lead to greater reductions in gas demand than in well-insulated homes (where the bedrooms may be warmed by the heat provided to other spaces). Also, in well-insulated homes, the need for water heating begins to dominate the gas demand, and zonal controls do not influence this. It can be readily imagined that large and poorly insulated homes with fewer people living in them may be the ideal market for zonal control technology. However, the ability to improve comfort without large increases in energy demand is also a potentially valuable function of zonal control technology, e.g., in homes where the cost of space heating is a material factor. This could reduce rebound effects after other technological interventions, such as fabric insulation, and thereby improve the energy savings in a whole house retrofit. Smart, wireless, zonal controls are not necessarily the most cost-effective way to reduce space heating energy demand. Based on an upfront cost of £1,000 22 22 All prices are approximate and applicable at the time of writing. (equipment and installation) it would require savings of £100 per year to achieve a simple payback of ten years. The mean savings seen here, c£41 per year on average, would lead to much longer payback times, especially if system maintenance costs and any discounted cash flow are considered). As noted above, stand-alone programmable TRVs, c£20 each, may be a more attractive option in many circumstances. Both types of control have ongoing associated costs for batteries, which are not required for conventional TRVs. Zonal controls are most likely to be installed as retrofit option to replace ineffective, old or malfunctioning controls on hydronic heating systems. Convenience and cost relative to other control options then becomes important. Whether or not a household saves energy will depend, as noted above, both on the systems’ use and the effectiveness and use of the previous controls. Like any connected domestic technology, zonal controls are hostage to the quality of the internet connection and people’s facility with new technology and concerns about data protection and personal privacy. The Honeywell controls collect the data on room temperatures, set-point temperatures, heating schedules and the use made of the controller on a central server. Overall, wireless, digital, zonal space heating controls are unlikely to make a significant contribution to reducing national domestic heat demand, however they do allow some households to make heating energy savings and others to improve thermal comfort. The utility of zonal space heating controls will therefore depend on the household and what they are hoping to achieve. 4.2 Field trial methodology Trials in many branches of science use control groups as an established and essential component of the research methodology. The control group accounts for the ‘known and unknown unknows’ that pervade people-centred studies. In the area of building science control groups are rarely used; even in socio-technical studies, the complexity, duration, and so cost, are major barriers. Instead, field trials often use small samples and/or make adventitious use of natural, or already occurring interventions (such as pre-planned refurbishment). The counterfactual is then modelled, perhaps using weather correction or other approaches in order to estimate the magnitude of change, e.g., in energy demand. The work reported here clearly illustrates the substantial errors associated with not using a control (matched) group, even if weather correction is undertaken. In these trials, for example, the annual weather-corrected gas demands of a group of homes was 16,295kWh, and in Year 2, after the zonal controls had been installed, 15,322kWh (Table 3). The incorrectly-calculated saving is thus 5.97%, which is much greater than the correctly-calculated saving of 3.50%. The errors arise because of year-to-year energy demand changes driven by exogenous factors that cannot be accounted for by weather correction, e.g., changes in fuel prices, wider economic and social pressures, changes in hot water and cooking behaviours, and uncorrected weather affects like solar radiation and wind speed. A Matched Group of homes acts as a barometer to measure these unaccounted-for influences. In this work, the Matched Group indicated that such influences caused a 2.46% change in the annual weather-corrected gas demand between Years 1 and 2 (Table 3). Note that 5.97% − 2.46% = 3.51%, which corresponds to the correctly-calculated savings of 3.5%. 4.3 Wider relevance Although this work, and much of the prior work on zonal controls, has been undertaken in the UK, the results have relevance for policy makers, construction companies, housing providers and researchers in all countries where hydronic heating systems are found. The results are also pertinent when considering future, low and zero-carbon, domestic home heating concepts, be these based on hydrogen boilers, hybrid boilers, heat pumps, integrated community energy systems, etc. In fact, because zonal controls provide households with a convenient method of controlling which rooms are heated at which times and to what temperatures, they enable more nuanced and diverse approaches to offering demand flexibility. In particular, they enable households to respond to time-of-use heating energy tariffs and so avoid high energy prices whilst maintaining acceptable thermal comfort, for example by not heating unoccupied rooms, by temporarily heating to a lower temperature or by moving into a single heated ‘family’ space. Thus, whilst the absolute energy demand reductions from zonal controls might be small, the heating flexibility offered, and the monetary savings possible, could be valued by both energy providers and households. 4.4 Study limitations Although this study was larger and longer than others that have investigated zonal controls, there were a number of limitations: only one year of post-intervention data was analysed (although some homes with zonal controls were monitored for two year); all dwellings were of a similar size and type so it was not possible to pinpoint the dwelling and household characteristics that may lead to greater, or lesser, energy savings; and the homes were all owner occupied, thus the impact of the controls in social housing, for example, was not revealed. By examining the time-varying internal temperatures in the rooms of the homes, it would be possible to identify more clearly when and how homes were heated and the effect that zonal controls had on the temporal and spatial demand for heat. Some effort has been made in this direction [50] but more in-depth analysis of the room temperatures in the DEFACTO dataset would be possible. Studies of controls could also usefully monitor the gas boiler, its time of use and power output. Partial heating has been shown to reduce the overall efficiency of gas boilers [7,8]. But such monitoring is more complex and the DEFACTO dataset doesn’t contain such data. Energy saving trials that rely on people’s behaviours need a large number of participants divided into intervention and control (matched) groups. Even though statistically significant results were obtained, the final cohort of homes consenting to have new controls and providing reliable data was much smaller than intended, despite significant efforts to maintain the cohort. The initial recruitment to field trials needs to account for likely participant drop-out rates if statistical validity is to be preserved. In this work, households were randomly assigned to either the Zonal Control Group or the Matched Group. Some features, notably the number and characteristics of the occupants, differed between the Groups. With more participating households it would be possible to match multiple criteria and so further improved the representativeness of the Matched Group. Multi-year trials are need because participants’ interaction with control systems may change over time, especially through natural evolution in household composition and potential changes in house ownership. The initial interest in new controls may also wane over time leading to a drift in energy demand. Considerable effort is required to track cohorts of households over many years. Because robust multi-year field trials of energy saving technologies require advanced planning, take a long time, and so are expensive, they are rather rare in a relatively poorly resources areas, such as building science. 5 Conclusions To the authors’ knowledge, this work provides the first credible evidence of the in-use energy savings of digital, wireless zonal space heating controls. Although the monitored homes were all gas-fired, semi-detached homes, in the English Midlands, the results have relevance wherever hydronic domestic heating systems are used, and in the future when alternative forms of heat production may proliferate, e.g., boilers, heat pumps or district heating systems. Domestic energy demand arises from the complex interaction of technical, social and economic factors. Simple calculations of energy savings, which did not account for such exogenous factors, overestimated the energy savings from the zonal controls even after the data was weather corrected. A well-conceived ‘control’, i.e., a Matched Group of homes, is essential to achieving reliable estimates of energy savings arising from interventions. The field methodology presented here illustrates the approach. The installation of zonal controls resulted in a significant reduction of the mean and median annual and cold-day gas demands. Relative to the Matched Group, the mean annual and cold-day gas demands of the Zonal Control Group decreased by 3.5%. Approximately two thirds of the homes with zonal controls saved energy and one third used more energy. The mean and median measured savings are much lower than the savings claimed in previous published studies. The wide variation in the energy demand changes before and after zonal control were installed, together with the changes in whole-house temperatures on cold days, suggest that the households pro-actively engaged with the control system. Some households increased the whole-house temperature on cold days, and increased their gas demand, whilst others reduced both the gas demand and the whole-house temperature. The reductions in the gas demand of the homes with zonal controls was primarily achieved by reducing the temperature and duration of heating of bedrooms during the evening. The resulting median change in the whole-house temperature on cold days was significantly greater in the Zonal Control Group than the Matched Group. The temperatures in other rooms also changed, sometimes yielding a higher average temperature and sometimes a lower temperature. Of all the dwelling and household characteristics examined, only the dwelling’s annual heating energy demand as estimated by the UK Standard Assessment Procedure had a significant impact on energy savings. The median energy savings were significantly greater in the less energy efficient (poorly insulated) homes. This result aligns with others’ general observations, although in this work the absolute differences in the savings were small. Wireless, digital zonal controls are expensive and unlikely to provide an acceptable payback through reductions in energy bills. They may, however, provide some households with a more convenient method of controlling their heating system and enable a flexible response to changes in time-of-use energy prices. Declaration of Competing Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgements The data was collected and analysed as part of the Digital Energy Feedback and Control Technology Optimisation (DEFACTO) project. The project was funded through the Digital Economy and Energy Programme ofResearch Councils UK, by the Engineering and Physical Sciences Research Council (EPSRC grant EP/K00249X/1). Additional support was through the Centre for Doctoral Training in Energy Demand (LoLo) (EPSRC grant EP/L01517X/1). The research would not have been possible without the dedicated contribution of many researchers in addition to those authoring this paper, in particular: Dr Becky Mallaband, Dr Andrea Burris, Dr Ehab Foda, Dr Sven Hallin and Dr Dan Wright. The research team were supported by an advisory board with representatives from: the UK Department for Business, Energy and Industrial Strategy (BEIS), Kingfisher plc, the Mark Group Ltd., Secure Meters (UK) Ltd, the Energy Systems Catapult and Honeywell Home, Resideo, who provided guidance on interrogating and installing the zonal control systems. Sub-contractors were also important to the project’s success: Accent, the Evolve Partnership Ltd., SMS (Smart Metering Systems) plc, Seluxit, Mere End Consultants Ltd. and John Unwin Electrical Contractors Ltd. The research team is also grateful to the many, tolerant households that participated in our study. References [1] BEIS, Sub-national Electricity and Gas Consumption Statistics, Department for Business, Energy & Industrial Strategy, 2018, 47pp. Accessed 16 June 2021. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/678653/Sub-national_electricity_and_gas_consumption_summary_report_2016.pdf. [2] BEIS, Consumption Tables, Table 1C [Spreadsheet], Department for Business, Energy & Industrial Strategy, 2019a. Accessed 28 April 2020. Available from: https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/820749/2019_Consumption_tables.xlsx. [3] BEIS, Energy Consumption by Final User (Energy Supplied Basis), 1970 to 2018 (DUKES 1.1.5), [Spreadsheet], 2019b. Accessed 28 April 2020. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/820647/DUKES_1.1.5.xls. [4] BEIS, National Energy Efficiency Data-Framework (NEED): Summary of Analysis, Great Britain, 2020, Department for Business, Energy & Industrial Strategy, 2020a. Accessed 16 June 2021. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/895140/National_Energy_Efficiency_Data_Framework_NEED_report_summary_of_analysis_2020.pdf. [5] BEIS, Estimated Average Calorific Values of Fuels 2019. Digest of UK Energy Statistics (DUKES): Calorific Values, Excel Table A.2 – Estimated Average Gross Calorific Values of Fuels for 1980, 1990 and From 1996 to 2019, Department for Business, Energy & Industrial Strategy, 2020b. Accessed 12 June 2021. Available from: https://www.gov.uk/government/statistics/dukes-calorific-values. [6] BEIS, Digest of UK Energy Statistics: Weather. Data on Annual Trends in Temperatures and Heating Degree Days Produced as Part of DUKES, Department for Business, Energy & Industrial Strategy, 30 July 2020, Mean Heating Degree Days 2002 to 2019 (DUKES 1.1.8), 2020c. Accessed 16 May 2021. Available from: https://www.gov.uk/government/statistics/weather-digest-of-united-kingdom-energy-statistics-dukes. [7] A. Beizaee, Measuring and Modelling the Energy Demand Reduction Potential of Using Zonal Space Heating Control in a UK Home. PhD Thesis, Loughborough University, 2016. Accessed 27 May 2021. Available from: https://repository.lboro.ac.uk/articles/thesis/Measuring_and_modelling_the_energy_demand_reduction_potential_of_using_zonal_space_heating_control_in_a_UK_home/9455939. [8] A. Beizaee D. Allinson K. Lomas E. Foda D. Loveday Measuring the potential of zonal space heating controls to reduce energy use in UK homes: the case of 1930s dwellings Energy Build. 92 2015 29 44 10.1016/j.enbuild.2015.01.040 Beizaee, A., Allinson, D., Lomas, K., Foda, E. and Loveday, D., (2015). Measuring the Potential of Zonal Space Heating Controls to Reduce Energy use in UK homes: the case of 1930s dwellings. Energy and Buildings. 92, pp. 29-44. DOI: https://doi.org/10.1016/j.enbuild.2015.01.040 [9] B.K. Sovacool, J. Osborn, M. Martiskainen, M. Lipson, Testing smarter control and feedback with users: time, temperature and space in household heating preferences and practices in a Living Laboratory. Glob. Environ. Change 65 (2020) 13pp, 102185. ISSN 0959-3780. http://doi.org/10.1016/j.gloenvcha.2020.102185. [10] BSRIA, Growth in European Hydronic Controls Market Set to Sprint, Building Services Research Industry Association, 2018. Accessed 20 July 2021. Available at: https://www.bsria.com/uk/news/article/growth-in-european-hydronic-controls-market-set-to-sprint/. [11] CCC, The Sixth Carbon Budget The UK’s Path to Net Zero. Committee on Climate Change, 2020, 448pp. Accessed 20 July 2021. Available from https://www.theccc.org.uk/wp-content/uploads/2020/12/The-Sixth-Carbon-Budget-The-UKs-path-to-Net-Zero.pdf. [12] J. Cockroft A. Cowie P. Samuel P. Stroachan Potential energy savings achievable by zoned control of individual rooms in UK housing compared to standard central heating controls Energy Build. 136 1 2017 1 11 10.1016/j.enbuild.2016.11.036 Cockroft, J., Cowie, A., Samuel, P. and Stroachan, P. (2017) Potential energy savings achievable by zoned control of individual rooms in UK housing compared to standard central heating controls. Energy and Buildings, 136 (1), pp 1-11. DOI: https://doi.org/10.1016/j.enbuild.2016.11.036 [13] CIBSE, Energy Benchmarks, Technical Memorandum 46, The Chartered Institution of Building Services Engineers, 2008, 26pp. ISBN: 978-1-903287-95-8. [14] D. Connolly H. Lund B. Mathiesen S. Werner B. Möller U. Persson T. Boermans D. Trier P. Østergaar S. Nielsen Heat Roadmap Europe: combining district heating with heat savings to decarbonise the EU energy system Energy Policy 65 2014 475 489 10.1016/j.enpol.2013.10.035 Connolly, D., Lund, H., Mathiesen, B., Werner, S., Möller, B., Persson, U., Boermans, T., Trier, D., Østergaar, P. and Nielsen, S., (2014). Heat Roadmap Europe: Combining district heating with heat savings to decarbonise the EU energy system. Energy Policy. 65, pp. 475-489. DOI: https://doi.org/10.1016/j.enpol.2013.10.035 [15] DECC, How Heating Controls Affect Domestic Energy Demand: A Rapid Evidence Assessment Final Report, Prepared by theRTK ltd for the UK Department of Energy and Climate Change, 2014, 63pp. Accessed 10 September 2021. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/277552/FINALHow_heating_controls_affect_domestic_energy_demand_-_A_Rapid_Evidence_Assessment.pdf. [16] DECC, The Government’s Standard Assessment Procedure for Energy Rating of Dwellings, 2012 edition, SAP 2012, Version 9.92, rev. Feb. and June 2014 to Include RdSAP2012, UK Building Research Establishment on Behalf of the UK Department of Energy and Climate Change, 2014, 234pp. Accessed 16 June 2021. Available from: https://www.bre.co.uk/filelibrary/SAP/2012/SAP-2012_9-92.pdf. [17] Drayton, Wiser, The Smart Heating Control System, 2021. Viewed 27 May 2021. Available from: https://wiser.draytoncontrols.co.uk/. [18] EHI, Heating Market Report 2020, Association of the European heating Industry, 2020, 62pp. Accessed 20 July 2021. Available at: http://www.ehi.eu/fileadmin/user_upload/user_upload/Heating_Market_Report_2020.pdf. [19] F&S, Customer Awareness on Benefits of Smart Thermostats will Drive Growth Beyond Residential Segment, Frost and Sullivan, 2018. Accessed 20 July 2021. Available at: https://www.frost.com/news/press-releases/customer-awareness-on-benefits-of-smart-thermostats-will-drive-growth-beyond-residential-segment/. [20] V. Haines, D. Allinson, J. Beckhelling, B. Mallaband, A. Beizaee, A. Morton, S. Porritt, M. Li, D. Wright, E. Foda, S. Hallin, D. Loveday, K. Lomas, The DEFACTO Field Trial: Methodology and Data Sets, Loughborough University figshare, 2019, Report, 171pp. https://doi.org/10.17028/rd.lboro.7837940. [21] Hive, Hive Smart Heating, 2021. Viewed 27 May 2021. Available from: https://www.hivehome.com/products/categories/heating?icid=HP%3APR7%3Aheating. [22] HMG, The Building Regulations 2010, Part L1A Conservation of Fuel and Power, 2013 edition for Use in England [Online], HM Government, 2014, 48pp. ISBN: 9781859465103. Available from: https://webarchive.nationalarchives.gov.uk/20150601171016/http://www.planningportal.gov.uk/uploads/br/BR_PDF_AD_L1A_2013.pdf. Accessed 27 May 2021. [23] HoC, Energy Efficiency: Building Towards Net Zero, Business, Energy and Industrial Strategy Committee, House of Commons, UK, 2019. Accessed 14 May 21. Available from: https://publications.parliament.uk/pa/cm201719/cmselect/cmbeis/1730/173001.htm. [24] Honeywell, The Evohome Shop, 2021a. Viewed 27 May 2021. Available from: https://theevohomeshop.co.uk/. [25] Honeywell, HR90 Standalone Programmable TRV Head, 2021b. Viewed 27 May 2021. Available from: https://heatingcontrols.honeywellhome.com/products/valves/thermostatic-radiator-valve/Electronic-TRVs/HR90/. [26] Honeywell, Evohome Controller and HR92 Smart Radiator Valve, 2021c. Viewed 18 June 2021. Available from: https://www.techadvisor.com/review/honeywell-evohome-review-3612265/. [27] M.F. Ibrahim, M. Mohamed, B.H. Far, Measuring the effectiveness of zonal heating control for energy saving, in: Proc. 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC), pp. 132–136. https://doi.org/10.1109/SMC.2016.7844231. [28] IPCC, Global Warming of 1.5°C. An IPCC Special Report on the impacts of global warming of 1.5°C above pre-industrial levels and related global greenhouse gas emission pathways, in the context of strengthening the global response to the threat of climate change, sustainable development, and efforts to eradicate poverty, 2018. [V. Masson-Delmotte, P. Zhai, H.-O. Pörtner, D. Roberts, J. Skea, P.R. Shukla, A. Pirani, W. Moufouma-Okia, C. Péan, R. Pidcock, S. Connors, J.B.R. Matthews, Y. Chen, X. Zhou, M.I. Gomis, E. Lonnoy, T. Maycock, M. Tignor, T. Waterfield (Eds.)]. In Press. [29] K. Lomas A. Beizaee D. Allinson V. Haines J. Beckhelling D. Loveday S. Porritt B. Mallaband A. Morton A domestic operational rating for UK homes: concept, formulation and application Energy Build. 201 2019 90 117 10.1016/j.enbuild.2019.07.021 Lomas, K., Beizaee, A., Allinson, D., Haines, V., Beckhelling, J., Loveday, D., Porritt, S., Mallaband, B. and Morton, A., (2019). A domestic operational rating for UK homes: Concept, formulation and application. Energy and Buildings. 201, pp. 90-117. DOI: http://doi.org/10.1016/j.enbuild.2019.07.021 [30] K. Lomas S. Oliveira P. Warren V. Haines T. Chatterton A. Beizaee E. Prestwood B. Gething Do domestic heating controls save energy? A review of the evidence Renew. Sustain. Energy Rev. 93 2018 52 75 10.1016/j.rser.2018.05.002 Lomas, K., Oliveira, S., Warren, P., Haines, V., Chatterton, T., Beizaee, A., Prestwood, E. and Gething, B., (2018). Do domestic heating controls save energy? A review of the evidence. Renewable and Sustainable Energy Reviews. 93, pp. 52–75. DOI: https://doi.org/10.1016/j.rser.2018.05.002 [31] B. Mallaband, V. Haines, A. Morton, E. Foda, A. Beizaee, J. Beckhelling, D. Allinson, D. Loveday, K. Lomas, Saving Energy in the Home Through Digital Feedback and Control Systems: An Introduction to the DEFACTO Project, Third European Conference on Behaviour and Energy Efficiency (BEHAVE Energy Conference), 3rd and 4th September 2014, Saïd Business School, Oxford. [32] B. Mallaband V. Haines A. Morton Do intelligent heating controls out-smart ordinary users? BEHAVE 2016: The 4th European Conference on Behaviour and Energy Efficiency, 8th-9th September 2016 2016 Coimbra Portugal Mallaband, B.,Haines, V.,andMorton, A.,(2016).Do intelligent heating controls out-smart ordinary users?BEHAVE 2016: The 4th European Conference on Behaviour and Energy Efficiency, 8th-9th September 2016, Coimbra, Portugal. [33] E. Marshall J. Steinberger V. Dupont T. Foxon Combining energy efficiency measure approaches and occupancy patterns in building modelling in the UK residential context Energy Build. 111 2016 98 108 10.1016/j.enbuild.2015.11.039 Marshall, E., Steinberger, J., Dupont, V., and Foxon, T., (2016). Combining energy efficiency measure approaches and occupancy patterns in building modelling in the UK residential context. Energy and Buildings. 111, pp. 98–108. DOI: http://doi.org10.1016/j.enbuild.2015.11.039 [34] Met Office, MIDAS: UK Hourly Weather Observation Data, NCAS British Atmospheric Data Centre, 2006. Accessed 25 June 2021. Available from: https://catalogue.ceda.ac.uk/uuid/916ac4bbc46f7685ae9a5e10451bae7c. [35] MHCLG, English Housing Survey 2019 to 2020 Headline Report, 64pp, and Section 1 Household Tables, Section 2 Housing Stock Tables. Ministry for Communities Housing & Local Government, 17 December 2020, 2020a. Accessed 22 June 2021. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/945013/2019-20_EHS_Headline_Report.pdf. [36] MHCLG, English Housing Survey 2018: Energy Report, Report on the Energy Efficiency of the English Housing Stock. Chapter 3: Figures and Annex Tables, Ministry of Housing Communities and Local Government, 2020b, 9 July 2020. Accessed 16 May 2021. Available from: https://www.gov.uk/government/statistics/english-housing-survey-2018-energy-report. [37] A. Morton, Heating Use in UK Homes. PhD Thesis, Loughborough University, 2017. Accessed 27 May 2021. Available from: https://repository.lboro.ac.uk/articles/thesis/Heating_use_in_UK_homes/9359528. [38] A. Morton, V. Haines, D. Allinson, How do householders interact with their heating controls? in: BEHAVE 2016: The 4th European Conference on Behaviour and Energy Efficiency, 8th-9th September 2016, Coimbra Portugal, 2016. [39] P. Ngo, CalTRACK Documentation Release 2.0, 2019, 45pp. Accessed 15 May 2021. Available from: https://docs.caltrack.org/_/downloads/en/latest/pdf/. [40] OJEU, Directive 2010/31/EU of the European Parliament and of the Council of 19May 2010 on the energy performance of buildings. Off. J. Eur. Union (2010). Accessed 20 July 2021. Availlable at: https://eur-lex.europa.eu/eli/dir/2010/31/oj/eng. [41] J. Palmer N. Terry P. Pope How much energy could be saved by making small changes to everyday household behaviours? Cambridge Architectural Research for Department of Energy and Climate Change, November, 31 pp Accessed 20 September 2021. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/128720/6923-how-much-energy-could-be-saved-by-making-small-cha.pdf 2012 Palmer J, Terry N and Pope P (2012) How much energy could be saved by making small changes to everyday household behaviours? Cambridge Architectural Research for Department of Energy and Climate Change, November, 31pp. Accessed 20 September 2021. Available from: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/128720/6923-how-much-energy-could-be-saved-by-making-small-cha.pdf [42] Pegler, Terrier i-temp i30 Programmable Radiator Control, 2021. Viewed 27 May 2021. Available from: https://www.pegleryorkshire.co.uk. [43] B. Roberts D. Allinson K. Lomas A matched pair of test Houses with synthetic occupants to investigate summertime overheating J. Sustain. Des. Appl. Res. (SDAR). 6 1 2018 29 38 10.21427/D70N8S Roberts, B., Allinson, D. and Lomas, K.., (2018). A matched pair of test Houses with synthetic occupants to investigate summertime overheating. Journal of Sustainable Design & Applied Research (SDAR). 6(1), pp. 29-38. DOI: http://doi.org/10.21427/D70N8S [44] M.L. Rodríguez-Pertuz J. Terés-Zubiaga A. Campos-Celador I. González-Pino Feasibility of zonal space heating controls in residential buildings in temperate climates: energy and economic potentials in Spain Energy Build. 218 2020 110006 10.1016/j.enbuild.2020.110006 Rodríguez-Pertuz, M., Terés-Zubiaga, J., Campos-Celador, A. and González-Pino, I., (2020). Feasibility of zonal space heating controls in residential buildings in temperate climates: Energy and economic potentials in Spain. Energy and Buildings, 218. DOI: http://doi.org/h10.1016/j.enbuild.2020.110006 [45] R Tutorial, An R Introduction to Statistics: Mann-Whitney-Wilcoxon Test. n.d. Accessed 21 July 2021. Available at: http://www.r-tutor.com/elementary-statistics/non-parametric-methods/mann-whitney-wilcoxon-test. [46] J. Scott, A. Bernheim Brush, J. Krumm, B. Meyers, M. Hazas, S. Hodges, N. Villar, PreHeat: Controlling home heating using occupancy prediction, in: UbiComp’11 – Proceedings of the 2011 ACM Conference on Ubiquitous Computing, pp. 281–290. http://doi.org/10.1145/2030112.2030151. [47] Tado, Heat and Cool Intelligntly with Tado, 2021. Viewed 27 May 2021. Available from: https://www.tado.com/gb-en/. [48] C. Wickins, Preliminary Data from the RHPP Heat Pump Metering Programme, Department of Energy and Climate Change, London, 2014, 61pp. Viewed 25 June 2021. Available from: https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/276612/Preliminary_Report_on_the_RHPP_metering_programme_2014-01-31.pdf. [49] Worcester Bosch, Bosch, 2021, 12pp. Viewed 27 May 2021. Available from: https://www.worcester-bosch.co.uk/downloads/bosch-easycontrol-brochure.pdf. [50] D. Wright, The Energy-Saving Potential of Domestic Zonal Space Heating Controls: A Socio-Technical Assessment of Semi-Detached and Owner-Occupied UK Homes. PhD thesis, Loughborough University, 2021. Accessed 27 May 2021. Available from: https://repository.lboro.ac.uk/articles/thesis/The_energy-saving_potential_of_domestic_zonal_space_heating_controls_a_socio-technical_assessment_of_semi-detached_and_owner-occupied_UK_homes/14602506.",
    "scopus-id": "85118123505",
    "coredata": {
        "eid": "1-s2.0-S0378778821008562",
        "dc:description": "Domestic zonal heating controls enable hydronic systems to heat rooms to different temperatures at different times. The first credible evidence known to the authors, of the in-use energy savings of such controls, is reported. The results and research methods are globally relevant. The energy demands and room temperatures in 68, gas-heated, owner-occupied, semi-detached homes, in the English Midlands were monitored for a year before zonal controls were fitted in 37 of the homes prior to the second year of monitoring. The other homes retained the existing heating controls and so provided a matched (control) group. Surveys and questionnaires characterised the dwellings, heating systems and households. In two thirds of the homes with zonal controls the annual gas demand decreased, in one third it increased. Overall, the mean gas demand decreased by 3.5% relative to the homes that retained their existing controls. Savings were achieved primarily by reducing bedroom temperatures, especially in the evenings. Wireless, digital zonal controls are unlikely to provide an acceptable payback through reductions in energy bills at today’s prices, but they offer households the flexibility to react to time-of-use energy pricing. A matched (control) group is essential for the reliable calculation of energy demand changes arising from interventions in occupied homes.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2022-01-01",
        "openaccessUserLicense": "http://creativecommons.org/licenses/by/4.0/",
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S0378778821008562",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Lomas, K.J."
            },
            {
                "@_fa": "true",
                "$": "Allinson, D."
            },
            {
                "@_fa": "true",
                "$": "Watson, S."
            },
            {
                "@_fa": "true",
                "$": "Beizaee, A."
            },
            {
                "@_fa": "true",
                "$": "Haines, V.J."
            },
            {
                "@_fa": "true",
                "$": "Li, M."
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S0378778821008562"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S0378778821008562"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": "Full",
        "pii": "S0378-7788(21)00856-2",
        "prism:volume": "254",
        "articleNumber": "111572",
        "prism:publisher": "The Author(s). Published by Elsevier B.V.",
        "dc:title": "Energy savings from domestic zonal heating controls: Robust evidence from a controlled field trial",
        "prism:copyright": "© 2021 The Author(s). Published by Elsevier B.V.",
        "openaccess": "1",
        "prism:issn": "03787788",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Zonal heating controls"
            },
            {
                "@_fa": "true",
                "$": "Occupied homes"
            },
            {
                "@_fa": "true",
                "$": "Field measurement"
            },
            {
                "@_fa": "true",
                "$": "Control group"
            },
            {
                "@_fa": "true",
                "$": "Energy savings"
            },
            {
                "@_fa": "true",
                "$": "Room temperatures"
            }
        ],
        "openaccessArticle": "true",
        "prism:publicationName": "Energy and Buildings",
        "openaccessSponsorType": "FundingBody",
        "prism:pageRange": "111572",
        "pubType": "fla",
        "prism:coverDisplayDate": "1 January 2022",
        "prism:doi": "10.1016/j.enbuild.2021.111572",
        "prism:startingPage": "111572",
        "dc:identifier": "doi:10.1016/j.enbuild.2021.111572",
        "openaccessSponsorName": "Engineering and Physical Sciences Research Council"
    },
    "objects": {"object": [
        {
            "@category": "standard",
            "@height": "201",
            "@width": "378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr1.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "15898",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "310",
            "@width": "378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr2.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "13833",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "323",
            "@width": "378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr3.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "22098",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "325",
            "@width": "378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr4.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "20812",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "292",
            "@width": "378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr5.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "22925",
            "@ref": "gr5",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "277",
            "@width": "378",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr6.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "14964",
            "@ref": "gr6",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "117",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr1.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "10281",
            "@ref": "gr1",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "163",
            "@width": "199",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr2.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "2907",
            "@ref": "gr2",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "192",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr3.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "5632",
            "@ref": "gr3",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "190",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr4.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "4941",
            "@ref": "gr4",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "212",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr5.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "5820",
            "@ref": "gr5",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "160",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr6.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "4267",
            "@ref": "gr6",
            "@mimetype": "image/gif"
        },
        {
            "@category": "high",
            "@height": "891",
            "@width": "1673",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr1_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "97308",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1374",
            "@width": "1673",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr2_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "85545",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1429",
            "@width": "1673",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr3_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "156241",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1440",
            "@width": "1673",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr4_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "128210",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1293",
            "@width": "1673",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr5_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "168263",
            "@ref": "gr5",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1225",
            "@width": "1673",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-gr6_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "85170",
            "@ref": "gr6",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821008562-am.pdf?httpAccept=%2A%2F%2A",
            "@multimediatype": "Acrobat PDF file",
            "@type": "AAM-PDF",
            "@size": "422209",
            "@ref": "am",
            "@mimetype": "application/pdf"
        }
    ]},
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/85118123505"
    }
}}