{"full-text-retrieval-response": {
    "scopus-eid": "2-s2.0-85140059028",
    "originalText": "serial JL 271090 291210 291702 291711 291731 291877 291878 31 Energy ENERGY 2022-10-15 2022-10-15 2022-10-20 2022-10-20 2023-01-26T02:56:46 1-s2.0-S036054422202463X S0360-5442(22)02463-X S036054422202463X 10.1016/j.energy.2022.125577 S300 S300.1 FULL-TEXT 1-s2.0-S0360544222X00285 2024-01-25T15:30:23.862776Z 0 0 20230115 2023 2022-10-15T01:24:22.897445Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast highlightsabst nomenclature orcid primabst ref 0360-5442 03605442 true 263 263 PB Volume 263, Part B 12 125577 125577 125577 20230115 15 January 2023 2023-01-15 2023 Full Length Articles article fla © 2022 Elsevier Ltd. All rights reserved. SENSORCOSTEFFECTIVENESSANALYSISFORDATADRIVENFAULTDETECTIONDIAGNOSTICSINCOMMERCIALBUILDINGS ZHANG L Nomenclature 1 Introduction 2 Methodology of sensor cost analysis for fdd 2.1 Concept of sensor threshold marginal cost (STMC) 2.2 Sensor cost analysis workflow based on sensor threshold marginal cost (STMC) 2.2.1 Module 1. Settings 2.2.2 Module 2. Sensor opportunity calculation 3 Case study 3.1 Virtual testbed 3.2 Building faults simulation 3.3 Data for data-driven FDD modeling 3.4 Cost analysis settings 4 Results and discussion 4.1 Single sensor results 4.2 Sensor group results 4.3 Discussion 5 Conclusion Credit author statement Acknowledgments References SHAIKH 2014 409 429 P AREVIEWOPTIMIZEDCONTROLSYSTEMSFORBUILDINGENERGYCOMFORTMANAGEMENTSMARTSUSTAINABLEBUILDINGS LIN 2020 106505 G ZHANG 2020 107338 L ASYSTEMATICFEATUREEXTRACTIONSELECTIONFRAMEWORKFORDATADRIVENWHOLEBUILDINGAUTOMATEDFAULTDETECTIONDIAGNOSTICSINCOMMERCIALBUILDINGS ZHANG 2021 116452 L AREVIEWMACHINELEARNINGINBUILDINGLOADPREDICTION KATIPAMULA 2005 3 25 S ZHANG 2021 L BUILDINGSIMULATION EVALUATEIMPACTSENSORACCURACYMODELPERFORMANCEINDATADRIVENBUILDINGFAULTDETECTIONDIAGNOSTICSUSINGMONTECARLOSIMULATION ZHANG 2021 100055 L SENSORIMPACTEVALUATIONVERIFICATIONFORFAULTDETECTIONDIAGNOSTICSINBUILDINGENERGYSYSTEMSAREVIEW GUO 2018 732 745 Y DEEPLEARNINGBASEDFAULTDIAGNOSISVARIABLEREFRIGERANTFLOWAIRCONDITIONINGSYSTEMFORBUILDINGENERGYSAVING WIJAYASEKARA 2014 1829 1840 D MININGBUILDINGENERGYMANAGEMENTSYSTEMDATAUSINGFUZZYANOMALYDETECTIONLINGUISTICDESCRIPTIONS ALSALEEM 2014 F HVACSYSTEMCLOUDBASEDDIAGNOSTICSMODEL WANG 2012 203 211 H LI 2014 49 58 S LI 2017 257 270 G SHI 2016 Z BUILDINGZONEFAULTDETECTIONKALMNANFILTERBASEDMETHODS NAJAFI 2010 M MODELINGMEASUREMENTCONSTRAINTSINFAULTDIAGNOSTICSFORHVACSYSTEMS ZHAO 2017 1272 1286 Y DIBOWSKI 2016 H 2016IEEE21STINTERNATIONALCONFERENCEEMERGINGTECHNOLOGIESFACTORYAUTOMATIONETFA AUTOMATICSETUPFAULTDETECTIONALGORITHMSINBUILDINGHOMEAUTOMATION DONG 2014 197 211 B CHEN 2005 Y MILCOM20052005IEEEMILITARYCOMMUNICATIONSCONFERENCE SENSORPLACEMENTFORMAXIMIZINGLIFETIMEPERUNITCOSTINWIRELESSSENSORNETWORKS GAO 2003 Y PROCEEDINGS2NDACMINTERNATIONALCONFERENCEWIRELESSSENSORNETWORKSAPPLICATIONS ANALYSISREDUNDANCYWIRELESSSENSORNETWORKS JANG 2009 378 386 W CAPELLARI 2018 2174 G DESTE 2012 2874 2898 C GOLDMAN 2005 387 405 C FRANK 2019 S METRICSMETHODSASSESSBUILDINGFAULTDETECTIONDIAGNOSISTOOLS KIM 2021 624 640 J DEPARTMENTOFENERGY 2013 U ENERGYPLUSENERGYSIMULATIONSOFTWARE GOLDWASSER 2018 D ADVANCESINCALIBRATIONBUILDINGENERGYMODELSTIMESERIESDATA IM 2016 P MULTIYEARPLANFORVALIDATIONENERGYPLUSMULTIZONEHVACSYSTEMMODELINGUSINGORNLSFLEXIBLERESEARCHPLATFORM IM 2016 P TNMULTIYEARPLANFORVALIDATIONENERGYPLUSMULTIZONEHVACSYSTEMMODELINGUSINGORNLSFLEXIBLERESEARCHPLATFORM KIM 2019 233 J KIM 2019 233 J KIM 2019 239 J FRANK 2016 S HYBRIDMODELBASEDDATADRIVENFAULTDETECTIONDIAGNOSTICSFORCOMMERCIALBUILDINGS LI 2016 540 551 D PEDREGOSA 2011 2825 2830 F LAN 2011 1057 1062 L KIM 2021 624 640 J ZHANGX2023X125577 ZHANGX2023X125577XL CHU_DOE publishAcceptedManuscriptIndexable http://www.elsevier.com/open-access/userlicense/1.0/ 2023-10-20T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2022 Elsevier Ltd. All rights reserved. 2022-10-25T03:51:21.332Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/aggregated-refined National Renewable Energy Laboratory NREL National Renewable Energy Laboratory http://data.elsevier.com/vocabulary/SciValFunders/100006233 http://sws.geonames.org/6252001/ U.S. Government U.S. Department of Energy USDOE U.S. Department of Energy http://data.elsevier.com/vocabulary/SciValFunders/100000015 http://sws.geonames.org/6252001/ U.S. Department of Energy Office of Energy Efficiency and Renewable Energy Building Technologies Office DE-AC36-08GO28308 EERE Office of Energy Efficiency and Renewable Energy http://data.elsevier.com/vocabulary/SciValFunders/100006134 http://sws.geonames.org/6252001 This work was authored in part by the National Renewable Energy Laboratory, operated by Alliance for Sustainable Energy, LLC, for the U.S. Department of Energy (DOE) under Contract No. DE-AC36-08GO28308. Funding provided by the U.S. Department of Energy Office of Energy Efficiency and Renewable Energy Building Technologies Office. The views expressed herein do not necessarily represent the views of the DOE or the U.S. Government. The U.S. Government retains and the publisher, by accepting the article for publication, acknowledges that the U.S. Government retains a nonexclusive, paid-up, irrevocable, worldwide license to publish or reproduce the published form of this work, or allow others to do so, for U.S. Government purposes. 0 https://doi.org/10.15223/policy-017 https://doi.org/10.15223/policy-037 https://doi.org/10.15223/policy-012 https://doi.org/10.15223/policy-029 https://doi.org/10.15223/policy-004 item S0360-5442(22)02463-X S036054422202463X 1-s2.0-S036054422202463X 10.1016/j.energy.2022.125577 271090 2023-01-26T03:15:56.357191Z 2023-01-15 1-s2.0-S036054422202463X-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/MAIN/application/pdf/ad1bdcddbc105f9c5c1ca7564f0e6ed4/main.pdf main.pdf pdf true 4951332 MAIN 9 1-s2.0-S036054422202463X-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/PREVIEW/image/png/5ea16b0d1a207c59b2c29a531d3f22dd/main_1.png main_1.png png 55314 849 656 IMAGE-WEB-PDF 1 1-s2.0-S036054422202463X-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr5/DOWNSAMPLED/image/jpeg/81e505ae41826f9a6cf482873cf85a9a/gr5.jpg gr5 gr5.jpg jpg 147465 300 811 IMAGE-DOWNSAMPLED 1-s2.0-S036054422202463X-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr3/DOWNSAMPLED/image/jpeg/ea490061f7d878d0643d37fbd09c604c/gr3.jpg gr3 gr3.jpg jpg 184894 785 535 IMAGE-DOWNSAMPLED 1-s2.0-S036054422202463X-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr4/DOWNSAMPLED/image/jpeg/6c99080a22ae23db290801d3465f131e/gr4.jpg gr4 gr4.jpg jpg 107062 186 535 IMAGE-DOWNSAMPLED 1-s2.0-S036054422202463X-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr1/DOWNSAMPLED/image/jpeg/675427057968ff27d4886b3f8fa5a545/gr1.jpg gr1 gr1.jpg jpg 128049 148 691 IMAGE-DOWNSAMPLED 1-s2.0-S036054422202463X-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr2/DOWNSAMPLED/image/jpeg/429821cb3100abadba88c2213f670c1c/gr2.jpg gr2 gr2.jpg jpg 151115 271 691 IMAGE-DOWNSAMPLED 1-s2.0-S036054422202463X-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr5/THUMBNAIL/image/gif/84bc5832b04abf99d6a4693afcea7e3a/gr5.sml gr5 gr5.sml sml 74689 81 219 IMAGE-THUMBNAIL 1-s2.0-S036054422202463X-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr3/THUMBNAIL/image/gif/d8732a6444cd537e3b59065db8955ce2/gr3.sml gr3 gr3.sml sml 75502 163 111 IMAGE-THUMBNAIL 1-s2.0-S036054422202463X-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr4/THUMBNAIL/image/gif/2b6653fda8e840115c6f617feaf8be9f/gr4.sml gr4 gr4.sml sml 79536 76 219 IMAGE-THUMBNAIL 1-s2.0-S036054422202463X-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr1/THUMBNAIL/image/gif/70f802f3cb9db864917850bb612eaaeb/gr1.sml gr1 gr1.sml sml 71924 47 219 IMAGE-THUMBNAIL 1-s2.0-S036054422202463X-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/gr2/THUMBNAIL/image/gif/869b34491c4ad5c762893123876c440c/gr2.sml gr2 gr2.sml sml 73881 86 219 IMAGE-THUMBNAIL 1-s2.0-S036054422202463X-gr5_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/HIGHRES/image/jpeg/3423c37b1f9fbd76f59b188f73e87f94/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 723414 1328 3591 IMAGE-HIGH-RES 1-s2.0-S036054422202463X-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/HIGHRES/image/jpeg/728143e87c495c2a302a5c7029759298/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 882719 3480 2371 IMAGE-HIGH-RES 1-s2.0-S036054422202463X-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/HIGHRES/image/jpeg/de987334fbf856de94d381e6b57197b1/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 368534 823 2371 IMAGE-HIGH-RES 1-s2.0-S036054422202463X-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/HIGHRES/image/jpeg/6a3ce27f14d4d27f13da9712b6a4d136/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 577699 657 3060 IMAGE-HIGH-RES 1-s2.0-S036054422202463X-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S036054422202463X/HIGHRES/image/jpeg/b4bd5a0ead84320e97bc96445a3a7af3/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 728684 1201 3060 IMAGE-HIGH-RES 1-s2.0-S036054422202463X-am.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10FD9ZK8P8B/MAIN/application/pdf/7f40c4cb364131efa4ac2e1b2391c33e/am.pdf am am.pdf pdf false 1243753 AAM-PDF EGY 125577 125577 S0360-5442(22)02463-X 10.1016/j.energy.2022.125577 Elsevier Ltd Fig. 1 Diagram of the concept of STMC. Fig. 1 Fig. 2 Diagram of sensor cost analysis workflow based on sensor threshold marginal cost (STMC). Fig. 2 Fig. 3 Reported range of fault prevalence for faults, by equipment type, along with number of studies quantifying each fault (Source: Kim et al. [26]). Fig. 3 Fig. 4 EnergyPlus virtual testbed (right), calibrated to the FRP at ORNL (left) [29]. Fig. 4 Fig. 5 Floorplan and HVAC system layout of FRP [30]. Fig. 5 Table 1 Single sensor cost analysis results: Top 20 sensors with highest opportunity in FDD. Table 1 No. Additional Single Sensor Energy Improvement ($) Comfort Improvement ($) Maintenance Improvement ($) STMC ($) 1 Cooling electricity [W] 21.6 57.4 26.4 105.4 2 Gas facility [W] 14.0 50.6 17.6 82.1 3 Heating gas [W] 14.0 50.6 17.6 82.1 4 Room 201 zone air relative humidity [%] 15.5 43.8 22.3 81.6 5 Rooftop heating coil heating coil heating energy [W] 13.0 49.0 15.7 77.7 6 Room 202 reheat coil heating coil heating energy [W] 18.9 38.5 23.2 80.6 7 Room 203 zone air relative humidity [%] 22.3 28.0 30.8 81.0 8 2f plenum zone air relative humidity [%] 19.4 11.9 26.8 58.1 9 Room 204 zone air relative humidity [%] 18.7 12.3 26.0 57.0 10 Room 102 zone air relative humidity [%] 4.2 30.0 3.2 37.4 11 Room 105 reheat coil heating energy [W] 7.0 24.1 7.7 38.8 12 Room 205 zone air relative humidity [%] 7.4 17.7 12.7 37.8 13 Room 105 zone air relative humidity [%] 12.8 9.5 19.5 41.7 14 Room 102 reheat coil heating energy [W] 7.7 19.1 9.6 36.4 15 2f plenum zone mean air temperature [C] 3.1 24.1 3.6 30.8 16 Room 106 zone air relative humidity [%] 12.8 8.7 18.3 39.7 17 Room 202 zone air relative humidity [%] 17.2 6.5 18.3 42.0 18 Fans electricity [W] 5.5 23.0 1.3 29.7 19 Rooftop supply fan electric energy [W] 5.5 23.0 1.3 29.7 20 Rooftop supply fan volume flow rate [m3/s] 9.8 10.2 13.4 33.3 Table 2 Sensor group cost analysis results: Sensor groups with 3, 5, 10, and 20 additional sensors. Table 2 Number of Additional Sensors Energy Improvement ($) Comfort Improvement ($) Maintenance Improvement ($) STMC ($) 3 58.5 104.2 90.3 252.9 5 64.7 99.8 104.7 269.1 10 63.6 127.9 100.5 291.9 20 80.9 113.4 126.3 320.6 ☆ Liang Zhang is an assistant professor at the University of Arizona, Tucson, Arizona, and a contingent worker at the National Renewable Energy Laboratory, Golden, Colorado. Matt Leach is a research scientist at National Renewable Energy Laboratory, Golden, Colorado. Jianli Chen is an assistant professor at the University of Utah, Salt Lake City, Utah. Yuqing Hu is an assistant professor at the Pennsylvania State University, State College, Pennsylvania. Sensor cost-effectiveness analysis for data-driven fault detection and diagnostics in commercial buildings Liang Zhang a b ∗ Matt Leach b Jianli Chen c Yuqing Hu d a The University of Arizona, Tucson, AZ, USA The University of Arizona Tucson AZ USA The University of Arizona, Tucson, Arizona, U.S b National Renewable Energy Laboratory, Golden, CO, USA National Renewable Energy Laboratory Golden CO USA National Renewable Energy Laboratory, Golden, Colorado, U.S c The University of Utah, Salt Lake City, UT, USA The University of Utah Salt Lake City UT USA The University of Utah, Salt Lake City, Utah, U.S d The Pennsylvania State University, State College, PA, USA The Pennsylvania State University State College PA USA The Pennsylvania State University, State College, Pennsylvania, U.S ∗ Corresponding author. National Renewable Energy Laboratory, Golden, CO, USA. National Renewable Energy Laboratory Golden CO USA Data-driven building fault detection and diagnostics (FDD) is heavily dependent on sensors. However, common sensors from Building Automation Systems are not optimized to maximize accuracy in FDD. Installing additional sensors that provide more detailed building system information is key to maximizing the performance of FDD solutions. In this paper, we present a sensor cost analysis workflow to quantify the economic implications of installing new sensors for FDD using the concept of sensor threshold marginal cost (STMC). STMC does not represent actual sensor cost. Rather, it represents a target cost based on the economic benefit that would be realized through improved FDD performance and one or more specified economic criteria. We calculate STMCs for multiple possible fault types and use fault prevalence information to aggregate STMCs into a single dollar value to determine the cost-effectiveness of a potential sensor investment. We conducted a case study using Oak Ridge National Laboratory's Flexible Research Platform (FRP) test facility as a reference. The case study demonstrates the feasibility of the analysis and highlights the key cost considerations in sensor selection for FDD. The results also indicate that identifying and installing the few key sensor(s) is critical to cost-effectively improve FDD performance. Keywords Building sensors Cost analysis Cost effectiveness Threshold marginal cost Building fault detection and diagnostics Fault prevalence Data availability Data will be made available on request. Nomenclature AHU air handing unit BAS building automation system FDD fault detection and diagnostics VAV variable air volume WSN wireless sensor network FRP flexible research platform 1 Introduction Buildings account for more than one-third of the total primary energy supply [1]. Faulted building energy and control systems wasted 5%–30% of the energy consumed by buildings [2]. Building fault detection and diagnostics (FDD) is a technique to detect operational errors and faults (fault detection) and finds the fundamental causes (fault diagnostics) in buildings [3]. Massive datasets being collected from building sensors and meters empowers data-driven modeling [4], and data-driven building FDD modeling has also been increasingly applied. In the taxonomy proposed by Katipamula and Brambley [5], black-box FDD models, or purely data-driven FDD models, make up a subset of process history-based FDD models; they will hereafter be referred to as “data-driven building FDD” in this paper. Data-driven building FDD is heavily dependent on sensors, as sensor measurement is the primary source of inputs to train and apply data-driven FDD models [6]. Much FDD solutions and research are based on existing sensors in building automation system (BAS) [7]. Guo et al. [8] studied deep learning-based fault diagnosis of variable refrigerant flow air-conditioning systems solely using data collected from manufacturer-installed sensors (no additional sensors were used). Wijayasekara et al. [9] proposed a novel fuzzy anomaly detection and linguistic description-based method to detect anomalies in BAS behavior using existing BAS sensors. Many other studies also use existing BAS sensors for their building FDD research [10–14]. However, common BAS sensor sets are designed to enable basic BAS control sequences and are not optimized to maximize accuracy in FDD. Najafi [15] observed that sensor network architectures are not necessarily designed solely for diagnostic purposes, and Zhao et al. [16] pointed out the inadequacy of built-in and existing sensors for FDD in air handling units (AHUs). Many studies address the need to use additional sensors (beyond typical BAS sensors) to improve FDD performance. Dibowski et al. [17] highlighted the necessity of adding more sensors for fault detection algorithms in building and home automation. Dong et al. [18] recommended which built-in sensors should be used for FDD applications in chiller-AHU-VAV systems. O'Neill et al. also studied additional sensors (including electrical power sub-metering, fluid flow meters, and temperature sensors) for fault detection in chiller-AHU-VAV systems. These studies demonstrate that various researchers have analyzed and quantified FDD performance with different sensor sets of varying accuracy, but few have considered sensor cost effectiveness. In the absence of budget constraints, FDD performance will be optimized when the FDD algorithm is given access to a perfect theoretical sensor set that can provide any and all details of building system operation. However, such a sensor set would be cost prohibitive and therefore impractical. Sensor cost, including both initial cost and operation/maintenance cost, will be the determining factor in whether it is economical to add additional sensors to improve FDD performance. Installing additional cost-effective sensors that collect more detailed building system information is key to maximizing the cost benefit of FDD solutions. We reviewed papers relevant to sensor cost effectiveness for building FDD. However, most of those papers study costs for sensor networks in a generic sense (without the context of a specific application). In this type of research, lifetime per unit cost, defined as the network lifetime divided by the number of sensors deployed in the network, is often used to measure the utilization efficiency of sensors in a wireless sensor network (WSN). Analyzing the lifetime per unit cost of a linear WSN, Chen et al. [19] found that deploying either an extremely large or an extremely small number of sensors results in low lifetime per unit costs. They sought to identify sensor configurations that would maximize lifetime per unit cost. The result shows that the optimal number of deployed sensors increases with the event arrival rate and decreases with the sensing power consumption. Gao et al. [20] aimed to analyze redundancy in wireless sensor networks. Specifically, they presented an observation concerning the minimum and maximum number of sensor neighbors that are required to provide complete redundancy and introduced simple methods to estimate the degree of redundancy without knowledge of sensor location. The topic of sensor cost analysis has been widely studied in sensor-intensive and high-cost sensor applications. For example, construction material tracking is a sensor-intensive field, and the cost of the required mechanical sensors is very high. As a result, sensor cost effectiveness is a recurring theme for studies in this field. Jang and Skibniewski [21] conducted cost-benefit analysis of embedded sensor systems for construction material tracking. They performed a cost-benefit analysis to compare the labor hour savings associated with the material and information handling among manual and RFID (radio-frequency identification)-based methods. Up to 35% labor cost savings occurred in RFID-based tracking method. Capellari et al. [22] presented a method to perform the cost–benefit optimization of a structural health monitoring sensor network by defining the density, type, and positioning of the sensors to be deployed. Specifically, they studied cost-benefit optimization of the sensor networks via a framework comprising surrogate models (polynomial chaos expansion), model order reduction methods (principal component analysis), and stochastic optimization methods. The application of the framework to a large-scale structural problem, the Pirelli tower in Milan, is presented to demonstrate the effectiveness of the framework. Similar scenarios have been studied in other sensor-intensive fields. For example, Este et al. [23] conducted relocatable, automated cost-benefit analysis for marine sensor network design. Costs in maintenance, negotiation, equipment, exposure and communication are estimated using hydrodynamic models and Electronic Navigation Charts. Benefits in maximum coverage and reducing overall error are also determined using model output. This method demonstrates equivalent accuracy at predicting the whole system to expert-chosen locations, whilst significantly reducing the estimated costs. In summary, we found that sensor cost analysis and cost effectiveness have only been well studied either in a generic sense or for specific sensor-intensive and high-cost sensor applications such as building construction material tracking. Sensor cost benefit analysis for building FDD is not represented in the existing literature. The most direct way to consider sensor cost would be to conduct a comprehensive market survey on the prices of various relevant sensors and combine this information with data-driven FDD modeling and analysis. However, such an approach would be labor-intensive, and would ignore that fact that sensor costs can vary widely from project to project, from manufacturer to manufacturer, and from region to region. So, rather than focusing on developing a database of sensor costs with limited applicability, we chose instead to benchmark sensor cost by structuring our analysis around the concept of sensor threshold marginal cost (STMC). STMC does not represent actual sensor cost. Rather, it represents a target cost based on the economic benefit that would be realized through improved FDD performance and one or more specified economic criteria. In our specific definition, we quantify (in dollars) the difference in FDD performance (energy/thermal comfort) with and without a sensor (or package of sensors) installed and then calculate an upper limit for sensor cost such that the specified economic criterion (e.g., 3-year simple payback) is minimally satisfied. The reference case is defined by the level of FDD performance that can be achieved with a sensor package associated with a typical BAS implementation. A user could then compare the resulting STMCs to their project-specific sensor costs to determine if it is economically-viable to add sensors to improve FDD. Since the sensor cost benefit analysis for building FDD is hardly found in the literature, the novelty of this paper lies in the fact that it fills in this research gap, and for the first time develops sensor cost analysis methodology specifically for building FDD. The paper is organized as follows. In Section 2, we introduce the concept of STMC for sensor cost benefit analysis in FDD and detail a generic workflow to quantify sensor cost effectiveness when adding new sensors to achieve better energy efficiency/thermal comfort performance. A case study using the Flexible Research Platform (FRP) at Oak Ridge National Laboratory (ORNL) as a reference is detailed in Section 3. Results and discussion of the case study are presented in Section 4. Conclusions are drawn, and future work is mapped out in Section 5. 2 Methodology of sensor cost analysis for fdd As mentioned in Section 1, STMC represents the opportunity cost of one sensor or a group of sensors. In Section 2.1, the concept of STMC is first defined and detailed in the context of data-driven FDD in buildings. Then in Section 2.2, the sensor cost analysis workflow based on the concept of STMC is introduced. 2.1 Concept of sensor threshold marginal cost (STMC) STMC represents the opportunity cost of a sensor or a group of sensors. In this section, we first define STMC in the context of data-driven FDD in buildings. Then, we introduce our sensor cost analysis workflow based on STMC. The typical way to decide whether to purchase and install a sensor is to compare “cost” and “revenue.” The revenue (R) is defined by the sum of all possible benefits from installing the sensor for FDD purposes (with single fault type) in dollars per year; the cost is defined by the initial cost (Ci) of purchasing and installing the sensor in dollars plus the cost to power and maintain the sensor (Cpm) in dollars per year. We can calculate the simple payback period (PP) using Equation (1). (1) PP = Ci /(R - Cpm) Then we compare PP with the target payback period (TPP, normally 3 years or 5 years [24]). If PP is less than TPP, it is a sound investment; otherwise, it is not. Fig. 1 (a) summarizes the decision process. STMC allows us to avoid the need for explicit cost data collection by inverting this calculation. In this scenario, we assume Ci to be unknown and define a target payback period (TPP). We can then calculate the sensor “target” cost, or STMC, using Equation (2). The corresponding decision process is summarized in Fig. 1 (b). (2) STMC = TPP/(R - Cpm) Equation (3) breaks revenue (R) down into three components. (3) R = (P * Ediff + C1 * TCdiff) * MDdiff + C2 * FAdiff i. Energy Cost Reduction, which is defined in terms of: a. Energy price (P), in $/kWh b. Energy consumption difference (Ediff), in kWh/year. This is the annual energy penalty associated with a given fault, assuming that fault is present throughout the entire year. c. Misdetection rate difference (MDdiff) [25]. This is the fractional improvement in detection rate for a given fault associated with the addition of the candidate sensor set. ii. Thermal Comfort Improvement, which is defined in terms of: a. Conversion coefficient C1, which represents the economic value per unit of thermal comfort. The unit of C1 depends on the choice of thermal comfort index. If PDD is used as thermal comfort index, the unit of C1 is $/%; if unmet comfort hour is used, the unit of C1 is $/hour. b. Thermal comfort difference (TCdiff), in units of thermal comfort per year. This is the annual thermal comfort penalty associated with a given fault. Thermal comfort can be measured in any relevant thermal comfort metric, such as PMV, PPD or comfortable hours. c. Misdetection rate difference (MDdiff). iii. Maintenance cost reduction, which is defined in terms of: a. Conversion coefficient C2, which represents the economic value of maintenance visits. We assume that maintenance visits would be reduced as false alarms are reduced. The unit of C2 depends on the definition of maintenance cost. If maintenance cost is evaluated by the number of maintenance visits, the unit of C2 is $/maintenance visit. b. False alarm rate difference (FAdiff). This is the fractional reduction in false alarms for a given fault associated with the addition of the candidate sensor set. Equation (4) defines sensor power and maintenance cost (Cpm), which consists of two terms. The annual sensor power cost (Cp) of the candidate sensor set includes power supply cost and any other continuous cost. The annual sensor maintenance cost (Cm) associated with the candidate sensor set. (4) Cpm = Cp + Cm Merging Equations (2)–(4), we get Equation (5), the detailed equation for STMC for fault type i. (5) STMCi = TPP/[(P * Ediff + C1 * TCdiff) * MDdiff + C2 * FAdiff - Cp - Cm] The aggregated STMC (defined by Equation (6)) for a given sensor or sensor set is the sum of STMC for all possible fault types. Fi is the fault prevalence, which is defined as the “percentage of units with a given fault at a given severity at a single point in time” in Ref. [26]. When applied to a single building, fault prevalence can be interpreted as the fraction of time throughout a year during which building operation would be impacted by that fault. (6) STMC = Σ (Fi * STMCi) In summary, STMC represents the threshold, benchmark, or opportunity cost of installing a sensor or a group of sensors for FDD purposes. It accounts for all relevant economic impacts (including maintenance cost and the value of thermal comfort) associated with sensor installation and uses fault prevalence data to probabilistically predict the cost impact of each fault. 2.2 Sensor cost analysis workflow based on sensor threshold marginal cost (STMC) Fig. 2 shows the diagram of the developed STMC-based workflow for sensor cost analysis, which consists of two modules. The first module defines the settings of the sensor cost analysis, including the baseline sensor set, candidate sensor set, FDD algorithm selection, the objective function that quantifies the economic benefits and costs of installed sensors, and fault prevalence information. The second module is the sensor opportunity quantification module that calculates STMC; this module is the core of the sensor cost analysis. Within this module, users can choose to evaluate single sensors or groups of sensors. Sections 2.2.1 and 2.2.2 will introduce the modules in detail. 2.2.1 Module 1. Settings The first module consists of five components: (1) baseline sensor set, (2) candidate sensor set, (3) FDD algorithm, (4) objective function, and (5) fault settings. Baseline Sensor Set. This is the existing or assumed (for new construction) sensor set in the building of interest. We consider this to be the zero-cost sensor set that the FDD algorithm would have access to without any additional investment. FDD performance with the baseline sensor set serves as the reference point for sensor cost benefit analysis; the economic benefit of a candidate sensor set is quantified in terms of the incremental improvement in performance (and increase in cost) it provides compared to the baseline sensor set. For an existing building, the baseline sensor set would be whatever sensors are currently installed. For a new building, the baseline sensor set would be either a user-defined sensor set (based on a proposed design) or a standard set of sensors commonly installed for BAS applications. Candidate Sensor Set. This is the candidate sensor(s) to be added to the baseline sensor set. The candidate sensor set consists of non-baseline sensors that could provide additional information on building system operation. It does not overlap with the baseline sensor set. The candidate sensor set could include enthalpy sensors, occupancy sensors, air/water flow meters, end use submeters, weather sensors, etc. FDD Algorithm. Sensor selection is strongly correlated with the choice of machine learning algorithm for data-driven FDD modeling. Users can specify a specific machine learning algorithm or allow the framework to execute sensor cost analysis for a set of potential algorithms. Objective Function. The objective function quantifies the economic benefit (balance of revenue and cost) associated with adding additional sensors. The objective function we used for our analysis is defined as per Equations (5) and (6). As previously described, users are tasked with providing a number of inputs (electricity price, the value of productivity, the cost of a maintenance visit, etc.) to tailor the objective function to their specific scenarios. Fault Settings. The user has the option to select a subset of possible faults for analysis. Once the set of faults to be analyzed is selected, relevant fault prevalence data are applied to project annual impact for a building. Fault prevalence is defined as the “percentage of units with a given fault at a given severity and at a single point in time” in Ref. [26]. When applied to a single building, fault prevalence can be interpreted as the fraction of time throughout a year during which building operation would be impacted by that fault. Fig. 3 shows a snapshot of fault prevalence data, indicating how frequent various faults are occurring throughout the U.S. The fault prevalence data in the figure will used to specify Fi in Equation (6). 2.2.2 Module 2. Sensor opportunity calculation After specifying settings in Module 1, the sensor opportunity cost, STMC, will be calculated in Module 2. The calculation module has two modes: (1) calculating STMC for a single sensor, and (2) calculating STMC for a group of sensors. The analysis mode is selected by the user, and the user has the option to run both modes in parallel if desired. STMC for a Single Sensor. This mode evaluates each sensor in a candidate sensor set individually by adding only that sensor to the baseline sensor set and evaluating the objective function. Interactions between candidate sensors are not captured. The STMC for each candidate sensor is calculated and reported. STMC of Sensor Group. This mode evaluates the candidate sensor set as a package. Accordingly, it does account for interactions between candidate sensors. Users can choose to evaluate the entire candidate sensor set or use optimization to identify which subgroups of sensors maximize economic benefit. Subgroups can be created for different numbers of sensors (5, 10, 15, etc.). The STMC for each group of sensors is calculated and reported. 3 Case study The Flexible Research Platform (FRP) testbed is introduced in Section 3.1. The details of building fault simulation are covered in Section 3.2. Sensors and data for data-driven FDD modeling are discussed in Section 3.3. The cost analysis settings are introduced in Section 3.4. 3.1 Virtual testbed In this section, we introduce 1) the FRP case study testbed, 2) the details of building fault simulation, 3) the sensors and data relevant to data-driven FDD modeling, and 4) the cost analysis settings. The virtual testbed is an EnergyPlus [27] model that is calibrated to the FRP test facility, which is located at ORNL [28,29]. Fig. 4 shows an exterior view of the facility and a rendering of the virtual testbed. Fig. 5 shows the building floorplan (left) and HVAC system layout (right). Details on the building construction and characteristics of the testbed can be found in Table 1 of Im et al.’s paper [29]. The weather data for simulation is USA_TN_Knoxville.723260_TMY3.epw. Both fault-free and faulted building models were generated. 3.2 Building faults simulation Five faults with the highest impact on building energy efficiency and thermal comfort were modeled and simulated via the EnergyPlus model, because energy efficiency and thermal comfort improvement are driving factors for FDD applications. The fault types we simulated are: 1) thermostat bias, 2) economizer opening stuck, 3) lighting setback error: no overnight setback, 4) excessive infiltration, and 5) liquid line restriction. It is worth mentioning that we choose the fault types based on their energy and thermal comfort impact based on the simulation results in this case study, because it is very computationally expensive to include all 25 available fault types whose modeling details are introduced in Ref. [31]. In the real application of this methodology, users can either including all available faults simulation data, or prioritizing important faults like what we do in the case study. The building faults were modeled via OpenStudio fault measures (https://github.com/NREL/OpenStudio-fault-models) and independently applied to the fault-free EnergyPlus model. The resulting five faulted building models (along with the fault-free baseline model) were simulated under the typical meteorological year (TMY) weather file for Knoxville, Tennessee (where the FRP is located) to generate the data used for data-driven FDD modeling. More details about fault definitions, faulty model development, and the corresponding EnergyPlus models are introduced in Kim et al.’s paper [32,33]. 3.3 Data for data-driven FDD modeling The data-driven FDD model is trained with the virtual sensor data generated from the simulation of the fault-free reference model and the faulted building models. The data resolution of all simulations is 60 min. A total of 184 virtual sensors were considered in this study; the full list of sensors is not listed in this paper but can be found at https://github.com/NREL/OpenStudio-fault-models. The values from those sensors were the sole data source of data-driven FDD modeling for this study. 3.4 Cost analysis settings Baseline Sensor Set and Target Sensor Set. We categorize the sensors in the FRP model into four groups: basic, moderate, rich, and unlikely. We define the baseline sensor set as those sensors included in the basic and moderate groups. Those sensors are common BAS sensors including outdoor environment temperature sensors, room temperature sensors, room supply air temperature sensors, room reheat damper outlet air temperatures, and energy meters. The sensors in the rich and unlikely groups are used to build candidate sensor sets. Those sensors are not common in typical BAS applications and include room humidity sensors, RTU supply fan flow sensors, VAV box reheat sensors, enduse submeters, room heating coil heating energy sensors, outdoor environment solar radiation sensor, flow meters, and system node temperatures. There are 139 sensors in the baseline sensor set and 45 sensors in the target sensor set. A condensed sensor list with category information can be found in Table 3 in Kim et al.’s paper [32]. Note that 139 sensors are likely many more than what we would expect to be installed in a building the size of the FRP. While we would not be surprised to see any of these 139 sensors installed in a building of this type, it is unlikely that all of them would be installed. As such, we are likely overestimating the amount of data available to the data-driven FDD algorithm. In turn, we are likely overestimating FDD performance for the reference case, resulting in conservative assessment of value associated with adding additional sensors. FDD Algorithm. Users can specify a specific machine learning algorithm or allow the framework to execute sensor cost analysis for a set of potential algorithms. For this study, we used random forest as the data-driven algorithm for FDD modeling because we did a test among five machine learning algorithms and random forest performs the best in an unreported analysis. Random forest has been widely applied to data-driven FDD research [34,35]. For this study, the random forest algorithm is realized by scikit-learn (version 0.21.2), a Python package for machine learning [36]. Most of the parameters are set to the default values in scikit-learn, except the estimator number, which is set to 100 based on an unreported test which indicates that the accuracy stops increasing when the number of trees exceeds 100. Objective Function. We set electricity price (P) to $0.11/kWh, the average electricity price in Tennessee (where FRP is located). We set C1 to $10 per unmet comfort hour per person (based on a total labor cost of $100/hour per person and an assumed 10% reduction in productivity during uncomfortable conditions. The 10% reduction in productivity is based on a statement from the paper [37]: a work performance increase of as much as 10% or more can be expected from improvements of the indoor environment). Based on a reference value of 5 people per 92.9 m2 for an office building and about 278.7 m2 of floor area for the FRP, this results in a value of $100/person * 10% * 15 persons = $150 per unmet comfort hour. We set C2 based on assumptions of $300 per maintenance check and that false alarm rate maps to a fractional value of weekly maintenance checks (C2 = $300 * 8760/(24 * 7) = $15,643 per fractional change in false alarm rate). For simplicity, we assume Cp and Cm are effectively zero (this seems reasonable in the near-term payback window). Target payback period is set to 5 years. Fault Settings. Fault section and fault prevalence: 1) thermostat bias: 0.19, 2) economizer opening stuck: 0.16, 3) lighting setback error: no overnight setback: 0.05, 4) excessive infiltration: 0.15, and 5) liquid line restriction: 0.03 [38]. Sensor Cost Analysis. Both single sensor and sensor group analysis are conducted in the case study. 4 Results and discussion In this section, we introduce the results of cost analysis based on the methodology introduced in Section 2 and case study settings introduced in Section 3. Single sensor results and sensor group results are introduced in Section 4.1 and 4.2, respectively. The discussion based on the results is introduced in Section 4.3. 4.1 Single sensor results Table 1 shows the cost analysis results when evaluating single sensors considering 5 fault types highlighted in Section 3.2. Take the additional sensor “Cooling electricity [W]” as an example. The “revenues” generated over the payback period (5 years) by installing this sensor are $21.6, $57.4, and $26.4, respectively, for energy consumption reduction, thermal comfort improvement, and reduction in fault-related maintenance visits. The sum of these three “revenues” is $105.4, which represents the STMC for this sensor. Thus, installing the cooling electricity meter will be a sound investment if it can be done for less than $105.4. It can be observed from Table 1 that the 3 sensors with the highest opportunity costs are energy submeters; beyond that, zone reheat coil energy meters and relative humidity sensors also feature prominently. Comparing across columns, the “revenues” from comfort improvement and reduced maintenance visits are typically greater than that from energy efficiency improvement. This indicates that it may not be appropriate to evaluate cost effectiveness of sensor investment based solely on corresponding reductions in energy costs. Of course, the relative value of the revenue streams is highly dependent on the input assumptions (in particular, P, C1 and C2 as defined in Equations (5) and (6)), which will vary from project to project. 4.2 Sensor group results Table 2 shows the cost analysis results when evaluating sensor groups (where each group of sensors represents the combination of sensors with the largest STMC for a given group size). As more sensors are added, the cost benefit associated with improved FDD performance increases. Note, however, that there are diminishing returns (or marginal diminishing effect), such that it becomes less and less likely that a package of sensors would be cost effective as the number of sensors it contains increases. In Table 2, although sensor groups with 5, 10, and 20 sensors have greater STMC, the STMC per sensor is highest when only adding three sensors. This observation indicates that it is important to limit investment to the few most critical sensors to detect and diagnose the relevant faults, instead of further including many other less impactful or indirectly impactful sensors. 4.3 Discussion It is not surprising that single sensors have less impact on FDD performance than groups of sensors. Fault symptoms are complex, and sensors need to work collaboratively to detect faults. The flip side to this is that improved performance associated with sensor groups is likely to be outweighed in many cases by the cost of those additional sensors. Investment in additional sensors will be a balance between improved performance and increased cost, and there should exist an optimal set of sensors for a given FDD application. Energy cost savings associated with additional sensors are generally quite small for this case study, and not nearly sufficient to justify investment beyond the baseline sensor package. However, depending on how improved thermal comfort and avoided maintenance costs are valued (represented by how C1 and C2 are defined), non-energy cost benefits can significantly outweigh energy cost benefits. Additionally, cost benefits have the potential to scale significantly based on system and building size, depending on the scale at which a sensor is applied. For example, zone-level sensors (such as zone temperature sensors) would not typically scale significantly with building size, unless zone size correlates with building size. However, system size is likely to increase significantly with building size. A sensor installed in a system serving 300 m2 of floor area would be much less likely to be cost effective than the same sensor installed in a system serving 3000 m2 of floor area. And in some cases, the same building-level sensor (such as a weather sensor) could serve 3000 m2 or 300 m2 of floor area. Note also that the improvements in misdetection and false alarm rate associated with additional sensors are marginal for this case study. This is largely because baseline misdetection and false alarm rates are quite good for the baseline sensor set. As previously discussed, it is worth re-evaluating the baseline sensor set to make sure it is not more robust than what is typical. 5 Conclusion In this paper, we presented a sensor cost analysis workflow to quantify the economic benefit and inform the decision-making process of selecting additional sensors to improve FDD performance. We applied that workflow to the FRP as a case study to demonstrate the feasibility of the analysis and highlight the key “revenues” and “costs” in sensor selection for FDD. The concept of sensor threshold marginal cost (STMC) is used to evaluate the cost effectiveness of different combinations of sensors and building faults. The results indicate that non-energy costs can exceed energy costs, depending on how improved comfort and reduced maintenance are valued. Due to strong FDD performance with the baseline sensor set, the marginal cost improvements in energy efficiency associated with additional sensors seems unlikely to justify additional sensor investment for small buildings. And while performance improves as the candidate sensor set grows, diminishing returns are likely to make larger sensor sets even less cost effective. Navigating the cost-benefit tradeoff carefully will be critical to making wise investments in additional sensors to improve FDD performance. It is important to note, however, that, as building size increases, economies of scale could change the underlying economics. Key limitations and considerations for the future include: STMC is relatively low in small commercial buildings like the FRP, but is expected to be larger in larger buildings, where the cost benefit associated with system-/building-level sensors can improve significantly. Besides, we only use one case study to demonstrate the feasibility of the methodology in this paper. To better demonstrate the generalization of the methodology, we will further study the application of this methodology in other buildings with various size and characteristics. In this work, we only considered FDD applications; in the future, we will extend the analysis to account for control performance improvement as well. This creates potential for value stacking, which could make investment in additional sensors more economically viable. Additional research is needed to determine reasonable values for the coefficients (C1 and C2) that determine the relative weight of thermal comfort and avoidable maintenance checks. Field data are needed to represent typical sensor installations more accurately for BAS applications. By reducing the size of the reference sensor set, we would expect STMC values to increase for adding the next best sensor. This could tip the scales in favor of additional investment. Credit author statement Liang Zhang: Conceptualization; Data curation; Formal analysis; Investigation; Methodology; Software; Validation; Visualization; Roles/Writing - original draft; Writing - review & editing. Matt Leach: Conceptualization; Methodology; Project administration; Writing - review & editing. Jianli Chen: Writing - review & editing. Yuqing Hu: Writing - review & editing. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgments This work was authored in part by the National Renewable Energy Laboratory, operated by Alliance for Sustainable Energy, LLC, for the U.S. Department of Energy (DOE) under Contract No. DE-AC36-08GO28308. Funding provided by the U.S. Department of Energy Office of Energy Efficiency and Renewable Energy Building Technologies Office. The views expressed herein do not necessarily represent the views of the DOE or the U.S. Government. The U.S. Government retains and the publisher, by accepting the article for publication, acknowledges that the U.S. Government retains a nonexclusive, paid-up, irrevocable, worldwide license to publish or reproduce the published form of this work, or allow others to do so, for U.S. Government purposes. References [1] P.H. Shaikh A review on optimized control systems for building energy and comfort management of smart sustainable buildings vol. 34 2014 409 429 Shaikh, P.H., et al., A review on optimized control systems for building energy and comfort management of smart sustainable buildings. 2014. 34: p. 409-429. [2] G. Lin Building fault detection and diagnostics Achieved savings, and methods to evaluate algorithm performance 168 2020 106505 Lin, G., et al., Building fault detection and diagnostics: Achieved savings, and methods to evaluate algorithm performance. 2020. 168: p. 106505. [3] L. Zhang A systematic feature extraction and selection framework for data-driven whole-building automated fault detection and diagnostics in commercial buildings vol. 186 2020 107338 Zhang, L., et al., A systematic feature extraction and selection framework for data-driven whole-building automated fault detection and diagnostics in commercial buildings. 2020. 186: p. 107338. [4] L. Zhang A review of machine learning in building load prediction vol. 285 2021 116452 Zhang, L., et al., A review of machine learning in building load prediction. 2021. 285: p. 116452. [5] S. Katipamula M.R.J.H. Brambley R. Research Methods for fault detection, diagnostics, and prognostics for building systems—a review, part I 11 1 2005 3 25 Katipamula, S., M.R.J.H. Brambley, and R. Research, Methods for fault detection, diagnostics, and prognostics for building systems-a review, part I. 2005. 11(1): p. 3-25. [6] L. Zhang M. Leach Evaluate the impact of sensor accuracy on model performance in data-driven building fault detection and diagnostics using Monte Carlo simulation Building simulation 2021 Springer Zhang, L. and M. Leach. Evaluate the impact of sensor accuracy on model performance in data-driven building fault detection and diagnostics using Monte Carlo simulation. in Building Simulation. 2021. Springer. [7] L. Zhang Sensor impact evaluation and verification for fault detection and diagnostics in building energy systems: a review 2021 100055 Zhang, L., et al., Sensor impact evaluation and verification for fault detection and diagnostics in building energy systems: A review. 2021: p. 100055. [8] Y. Guo Deep learning-based fault diagnosis of variable refrigerant flow air-conditioning system for building energy saving vol. 225 2018 732 745 Guo, Y., et al., Deep learning-based fault diagnosis of variable refrigerant flow air-conditioning system for building energy saving. 2018. 225: p. 732-745. [9] D. Wijayasekara Mining building energy management system data using fuzzy anomaly detection and linguistic descriptions vol. 10 2014 1829 1840 Wijayasekara, D., et al., Mining building energy management system data using fuzzy anomaly detection and linguistic descriptions. 2014. 10(3): p. 1829-1840. [10] F.M. Alsaleem HVAC system cloud based diagnostics model 2014 Alsaleem, F.M., et al., HVAC system cloud based diagnostics model. 2014. [11] H. Wang An online fault diagnosis tool of VAV terminals for building management and control systems Autom ConStruct 22 2012 203 211 Wang, H., et al., An online fault diagnosis tool of VAV terminals for building management and control systems. Automation in Construction, 2012. 22: p. 203-211. [12] S. Li J. Wen Application of pattern matching method for detecting faults in air handling unit system Autom ConStruct 43 2014 49 58 Li, S. and J. Wen, Application of pattern matching method for detecting faults in air handling unit system. Automation in Construction, 2014. 43: p. 49-58. [13] G. Li Identification and isolation of outdoor fouling faults using only built-in sensors in variable refrigerant flow system: a data mining approach Energy Build 146 2017 257 270 Li, G., et al., Identification and isolation of outdoor fouling faults using only built-in sensors in variable refrigerant flow system: A data mining approach. Energy and Buildings, 2017. 146: p. 257-270. [14] Z. Shi W. O'Brien B. Gunay Building zone fault detection with Kalmnan filter based methods 2016 eSim Shi, Z., W. O’Brien, and B. Gunay, Building zone fault detection with Kalmnan filter based methods. eSim, 2016. [15] M. Najafi Modeling and measurement constraints in fault diagnostics for HVAC systems 2010 Najafi, M., Modeling and measurement constraints in fault diagnostics for HVAC systems. 2010. [16] Y. Zhao Diagnostic Bayesian networks for diagnosing air handling units faults–part I: faults in dampers, fans, filters and sensors Appl Therm Eng 111 2017 1272 1286 Zhao, Y., et al., Diagnostic Bayesian networks for diagnosing air handling units faults-part I: Faults in dampers, fans, filters and sensors. Applied Thermal Engineering, 2017. 111: p. 1272-1286. [17] H. Dibowski Automatic setup of fault detection algorithms in building and home automation 2016 IEEE 21st international conference on emerging Technologies and factory automation (ETFA) 2016 IEEE Dibowski, H., et al. Automatic setup of fault detection algorithms in building and home automation. in 2016 IEEE 21st International Conference on Emerging Technologies and Factory Automation (ETFA). 2016. IEEE. [18] B. Dong Z. O'Neill Z. Li A BIM-enabled information infrastructure for building energy Fault Detection and Diagnostics Autom ConStruct 44 2014 197 211 Dong, B., Z. O'Neill, and Z. Li, A BIM-enabled information infrastructure for building energy Fault Detection and Diagnostics. Automation in Construction, 2014. 44: p. 197-211. [19] Y. Chen C.-N. Chuah Q. Zhao Sensor placement for maximizing lifetime per unit cost in wireless sensor networks MILCOM 2005-2005 IEEE military communications conference 2005 IEEE Chen, Y., C.-N. Chuah, and Q. Zhao. Sensor placement for maximizing lifetime per unit cost in wireless sensor networks. in MILCOM 2005-2005 IEEE Military Communications Conference. 2005. IEEE. [20] Y. Gao K. Wu F. Li Analysis on the redundancy of wireless sensor networks Proceedings of the 2nd ACM international conference on Wireless sensor networks and applications 2003 Gao, Y., K. Wu, and F. Li. Analysis on the redundancy of wireless sensor networks. in Proceedings of the 2nd ACM international conference on Wireless sensor networks and applications. 2003. [21] W.-S. Jang M.J. Skibniewski Cost-benefit analysis of embedded sensor system for construction materials tracking J Construct Eng Manag 135 5 2009 378 386 Jang, W.-S. and M.J. Skibniewski, Cost-benefit analysis of embedded sensor system for construction materials tracking. Journal of Construction Engineering and Management, 2009. 135(5): p. 378-386. [22] G. Capellari E. Chatzi S. Mariani Cost–benefit optimization of structural health monitoring sensor networks Sensors 18 7 2018 2174 Capellari, G., E. Chatzi, and S. Mariani, Cost-benefit optimization of structural health monitoring sensor networks. Sensors, 2018. 18(7): p. 2174. [23] C. D'Este Relocatable, automated cost-benefit analysis for marine sensor network design Sensors 12 3 2012 2874 2898 D’Este, C., et al., Relocatable, automated cost-benefit analysis for marine sensor network design. Sensors, 2012. 12(3): p. 2874-2898. [24] C.A. Goldman N.C. Hopper J.G. Osborn Review of US ESCO industry market trends: an empirical analysis of project data Energy Pol 33 3 2005 387 405 Goldman, C.A., N.C. Hopper, and J.G. Osborn, Review of US ESCO industry market trends: an empirical analysis of project data. Energy Policy, 2005. 33(3): p. 387-405. [25] S.M. Frank Metrics and methods to assess building fault detection and diagnosis tools 2019 National Renewable Energy Lab.(NREL) Golden, CO (United States) Frank, S.M., et al., Metrics and methods to assess building fault detection and diagnosis tools. 2019, National Renewable Energy Lab.(NREL), Golden, CO (United States). [26] J. Kim Research challenges and directions in HVAC fault prevalence 27 5 2021 624 640 Kim, J., et al., Research challenges and directions in HVAC fault prevalence. 2021. 27(5): p. 624-640. [27] U.S. Department_of_Energy EnergyPlus energy simulation software 2013 Available from: https://energyplus.net/ Version 8.1 Department_of_Energy, U.S. EnergyPlus Energy Simulation Software, Version 8.1. . 2013; Available from: https://energyplus.net/. [28] D. Goldwasser Advances in calibration of building energy models to time series data 2018 National Renewable Energy Lab.(NREL) Golden, CO (United States) Goldwasser, D., et al., Advances in Calibration of Building Energy Models to Time Series Data. 2018, National Renewable Energy Lab.(NREL), Golden, CO (United States). [29] P. Im Multiyear plan for validation of EnergyPlus multi-zone HVAC system modeling using ORNL's flexible research platform 2016 Im, P., et al., Multiyear Plan for Validation of EnergyPlus Multi-Zone HVAC System Modeling using ORNL’s Flexible Research Platform. 2016. [30] P. Im M. Bhandari J.J.O.R. New TN, multi-year plan for validation of EnergyPlus multi-zone HVAC system modeling using ORNL's flexible research platform 2016 Im, P., M. Bhandari, and J.J.O.R. New, TN, Multi-Year Plan for Validation of EnergyPlus Multi-Zone HVAC System modeling using ORNL’s Flexible Research Platform. 2016. [31] J. Kim Representing small commercial building faults in energyplus, Part I: Model development 9 11 2019 233 Kim, J., et al., Representing small commercial building faults in energyplus, Part I: Model development. 2019. 9(11): p. 233. [32] J. Kim Representing small commercial building faults in energyplus, Part I: model development Buildings 9 11 2019 233 Kim, J., et al., Representing small commercial building faults in energyplus, Part I: Model development. Buildings, 2019. 9(11): p. 233. [33] J. Kim Representing small commercial building faults in EnergyPlus, Part II: model validation Buildings 9 12 2019 239 Kim, J., et al., Representing Small Commercial Building Faults in EnergyPlus, Part II: Model Validation. Buildings, 2019. 9(12): p. 239. [34] S. Frank Hybrid model-based and data-driven fault detection and diagnostics for commercial buildings 2016 National Renewable Energy Lab.(NREL) Golden, CO (United States) Frank, S., et al., Hybrid model-based and data-driven fault detection and diagnostics for commercial buildings. 2016, National Renewable Energy Lab.(NREL), Golden, CO (United States). [35] D. Li Fault detection and diagnosis for building cooling system with a tree-structured learning method Energy Build 127 2016 540 551 Li, D., et al., Fault detection and diagnosis for building cooling system with a tree-structured learning method. Energy and Buildings, 2016. 127: p. 540-551. [36] F. Pedregosa Scikit-learn: machine learning in Python J Mach Learn Res 12 2011 2825 2830 Oct Pedregosa, F., et al., Scikit-learn: Machine learning in Python. Journal of machine learning research, 2011. 12(Oct): p. 2825-2830. [37] L. Lan P. Wargocki Z. Lian Quantitative measurement of productivity loss due to thermal discomfort Energy Build 43 5 2011 1057 1062 Lan, L., P. Wargocki, and Z. Lian, Quantitative measurement of productivity loss due to thermal discomfort. Energy and Buildings, 2011. 43(5): p. 1057-1062. [38] J. Kim Research challenges and directions in HVAC fault prevalence Sci Technol Bulit Environ 27 5 2021 624 640 Kim, J., et al., Research challenges and directions in HVAC fault prevalence. Science and Technology for the Built Environment, 2021. 27(5): p. 624-640.",
    "scopus-id": "85140059028",
    "coredata": {
        "eid": "1-s2.0-S036054422202463X",
        "dc:description": "Data-driven building fault detection and diagnostics (FDD) is heavily dependent on sensors. However, common sensors from Building Automation Systems are not optimized to maximize accuracy in FDD. Installing additional sensors that provide more detailed building system information is key to maximizing the performance of FDD solutions. In this paper, we present a sensor cost analysis workflow to quantify the economic implications of installing new sensors for FDD using the concept of sensor threshold marginal cost (STMC). STMC does not represent actual sensor cost. Rather, it represents a target cost based on the economic benefit that would be realized through improved FDD performance and one or more specified economic criteria. We calculate STMCs for multiple possible fault types and use fault prevalence information to aggregate STMCs into a single dollar value to determine the cost-effectiveness of a potential sensor investment. We conducted a case study using Oak Ridge National Laboratory's Flexible Research Platform (FRP) test facility as a reference. The case study demonstrates the feasibility of the analysis and highlights the key cost considerations in sensor selection for FDD. The results also indicate that identifying and installing the few key sensor(s) is critical to cost-effectively improve FDD performance.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2023-01-15",
        "openaccessUserLicense": null,
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S036054422202463X",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Zhang, Liang"
            },
            {
                "@_fa": "true",
                "$": "Leach, Matt"
            },
            {
                "@_fa": "true",
                "$": "Chen, Jianli"
            },
            {
                "@_fa": "true",
                "$": "Hu, Yuqing"
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S036054422202463X"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S036054422202463X"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": null,
        "pii": "S0360-5442(22)02463-X",
        "prism:volume": "263",
        "articleNumber": "125577",
        "prism:publisher": "Elsevier Ltd.",
        "dc:title": "Sensor cost-effectiveness analysis for data-driven fault detection and diagnostics in commercial buildings",
        "prism:copyright": "© 2022 Elsevier Ltd. All rights reserved.",
        "openaccess": "0",
        "prism:issn": "03605442",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Building sensors"
            },
            {
                "@_fa": "true",
                "$": "Cost analysis"
            },
            {
                "@_fa": "true",
                "$": "Cost effectiveness"
            },
            {
                "@_fa": "true",
                "$": "Threshold marginal cost"
            },
            {
                "@_fa": "true",
                "$": "Building fault detection and diagnostics"
            },
            {
                "@_fa": "true",
                "$": "Fault prevalence"
            }
        ],
        "openaccessArticle": "false",
        "prism:publicationName": "Energy",
        "openaccessSponsorType": null,
        "prism:pageRange": "125577",
        "pubType": "fla",
        "prism:coverDisplayDate": "15 January 2023",
        "prism:doi": "10.1016/j.energy.2022.125577",
        "prism:startingPage": "125577",
        "dc:identifier": "doi:10.1016/j.energy.2022.125577",
        "openaccessSponsorName": null
    },
    "objects": {"object": [
        {
            "@category": "standard",
            "@height": "300",
            "@width": "811",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr5.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "147465",
            "@ref": "gr5",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "785",
            "@width": "535",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr3.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "184894",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "186",
            "@width": "535",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr4.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "107062",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "148",
            "@width": "691",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr1.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "128049",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "271",
            "@width": "691",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr2.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "151115",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "81",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr5.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "74689",
            "@ref": "gr5",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "163",
            "@width": "111",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr3.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "75502",
            "@ref": "gr3",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "76",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr4.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "79536",
            "@ref": "gr4",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "47",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr1.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "71924",
            "@ref": "gr1",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "86",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr2.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "73881",
            "@ref": "gr2",
            "@mimetype": "image/gif"
        },
        {
            "@category": "high",
            "@height": "1328",
            "@width": "3591",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr5_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "723414",
            "@ref": "gr5",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "3480",
            "@width": "2371",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr3_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "882719",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "823",
            "@width": "2371",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr4_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "368534",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "657",
            "@width": "3060",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr1_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "577699",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1201",
            "@width": "3060",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-gr2_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "728684",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S036054422202463X-am.pdf?httpAccept=%2A%2F%2A",
            "@multimediatype": "Acrobat PDF file",
            "@type": "AAM-PDF",
            "@size": "1243753",
            "@ref": "am",
            "@mimetype": "application/pdf"
        }
    ]},
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/85140059028"
    }
}}