{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nModel predictive control (MPC) has shown potential in improving building performance but is bottlenecked by the difficulty in constructing control-oriented models. The challenge lies in evaluating the sufficiency of the model and the data usage beforehand. This paper bridges the knowledge gaps in the interactions between data requirements, model quality, and control performance by integrating real-world measurements and simulation-based experiments. The data usage related to occupancy and Internal heat gain (IHG) was studied considering its importance and the absence of consensus in the literature. Varying occupant-related data sources were tested as RC model inputs, including none, schedule, electricity consumption, CO 2 ppm, and ideal measurement. Combinations of model inputs and complexities were examined for prediction and control in an office, a classroom, and multi-zone offices on one floor. The results indicated that the usefulness of data is jointly affected by three factors: measurement suitability, model complexity, and modeling purpose. Given the adequate model structure, satisfying prediction and control performance was achieved in offices with no detailed measurement. Meanwhile, electricity and CO 2 were needed together to capture the IHG influence and realize the good performance for classrooms. The experiments also uncovered the heterogeneous requirements on models from traditional prediction tests and the control tasks. Lower prediction error did not always mean better control. More importantly, we provided the first quantitative demonstration of the complementary relationship between model adequacy and data informativeness with respect to different purposes. This study advocates the pioneering idea of sparse data usage and parsimonious modeling, which promotes the actual application of MPC in buildings by guiding control-oriented model development.\n\nAbstract\nGraphical abstract\n\nMethods\n2 Methodology 2.1 Simulation framework Fig. 1 shows the experiment framework, including the end-to-end emulation of implementing Model Predictive Control (MPC) in buildings. It consists of four main stages: emulator setup, model identification, model evaluation, and post-analysis. In each experiment, the high-fidelity emulator served as a real building to generate synthetic datasets while exposed to actual measurements of boundary conditions. The training and testing datasets were split to estimate the parameters of RC models and evaluate the identification results. Next, the MPC controller based on the identified RC model determined the control action through optimization, which was applied back to the emulators for control performance evaluation. Given the complete flexibility in dataset generation and the low cost of repeating experiments under the same boundary conditions, RC models with different complexities and inputs were comprehensively tested. Post-analysis was then carried out to establish the relationships between data requirements, model quality, and control performance. • Emulator model We designed three test cases for better generalizability. The first test case is BESTEST Case600, which is a single-zone office case with light-weight construction [43] . The room was conditioned by a fan coil unit that supplies air at a constant 13 °C. As the baseline control, a PI controller was used to adjust the supply airflow rate to meet the room temperature setpoint of 24 °C, which generated the synthetic dataset. To represent the large uncertainties in internal heat gains (IHG) in actual offices, we collected the occupant number and electricity consumption (plug and lighting) of an office for three months. The measured profiles, instead of standard design schedules, were applied to emulate occupant, equipment, and lighting heat gains. The actual meteorological year (AMY) data in Singapore was utilized for external disturbances. The second test case is a single-zone classroom case with the same geometry and HVAC system as the first test case. However, Wi-Fi access point connection number (as a proxy of occupant number) and electricity consumption (plug and lighting) were collected in an actual classroom and used as input schedules. Fig. 2 plots one week of the collected data, from which the larger scale and irregularity of classroom profiles can be observed. Incorporating actual data from different types of room functions introduced variations in the role of occupants and their temporal characteristics. The third test case is a multi-zone office on a single floor with five thermal zones (four perimeter zones and one core zone) that is based on the US Department of Energy medium office prototype building [44] . The internal gain profiles for each zone on each day were randomly sampled from the measured data of the office. While being also office-based, the multi-zone test case came with more complex system dynamics, such as the inter-zone heat transfer and the more complicated HVAC components. This is another critical factor that affects predictive and control performance. These emulators were built using the Modelica Buildings Library 1 1 https://simulationresearch.lbl.gov/modelica/ . and simulated for three months using PyFMI. 2 2 https://jmodelica.org/pyfmi/ . • RC model The RC models represent the simplified thermal dynamics of the room with a set of parameters θ (resistances, capacitances, and heat gain coefficients). More details about the model structures can be found in the section on experiment design. Synthetic data in a short period was used to estimate the parameters θ via Non-Linear Programming (NLP). Eq. (1) defines the estimation problem, where x is the states, u is the inputs, d is the disturbances, k is the number of rooms, t 0 and t 1 are the start and end time of training data. The lower and upper bounds of parameter values ( θ l b and θ u b ) are based on prior knowledge. Ten days were randomly picked from the remaining days in the three months to evaluate the identified models. Both training and testing adopted relatively long prediction horizons without re-initialization to incorporate more information about the building dynamics. To examine the extrapolation capability of the RC models, Root Mean Squared Error (RMSE) was calculated against operation data with 22, 24, and 26 °C room temperature setpoint. For the multi-zone case, RMSE was calculated against the average temperature of five zones, as well as the room temperature of each zone. (1) θ = a r g m i n ∫ t 0 t 1 ∑ i k ( T r o o m , i − T ̂ r o o m , i ) 2 s . t . T ̂ r o o m = f ( x , u , d , θ ) θ l b ≤ θ ≤ θ u b • MPC controller Two control experiments were conducted to comprehensively evaluate the models’ capability. First, Eq. (2) formulates a typical MPC optimization task. The quadratic objective function penalizes the cooling power and thermal discomfort with weights q u and q t . Cooling power is represented by the control input m f l o w , and thermal discomfort is quantified by the absolute value of Predicted Mean Vote (PMV) during the operating hours (7 am to 7 pm). The PMV was calculated assuming the relative humidity of 60% and quietly seated occupants with the typical summer indoor clothing [45] . The minimization is subject to the nominal airflow rate and comfort constraints. The prediction and control horizons are half an hour (two time steps), which is relatively short but enough for the indoor conditions to reach steady state. Longer horizons caused negligible change on the control actions in preliminary tests. The internal states were estimated using the Unscented Kalman Filter, and the boundary conditions were assumed to be known to eliminate its impact on the control performance. The control performance was evaluated on the randomly selected testing days according to the resulting energy consumption, average PMV, and discomfort hours. (2) J = ∫ t 0 t 0 + 30 m i n ∑ i k q u ( m f l o w , i ) 2 + q t ( P M V i ) 2 s . t . 0 ≤ m f l o w , i ≤ m f l o w , n o r m − 0 . 5 ≤ P M V i ≤ 0 . 5 Considering the trade-offs between comfort and energy, higher cooling temperature setpoints are often associated with lower energy consumption and higher discomfort risk. Therefore, these evaluation metrics cannot distinctly reflect the control performance. Meanwhile, good decision-making in all MPC tasks relies on accurate load prediction given future disturbances. Accordingly, we defined another control task of tracking the room temperature setpoint (Eq. (3) ), where the only objective is to maintain the room temperature by controlling the supply airflow rate. This control task was kept simple to eliminate other affecting factors and to study the effect of model mismatch. The control performance was quantified by average setpoint violations ( ° C ) and subsequently evaluated under three temperature setpoints (22, 24, and 26 °C) on randomly-selected days. Both control tasks were solved via NLP using the interior point method. (3) J = ∫ t 0 t 0 + 30 m i n ∑ i k ( T r o o m , i − T s e t p o i n t , i ) 2 s . t . 0 ≤ m f l o w , i ≤ m f l o w , c a p 2.2 Design of experiments Table 1 summarizes the key variables of the experimental design. Variations in the emulator configurations have been elaborated on in the previous section. The emulators output commonly available measurements, including room temperature, electricity consumption, CO2 concentration, and supply airflow rate. The exact amount of internal heat gain, typically immeasurable in practice, was also exported as an ideal situation for comparison. RC models with increasing complexities were designed respectively for the single-zone and multi-zone cases. Fig. 3 shows the schematic diagrams of all RC model structures, and the resulting total numbers of parameters of each model are specified in Table 1 . Three levels of complexities were tested for the single-zone cases. R1C1 lumped the entire room into a capacitor C 1 and a resistor R 1 connecting the outdoor temperature node. Cooling power and internal heat gain were directly delivered to the room temperature node, so was solar heat gain but with a coefficient a . R3C2 modeled the wall as a separate capacitor C w a l l and two resistors R w i and R w e . Another resistor R i n f i l was added to model the infiltration. Solar heat gain was then absorbed by the wall and room node with coefficients a i n t and a w a l l . R5C3 considered the heat transfer through the floor with three extra parameters R f i , R f e , and C f l o o r . Since the floor was exposed to a constant ground temperature, this configuration was expected to capture separate dynamics different from the wall. For the multi-zone case, R1C1 was too simplified to obtain comparable results and therefore excluded. R3C2 and R4C3 simplified the multi-zone dynamics as one zone and only modeled the average room temperature in response to the total cooling power. As the multi-zone emulator was not exposed to the ground temperature, R4C3 was used by removing the floor branch from R5C3 . Centralized multi-RC models characterized the heat flow between neighboring zones. R3C2_multi and R4C3_multi connected five single-zone RC models with a resistor R p a r as the partitions ( R1_partition ). Further, R3C2_par and R4C3_par modeled the partitions with R2C1_partition ( R p i , R p e , and C p a r ). In total, 6 RC model complexities were compared for the multi-zone case. Another essential variable in the experiment design is the input data of RC models. All models took outdoor temperature T o u t and global horizontal solar radiation Q s o l a r as external disturbances. The cooling power Q H V A C was estimated with the supply airflow rate m f l o w . For internal disturbances that model the internal heat gain (IHG), six data sources were tested: none , schedule , electricity consumption ( elec ), CO 2 ppm ( CO2 ), elec+CO 2 , and ideal measurement ( ideal ). More detailed measurements provide more information about IHG, yet is more costly to acquire in practice. Schedule referred to the standard schedule of offices [46] and the university administrative class schedule for the classroom. The load capacity C a p was multiplied to model IHG. Elec and CO2 were outputs of the emulator. The coefficients a e l e c and a C O 2 , as well as the offset b , were applied to fit IHG. Elec+CO 2 was elec and CO2 combined together, characterized by the three parameters a e l e c , a C O 2 , and b . These IHG-related parameters were also estimated through model identification. Ideal was the exact IHG measured from the emulators. Different combinations of RC model complexities and IHG inputs yield 18 alternative RC models for single-zone cases and 36 for the multi-zone case. Temporal and operational factors were also considered when generating the training dataset. We conducted preliminary experiments to investigate how they affect the model identification as suggested in past studies [24,47] . It appeared that time intervals smaller than 15 min were sufficient to capture the dynamics. Regarding the training data length, longer periods slightly reduced the error but drastically increased the computation time. Concisely, three days of training data with 15-min intervals reached a balance between training error and computation time for the single-zone cases, whereas one-day data with 15-min intervals best served the multi-zone case. Regarding the operation scheme, regular operation with a constant temperature setpoint of 24 °C was sufficient for the single-zone cases. However, the multi-zone case desired operational data with time-varying setpoints to provide adequate excitation and represent the inter-zone dynamics. Consequently, these were adopted for training data generation in further experiments.\n\nMethods\n2.1 Simulation framework Fig. 1 shows the experiment framework, including the end-to-end emulation of implementing Model Predictive Control (MPC) in buildings. It consists of four main stages: emulator setup, model identification, model evaluation, and post-analysis. In each experiment, the high-fidelity emulator served as a real building to generate synthetic datasets while exposed to actual measurements of boundary conditions. The training and testing datasets were split to estimate the parameters of RC models and evaluate the identification results. Next, the MPC controller based on the identified RC model determined the control action through optimization, which was applied back to the emulators for control performance evaluation. Given the complete flexibility in dataset generation and the low cost of repeating experiments under the same boundary conditions, RC models with different complexities and inputs were comprehensively tested. Post-analysis was then carried out to establish the relationships between data requirements, model quality, and control performance. • Emulator model We designed three test cases for better generalizability. The first test case is BESTEST Case600, which is a single-zone office case with light-weight construction [43] . The room was conditioned by a fan coil unit that supplies air at a constant 13 °C. As the baseline control, a PI controller was used to adjust the supply airflow rate to meet the room temperature setpoint of 24 °C, which generated the synthetic dataset. To represent the large uncertainties in internal heat gains (IHG) in actual offices, we collected the occupant number and electricity consumption (plug and lighting) of an office for three months. The measured profiles, instead of standard design schedules, were applied to emulate occupant, equipment, and lighting heat gains. The actual meteorological year (AMY) data in Singapore was utilized for external disturbances. The second test case is a single-zone classroom case with the same geometry and HVAC system as the first test case. However, Wi-Fi access point connection number (as a proxy of occupant number) and electricity consumption (plug and lighting) were collected in an actual classroom and used as input schedules. Fig. 2 plots one week of the collected data, from which the larger scale and irregularity of classroom profiles can be observed. Incorporating actual data from different types of room functions introduced variations in the role of occupants and their temporal characteristics. The third test case is a multi-zone office on a single floor with five thermal zones (four perimeter zones and one core zone) that is based on the US Department of Energy medium office prototype building [44] . The internal gain profiles for each zone on each day were randomly sampled from the measured data of the office. While being also office-based, the multi-zone test case came with more complex system dynamics, such as the inter-zone heat transfer and the more complicated HVAC components. This is another critical factor that affects predictive and control performance. These emulators were built using the Modelica Buildings Library 1 1 https://simulationresearch.lbl.gov/modelica/ . and simulated for three months using PyFMI. 2 2 https://jmodelica.org/pyfmi/ . • RC model The RC models represent the simplified thermal dynamics of the room with a set of parameters θ (resistances, capacitances, and heat gain coefficients). More details about the model structures can be found in the section on experiment design. Synthetic data in a short period was used to estimate the parameters θ via Non-Linear Programming (NLP). Eq. (1) defines the estimation problem, where x is the states, u is the inputs, d is the disturbances, k is the number of rooms, t 0 and t 1 are the start and end time of training data. The lower and upper bounds of parameter values ( θ l b and θ u b ) are based on prior knowledge. Ten days were randomly picked from the remaining days in the three months to evaluate the identified models. Both training and testing adopted relatively long prediction horizons without re-initialization to incorporate more information about the building dynamics. To examine the extrapolation capability of the RC models, Root Mean Squared Error (RMSE) was calculated against operation data with 22, 24, and 26 °C room temperature setpoint. For the multi-zone case, RMSE was calculated against the average temperature of five zones, as well as the room temperature of each zone. (1) θ = a r g m i n ∫ t 0 t 1 ∑ i k ( T r o o m , i − T ̂ r o o m , i ) 2 s . t . T ̂ r o o m = f ( x , u , d , θ ) θ l b ≤ θ ≤ θ u b • MPC controller Two control experiments were conducted to comprehensively evaluate the models’ capability. First, Eq. (2) formulates a typical MPC optimization task. The quadratic objective function penalizes the cooling power and thermal discomfort with weights q u and q t . Cooling power is represented by the control input m f l o w , and thermal discomfort is quantified by the absolute value of Predicted Mean Vote (PMV) during the operating hours (7 am to 7 pm). The PMV was calculated assuming the relative humidity of 60% and quietly seated occupants with the typical summer indoor clothing [45] . The minimization is subject to the nominal airflow rate and comfort constraints. The prediction and control horizons are half an hour (two time steps), which is relatively short but enough for the indoor conditions to reach steady state. Longer horizons caused negligible change on the control actions in preliminary tests. The internal states were estimated using the Unscented Kalman Filter, and the boundary conditions were assumed to be known to eliminate its impact on the control performance. The control performance was evaluated on the randomly selected testing days according to the resulting energy consumption, average PMV, and discomfort hours. (2) J = ∫ t 0 t 0 + 30 m i n ∑ i k q u ( m f l o w , i ) 2 + q t ( P M V i ) 2 s . t . 0 ≤ m f l o w , i ≤ m f l o w , n o r m − 0 . 5 ≤ P M V i ≤ 0 . 5 Considering the trade-offs between comfort and energy, higher cooling temperature setpoints are often associated with lower energy consumption and higher discomfort risk. Therefore, these evaluation metrics cannot distinctly reflect the control performance. Meanwhile, good decision-making in all MPC tasks relies on accurate load prediction given future disturbances. Accordingly, we defined another control task of tracking the room temperature setpoint (Eq. (3) ), where the only objective is to maintain the room temperature by controlling the supply airflow rate. This control task was kept simple to eliminate other affecting factors and to study the effect of model mismatch. The control performance was quantified by average setpoint violations ( ° C ) and subsequently evaluated under three temperature setpoints (22, 24, and 26 °C) on randomly-selected days. Both control tasks were solved via NLP using the interior point method. (3) J = ∫ t 0 t 0 + 30 m i n ∑ i k ( T r o o m , i − T s e t p o i n t , i ) 2 s . t . 0 ≤ m f l o w , i ≤ m f l o w , c a p\n\nResults\n2.2 Design of experiments Table 1 summarizes the key variables of the experimental design. Variations in the emulator configurations have been elaborated on in the previous section. The emulators output commonly available measurements, including room temperature, electricity consumption, CO2 concentration, and supply airflow rate. The exact amount of internal heat gain, typically immeasurable in practice, was also exported as an ideal situation for comparison. RC models with increasing complexities were designed respectively for the single-zone and multi-zone cases. Fig. 3 shows the schematic diagrams of all RC model structures, and the resulting total numbers of parameters of each model are specified in Table 1 . Three levels of complexities were tested for the single-zone cases. R1C1 lumped the entire room into a capacitor C 1 and a resistor R 1 connecting the outdoor temperature node. Cooling power and internal heat gain were directly delivered to the room temperature node, so was solar heat gain but with a coefficient a . R3C2 modeled the wall as a separate capacitor C w a l l and two resistors R w i and R w e . Another resistor R i n f i l was added to model the infiltration. Solar heat gain was then absorbed by the wall and room node with coefficients a i n t and a w a l l . R5C3 considered the heat transfer through the floor with three extra parameters R f i , R f e , and C f l o o r . Since the floor was exposed to a constant ground temperature, this configuration was expected to capture separate dynamics different from the wall. For the multi-zone case, R1C1 was too simplified to obtain comparable results and therefore excluded. R3C2 and R4C3 simplified the multi-zone dynamics as one zone and only modeled the average room temperature in response to the total cooling power. As the multi-zone emulator was not exposed to the ground temperature, R4C3 was used by removing the floor branch from R5C3 . Centralized multi-RC models characterized the heat flow between neighboring zones. R3C2_multi and R4C3_multi connected five single-zone RC models with a resistor R p a r as the partitions ( R1_partition ). Further, R3C2_par and R4C3_par modeled the partitions with R2C1_partition ( R p i , R p e , and C p a r ). In total, 6 RC model complexities were compared for the multi-zone case. Another essential variable in the experiment design is the input data of RC models. All models took outdoor temperature T o u t and global horizontal solar radiation Q s o l a r as external disturbances. The cooling power Q H V A C was estimated with the supply airflow rate m f l o w . For internal disturbances that model the internal heat gain (IHG), six data sources were tested: none , schedule , electricity consumption ( elec ), CO 2 ppm ( CO2 ), elec+CO 2 , and ideal measurement ( ideal ). More detailed measurements provide more information about IHG, yet is more costly to acquire in practice. Schedule referred to the standard schedule of offices [46] and the university administrative class schedule for the classroom. The load capacity C a p was multiplied to model IHG. Elec and CO2 were outputs of the emulator. The coefficients a e l e c and a C O 2 , as well as the offset b , were applied to fit IHG. Elec+CO 2 was elec and CO2 combined together, characterized by the three parameters a e l e c , a C O 2 , and b . These IHG-related parameters were also estimated through model identification. Ideal was the exact IHG measured from the emulators. Different combinations of RC model complexities and IHG inputs yield 18 alternative RC models for single-zone cases and 36 for the multi-zone case. Temporal and operational factors were also considered when generating the training dataset. We conducted preliminary experiments to investigate how they affect the model identification as suggested in past studies [24,47] . It appeared that time intervals smaller than 15 min were sufficient to capture the dynamics. Regarding the training data length, longer periods slightly reduced the error but drastically increased the computation time. Concisely, three days of training data with 15-min intervals reached a balance between training error and computation time for the single-zone cases, whereas one-day data with 15-min intervals best served the multi-zone case. Regarding the operation scheme, regular operation with a constant temperature setpoint of 24 °C was sufficient for the single-zone cases. However, the multi-zone case desired operational data with time-varying setpoints to provide adequate excitation and represent the inter-zone dynamics. Consequently, these were adopted for training data generation in further experiments.\n\nResults\n3 Single-zone simulation results 3.1 Identification and prediction Fig. 4 visualizes the RMSE results that evaluate the RC models’ prediction accuracy. Each bar chart compares the RMSE of the 18 alternative RC models for the corresponding test case and operating conditions. The bars under specific testing conditions represent the average RMSE of the randomly-selected testing days. It can be seen that RMSE was kept lower than 0.5 °C in most cases for the office, which means these simplified RC structures were able to track the basic trend of the room dynamics. For the classroom, however, RMSE was overall larger, and the error of less accurate models frequently exceeded 1 °C. The change of RMSE against different datasets was similar for the two cases: low for the training dataset, gradually increased as the testing conditions changed from 22 °C to 24 °C and 26 °C. This indicates that the models had some extrapolation capability but were weakened when the external heat gain and cooling power are smaller. In terms of comparing RC model structures, more complex models generally achieved lower training error. This is related to the stronger capability of fitting the data brought by the larger number of parameters. However, while R1C1 resulted in the largest RMSE in all testing cases, R3C2 and R5C3 showed fluctuating testing RMSE of insignificant difference across the cases. This is because heat flow through the floor was relatively insignificant, and therefore was harder to capture than heat flow through the walls (ceiling included). Fig. 5 explains this phenomenon by comparing the disaggregated heat flow of the emulator and RC models. On this testing day, the prediction error of R1C1 was mainly caused by the underestimation of cooling load in the afternoon. According to the second subplot, the order of heat flow intensity from the most to the least significant is wall, floor, internal heat gain (IHG), and infiltration. Comparing against the emulation data, it appears that neither R3C2 nor R5C3 correctly predicted the disaggregated heat flow. However, both models captured the aggregated heat flow and properly predicted the room temperature. Regarding the alternative IHG inputs, the office and classroom had different outcomes. Under the office internal disturbances, elec , CO2 , and elec+CO 2 led to comparable RMSE results with ideal , better than none and schedule . Meanwhile, it is again worth noting that the reduction of RMSE is minor and that all inputs, if not integrated with R1C1 , could contain the error within an acceptable range. In comparison, none , schedule , and CO2 had difficulty fitting the training data and yielded larger testing RMSE for the classroom case. elec and elec+CO 2 achieved similarly good results as ideal . Fig. 6 plots the predicted internal heat gain of R5C3 models with alternative inputs, which agrees with the RMSE results. IHG served a more significant role and was harder to predict in the classroom, causing the larger RMSE. Since the number of occupants had a very high correlation with the plug load in the office, both elec and CO2 followed the primary trend of IHG. Noticeably, elec missed several peaks created purely by occupants, and CO2 was delayed and smoothed, serving as a low pass filter. As the occupants and electricity load were less coupled in the classroom, elec and CO2 provided less accurate IHG prediction. Combining the previous two, elec+CO 2 got the highest accuracy in both cases. Schedule correctly modeled the rise in the daytime and the drop around noon of the office but failed to catch the minor variations and the baseload. For the classroom, Schedule could not capture the primary trend. Consequently, the identification underestimated the load capacity C a p to eliminate the influence, which also explains the amplified difference in RMSE. 3.2 Control experiment The first typical MPC objective (Eq. (2) ) balanced thermal comfort and energy consumption, referred to as the trade-off control task in the rest of this paper. Fig. 7 plots one example of the resulting temperature profiles on a testing day, compared with the room temperature of baseline control (constant 24 °C), the RC model’s expected room temperature when doing optimization, and the comfort zone. Two benefits of MPC can be observed: (1) pre-cooling the zone according to the predicted thermal response so that the temperature is within the comfort zone at the beginning of each day, and (2) reducing cooling load by maintaining a higher temperature without violating the comfort constraint. The control results were evaluated by the percentage of daily energy consumption compared with baseline control, the average PMV during operating hours, and the percentage of discomfort operating hours. All evaluation results are aggregated and visualized in Fig. 8 . Comparing across the subplots first reveals that all R3C2 and R5C3 models produced mostly identical results, saving 10%–15% of energy with the average PMV between 0.15–0.4. The office’s energy-saving percentage was slightly larger than that of the classroom. On the contrary, R1C1 models caused significant variances in the control performance. The risk of discomfort was substantially increased, making the lower average energy consumption not desirable. Looking at the marker shapes, most of the R1C1 points with long discomfort hours had none and schedule as the input. Moreover, although the performance consistency among R3C2 and R5C3 models for the office was not affected by input types, a few testing days suffered minor discomfort hours with none and schedule in the classroom. The missing information of internal heat gain caused the error in predicting the room temperature and therefore the comfort violation. An example is highlighted in red in Fig. 7 . When the cooling load was larger in the afternoon, the MPC optimizer attempted to balance the increase by pushing the room temperature closer to the upper bound of the thermal comfort constraint. This was when the requirements on the models’ prediction accuracy became stricter. Coupled with the increased internal heat gain that was not captured by schedule , the temperature went beyond the comfort zone. The second objective function (Eq. (3) ) purely examined the control preciseness using alternative RC models, referred to as the setpoint-tracking control task in the rest of this paper. The violin plots in Fig. 9 describe the distribution of daily average setpoint deviations using different models. The main observations in the trade-off control results hold in this task, such as the large deviations for R1C1 models and the stable performance among alternative model inputs in the office. Nevertheless, the classroom case had higher means and variances than the office, showing it was harder to control due to the more significant and variant disturbances. It is also shown that despite having close means, the variances of R5C3 models were usually smaller than R3C2 , indicating better robustness in controlling the temperature. In addition to the relatively bad performance of none and schedule , CO2 also experienced larger deviations occasionally.\n\nResults\n3.2 Control experiment The first typical MPC objective (Eq. (2) ) balanced thermal comfort and energy consumption, referred to as the trade-off control task in the rest of this paper. Fig. 7 plots one example of the resulting temperature profiles on a testing day, compared with the room temperature of baseline control (constant 24 °C), the RC model’s expected room temperature when doing optimization, and the comfort zone. Two benefits of MPC can be observed: (1) pre-cooling the zone according to the predicted thermal response so that the temperature is within the comfort zone at the beginning of each day, and (2) reducing cooling load by maintaining a higher temperature without violating the comfort constraint. The control results were evaluated by the percentage of daily energy consumption compared with baseline control, the average PMV during operating hours, and the percentage of discomfort operating hours. All evaluation results are aggregated and visualized in Fig. 8 . Comparing across the subplots first reveals that all R3C2 and R5C3 models produced mostly identical results, saving 10%–15% of energy with the average PMV between 0.15–0.4. The office’s energy-saving percentage was slightly larger than that of the classroom. On the contrary, R1C1 models caused significant variances in the control performance. The risk of discomfort was substantially increased, making the lower average energy consumption not desirable. Looking at the marker shapes, most of the R1C1 points with long discomfort hours had none and schedule as the input. Moreover, although the performance consistency among R3C2 and R5C3 models for the office was not affected by input types, a few testing days suffered minor discomfort hours with none and schedule in the classroom. The missing information of internal heat gain caused the error in predicting the room temperature and therefore the comfort violation. An example is highlighted in red in Fig. 7 . When the cooling load was larger in the afternoon, the MPC optimizer attempted to balance the increase by pushing the room temperature closer to the upper bound of the thermal comfort constraint. This was when the requirements on the models’ prediction accuracy became stricter. Coupled with the increased internal heat gain that was not captured by schedule , the temperature went beyond the comfort zone. The second objective function (Eq. (3) ) purely examined the control preciseness using alternative RC models, referred to as the setpoint-tracking control task in the rest of this paper. The violin plots in Fig. 9 describe the distribution of daily average setpoint deviations using different models. The main observations in the trade-off control results hold in this task, such as the large deviations for R1C1 models and the stable performance among alternative model inputs in the office. Nevertheless, the classroom case had higher means and variances than the office, showing it was harder to control due to the more significant and variant disturbances. It is also shown that despite having close means, the variances of R5C3 models were usually smaller than R3C2 , indicating better robustness in controlling the temperature. In addition to the relatively bad performance of none and schedule , CO2 also experienced larger deviations occasionally.\n\nResults\n4 Multi-zone simulation results 4.1 Identification and prediction The first and second row of Fig. 10 respectively shows RMSE against the average room temperature ( T a v e R M S E ) and the average of RMSE against the temperature of each room ( T z o n e R M S E ). All models well contained the RMSE within 0.5 °C with a few exceptions under 22 °C T s e t p o i n t and varying T s e t p o i n t . When the five zones were operated at the same temperature setpoint, the room temperature of different zones was essentially the same. Consequently, T z o n e R M S E was only slightly higher than T a v e R M S E . Therefore, the models were further tested with varying temperature setpoints. In this more stringent test, the single-RC models ( R3C2 and R4C3 ) still achieved T a v e R M S E close to the multi-zone RC models, but got significantly larger T z o n e R M S E . Among the multi-RC models, adding a capacitor for either the internal mass ( R4C3 ) or the partitions ( par ) had no distinguishable impact on the RMSE results. Except that the most complex models without the occupant-related inputs ( R3C2_par_none and R4C3_par_none ) got larger errors than the simpler models. As for the IHG inputs, schedule , elec , CO2 , and elec+CO 2 performed similarly, with the latter two sometimes extrapolated worse. Interestingly, RC models given the ideal measurement constantly observed the largest RMSE, which is further explored in Section 5.3 . 4.2 Control experiments Fig. 11 presents the trade-off control results on a testing day by R4C3_ideal , R4C3_multi_ideal , and R4C3_par_ideal . The benefit of pre-cooling and slightly warmer temperatures were similar to the single-zone cases. As the only control variable with single-RC models was the total cooling power, the supply air was proportionally distributed to the five zones according to the floor area. Understandably, the room temperature did not comply when the cooling load of each zone was subject to other factors. The first subplot of Fig. 11 serves as an illustration, where T _ c t r l _ E a s t and T _ c t r l _ W e s t went beyond the comfort zone respectively in the morning and afternoon because of the more intense solar heat gain. By contrast, R4C3_multi_ideal and R4C3_par_ideal supported more stable temperature control. Besides, the multi-RC models also maintained T _ c t r l _ C o r e higher than the other zones, knowing the core zone is more expensive to cool with its larger floor area. Fig. 12 summarizes the control evaluation results of all alternative models, where Y axis is the average PMV of all five zones. Unlike the single-zone cases, the multi-zone comfort compliance examination requires all zone temperatures to fall inside the comfort zone. Considering the aforementioned typical control behavior, it is not surprising to see the single-RC models frequently suffered a high percentage of discomfort hours. The multi-RC models achieved 10 to 25% energy saving with PMV varying between 0.1 and 0.2. A higher energy saving percentage was achieved with an even smaller average PMV than the single-zone office and classroom. The R3C2 and R4C3 results are basically the same, which means separated capacitors for internal mass and air did not improve the control performance. Meanwhile, adding the partition capacitor caused more diverse control performance and sometimes about 5% more energy saving. Multi-RC models with all IHG input types satisfied the thermal comfort during the experiments, implying no significant difference between each other in this control task. The daily average deviations of each alternative model in the setpoint tracking control were consistent with 22, 24, and 26 °C T _ s e t p o i n t and therefore aggregated by zone in the violin plots in Fig. 13 . The single-RC models were not included as their much worse performance can be inferred from the previous results. The temperature deviations of the four perimeter zones were always within 0.5 °C. However, it is conspicuous that the core zone experienced higher means and variances than the other four. Without the partition capacitor, this setpoint deviation problem remained regardless of the type of IHG input. In comparison, the core zone deviation was much reduced given the partition capacitor in the model, together with proper IHG inputs. For those better models, the setpoint deviations of the perimeter zones were also further depressed. The R4C3 models again showed no improvement from the R3C2 ones, except that schedule improved the performance of R4C3_par_schedule but not R3C2_par_schedule . Lastly, models with the ideal input had marginal improvement compared with their peers.\n\nResults\n4.2 Control experiments Fig. 11 presents the trade-off control results on a testing day by R4C3_ideal , R4C3_multi_ideal , and R4C3_par_ideal . The benefit of pre-cooling and slightly warmer temperatures were similar to the single-zone cases. As the only control variable with single-RC models was the total cooling power, the supply air was proportionally distributed to the five zones according to the floor area. Understandably, the room temperature did not comply when the cooling load of each zone was subject to other factors. The first subplot of Fig. 11 serves as an illustration, where T _ c t r l _ E a s t and T _ c t r l _ W e s t went beyond the comfort zone respectively in the morning and afternoon because of the more intense solar heat gain. By contrast, R4C3_multi_ideal and R4C3_par_ideal supported more stable temperature control. Besides, the multi-RC models also maintained T _ c t r l _ C o r e higher than the other zones, knowing the core zone is more expensive to cool with its larger floor area. Fig. 12 summarizes the control evaluation results of all alternative models, where Y axis is the average PMV of all five zones. Unlike the single-zone cases, the multi-zone comfort compliance examination requires all zone temperatures to fall inside the comfort zone. Considering the aforementioned typical control behavior, it is not surprising to see the single-RC models frequently suffered a high percentage of discomfort hours. The multi-RC models achieved 10 to 25% energy saving with PMV varying between 0.1 and 0.2. A higher energy saving percentage was achieved with an even smaller average PMV than the single-zone office and classroom. The R3C2 and R4C3 results are basically the same, which means separated capacitors for internal mass and air did not improve the control performance. Meanwhile, adding the partition capacitor caused more diverse control performance and sometimes about 5% more energy saving. Multi-RC models with all IHG input types satisfied the thermal comfort during the experiments, implying no significant difference between each other in this control task. The daily average deviations of each alternative model in the setpoint tracking control were consistent with 22, 24, and 26 °C T _ s e t p o i n t and therefore aggregated by zone in the violin plots in Fig. 13 . The single-RC models were not included as their much worse performance can be inferred from the previous results. The temperature deviations of the four perimeter zones were always within 0.5 °C. However, it is conspicuous that the core zone experienced higher means and variances than the other four. Without the partition capacitor, this setpoint deviation problem remained regardless of the type of IHG input. In comparison, the core zone deviation was much reduced given the partition capacitor in the model, together with proper IHG inputs. For those better models, the setpoint deviations of the perimeter zones were also further depressed. The R4C3 models again showed no improvement from the R3C2 ones, except that schedule improved the performance of R4C3_par_schedule but not R3C2_par_schedule . Lastly, models with the ideal input had marginal improvement compared with their peers.\n\nResults\n5.3 Towards control-informed model evaluation RMSE is not a perfect indicator for the models’ potential control performance, especially when the building dynamics get complicated. Linking Fig. 9 back to Fig. 4 , the setpoint deviations in control aligned well with the RMSE results for the single-zone cases. In the multi-zone office case ( Figs. 10 and 13 ), on the contrary, it is evident that the multi-RC models with ideal IHG input had larger RMSE than the others but performed better in tracking the setpoints. Fig. 15 illustrates the reason with prediction and control results of R3C2_par_schedule and R3C2_par_ideal on a testing day. R3C2_par_schedule predicted the room temperatures closer to the setpoint (ground truth), yielding smaller RMSE. However, the partition capacitor C p a r was significantly underestimated, and the five room temperatures displayed similar trends. Consequently, the core zone was continuously undercooled when applying the model for control. Whereas R3C2_par_ideal modeled the heterogeneous dynamics for each room instead of just fitting the temperature. While resulting in larger prediction errors, it achieved almost perfect setpoint tracking with the frequent state feedback in control. This particular case indicates that the more complicated multi-zone building dynamics demand stronger extrapolation capability of the models. Noting that absolute RMSE values were all small (mostly within 0.5 °C), precise control was a more demanding task than achieving low RMSE. The importance of control-oriented models being able to extrapolate has been widely acknowledged [47,58] . We inspected current approaches’ effectiveness in evaluating the models’ extrapolation capability. The first potential path is to apply excitation signals rather than normal operation when collecting data for training and testing [20] . The dataset could contain more information about the system dynamics and therefore improve the model. In this study, the test with varying T s e t p o i n t ( Fig. 10 ) successfully uncovered the deficiency of single-RC models but gave the same results regarding the ideal models. It might be arguable that a more aggressive test, such as varying temperature setpoints in a wider range, is needed. However, those experiments are expensive, if not infeasible, to conduct in practice, and the current test presented no tendency to yield better results. Another typical method lies in examining the physical meaning of RC parameters to make sure the models are physically authentic [36] . Alas, this is a nonstandard and difficult procedure owing to the diversified ways to simplify the model structure and lump the RC parameters. Taking advantage of the high-fidelity emulator, we compared the disaggregated heat flow along with the parameter values. Related findings are twofold. Fig. 5 demonstrates that RC models do not have to perfectly represent the building dynamics to obtain a good performance. Conversely, Fig. 15 reveals that well estimating the capacitors of the multi-RC models improved the control performance in the multi-zone office. To summarize, it is neither a rigid requirement nor an attainable goal for the RC models to exactly mirror the entire building dynamics. However, some critical components, such as the partitions in the multi-zone case, have to be correctly reflected. Based on the above analysis and past studies, it is premature to define a threshold of prediction error that guarantees the control performance. Nor is it straightforward to justify the models’ physical correctness. The insufficiency of existing model evaluation methods has started to draw attention recently [24] . The potential control performance needs to be informed before implementation to enable the scalable application. Thus, further investigation is needed to save the excessive experiments that ensure the models can be used for control.\n\nConclusion\n6 Conclusion This paper aims to address the interrelationships between data requirements, model quality, and control performance for MPC in buildings. Simulation-based experiments were conducted using high-fidelity emulation models integrated with real-world internal disturbances data. Case studies were designed to compare many combinations of IHG-related data sources and model complexities. The prediction and control performance of alternative models were tested under varied conditions in a single office, a single classroom, and five-zone offices. The experiments first revealed that the importance of data changed across different test cases. Given the adequate model structure, comparable prediction and control results can be achieved in offices with or without the detailed measurements for internal heat gain. As the variability and impact of internal heat gain are more significant in classrooms, electricity consumption and CO 2 ppm were needed. More informative data helped model the building dynamics and resulted in more robust setpoint tracking for the five-zone office, which was not reflected in the RMSE. This discloses the imperfect match between prediction and control performance, calling for further investigation to identify more indicative metrics of model capability. Last but not least, this is the first study that quantitatively articulates the complementary relationship between model adequacy and data informativeness. Disregarding the modeling purpose, a minimum level of adequacy is indispensable. Given sufficient data and proper identification, a higher degree of freedom is usually competent in improving prediction accuracy. More adequate models are desirable if the goal is to accurately represent the building dynamics for robust control. To advance the actual application of MPC, future research should be devoted to consolidating this theory of sparse data and parsimonious modeling.\n"
  }
}