{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nPoor building energy performance often arises from suboptimal operations such as inappropriate control sequences or hard faults in heating, ventilation, and air-conditioning (HVAC) systems. Furthermore, such deficiencies are often left unaddressed due to a lack of accessible analytical tools that can derive insights which identify energy-saving measures using multiple data resources. This paper presents a novel multi-source, data-driven building energy management toolkit as a synthesis of established inverse energy modelling, anomaly detection and diagnostics, load disaggregation, and occupancy and occupant complaint analytics methods in the literature. The toolkit contains seven functions that input HVAC controls, energy meter, Wi-Fi-based occupancy, and work order log data to detect hard and soft faults, improve sequences of operation, and monitor energy flows, occupancy patterns, and occupant satisfaction. The toolkit’s unique multifaceted analytical approach was demonstrated on a case study building as a proof of concept. Five faults pertaining to the air handling units’ mode of operation and heating coil valves were identified and the generated insights were used to pinpoint operational deficiencies stemming from inappropriate zone temperature overheating thresholds and perimeter heating devices. The toolkit, along with the data from the case study, is open-source and accessible through GitHub (Markus, 2021) to initiate and facilitate future development.\n\nResults\n1.1.4 Computerized maintenance management system data in benchmarking operational performance Albeit scarce in the practice, computerized maintenance management system (CMMS) data in the form of complaint logs and work orders have been analyzed and used to identify anomalous zones and malfunctioning equipment. Occupant temperature complaints are commonly symptomatic of faulty HVAC operation though often the corrective course of action for operators is to change temperature setpoints [63] . While this change may satisfy the individual complainant, it may dissatisfy the larger group. In this case, the problem may be more suitably attributed to an anomaly with the particular zone. Dutta et al. [64] employed association rule mining to extract occupant hot/cold complaints, and explored the spatiotemporal relationship of the complaints by using decision trees to quantify complaint frequencies and detect anomalous zone conditions; the same method was used to infer building performance metrics from tenant surveys [65] . Gunay et al. [66] proposed a complaints-based algorithm to extract insights into maintenance performance of building systems and components, and Assaf and Srour [67] developed a forecasting model for predictive maintenance employing artificial neural networks to predict number of thermal complaints. The greatest challenge in using CMMS data is the interpretation of such a large and unstandardized dataset. Thus, use of this type of data solicits ample preprocessing.\n\nMethods\n2 Methodology This section presents an overview of the function library with relationship to the publications forming its structure, the input data types with the relevant parameters, and its intended uses. The algorithms, literature sources, specific inputs and generated key performance indicators (KPI) of each function are presented in greater detail, as well as results from the case study, in Section 3. Fig. 1 illustrates the input data types, distribution of the data, and the KPIs that each function output. The corresponding data types are inputted into the functions which derive their own unique KPIs. Outdoor air temperature is used by the energyBaseline and complaintsAnalytics functions, though is treated as a discrete hourly weather data source (i.e., separate from HVAC controls network data) and not explicitly shown. Note also that HVAC controls data are optional for the complaintAnalytics function. Development of the BEM toolkit began with understanding the needs and challenges of the industry and the application venues for multi-source data analytics. A stakeholder’s workshop titled “Designing Future Building Energy Management Tools” was organized with over 50 expert participants in Ottawa, Canada. The participants included representatives from eleven companies that specialize in data analytics for BEM, two large building portfolio management companies, and government and university researchers. The workshop discussed the potential for additional insights from incorporating multiple data sources. For example, complaints analytics can be derived from investigating the spatiotemporal relationship between CMMS and HVAC controls data. Energy meter, occupancy, and HVAC controls data can be used to further disaggregate energy use into the building’s major end-uses. Key publications addressing multi-source data analytics applications were identified and gaps in such publications were addressed as additional contributions to the literature. Subsequently, interviews with building operators were conducted by Afroz et al. [80] to reveal the current functionalities of existing software tools. The findings of the workshop and interviews formed the structure of the function library which was subsequently presented to the industry stakeholders. The functions were developed to bridge the gap between information and action by providing operators with a means to quickly extract energy performance metrics and generate a brief and intuitive interface to inform energy-saving decisions. The function library was prototyped in MATLAB and subsequently translated into Python, an open-source programming language. A link to the repository accompanies the submission of this paper [1] . 2.1 Operation data input Hourly HVAC controls network trend data at the AHU- and zone-level served as inputs for five of the seven functions in Fig. 1 . These data are trend logs of AHU- and zone-level sensor and actuator measurements which were extracted from the BAS. The relevant data types for AHUs are supply, return, and outdoor air temperature (T sa , T ra , T oa ), supply air pressure (P sa ), outdoor air damper position (S oa ), heating coil valve position (S hc ), cooling coil valve position (S cc ), supply fan state (S fan ), supply air temperature setpoint (T sasp ), and supply air pressure setpoint (P sasp ). The relevant parameters for zones are the indoor air temperature (T in ), VAV terminal device airflow rate (Q flo ) and airflow setpoint (Q flosp ), and perimeter heater state (S rad ). Hourly building-level energy meter data for electricity, cooling, and heating energy use served as inputs for three of the functions in Fig. 1 . The electricity data typically represents end-uses for lighting, plug loads, fans, pumps, chiller consumption, and other equipment (e.g., elevators). The heating and cooling data represents the thermal energy transferred to the building at hourly intervals. Two CMMS data fields, the operator description of the work order and the report time, are used as inputs for one of the functions in Fig. 1 . Floor-level hourly Wi-Fi device count data acquired from an institutional IT network are used as inputs for two of the functions in Fig. 1 . 2.2 Intended use of the functions The BEM toolkit is intended to provide building operators with a versatile method to address operational deficiencies by interpreting metadata, fixing hard faults, fixing soft faults and upgrading sequences, and monitoring KPIs. With the exception of the metadata inference function ( metadata ) which is intended to automate the selection of the appropriate sensor and actuator labels used to extract HVAC controls network data, each function employs a unique methodology from the existing literature and generates KPIs and visualizations which can be used to inform energy-saving decisions or monitor energy use. The baseline energy function ( energyBaseline ) serves to illustrate the building’s heating, cooling, and electricity energy use as a function of outdoor air temperature during work-hours and after-hours. The generated KPIs are intended to help building operators assess the effectiveness of current operating schedules in reducing energy consumption outside of the AHUs’ operating hours and assess the effects that fixes to hard and soft faults and changes to sequences of operation have on energy consumption. Soft and hard AHU and VAV terminal faults may result in unintended excessive energy consumption. The AHU anomaly detection function ( ahuAnomaly ) is intended to detect anomalous operating conditions in AHUs which may be symptomatic of faults such as stuck heating coil valves, stuck cooling coil valves, leaky or stuck dampers, excessive use of perimeter heating in the economizer mode, absence of a schedule, and/or absence of an economizer mode. The generated insight is intended to help building operators focus fault correction efforts to specific AHUs and components. Similarly, the zone anomaly detection function ( zoneAnomaly ) is intended to detect anomalous zones based on temperature and airflow control errors which can help building operators isolate fault correction efforts to specific zones and VAV terminal units. An understanding of how energy is distributed within a building may aid in fostering energy-saving decisions and may be used to isolate energy use anomalies in major end-uses. The end-use disaggregation function ( endUseDisaggregation ) further separates bulk electricity, heating, and cooling consumption into six end-uses: electricity consumption into lighting and plug-in equipment loads, distribution, and chillers, heating consumption into perimeter heating and AHU heating coils, and cooling consumption into AHU cooling coils. This function is intended to calculate energy use intensities (EUIs) at a higher end-use resolution and help operators understand the flow of energy within the building’s systems should end-use submetering be unavailable in their buildings. Occupant-count patterns may be used to derive ventilation schedules that mitigate excessive energy use from overventilation, arising from an assumed constant and often overestimated occupant-count in the HVAC design phase. The occupancy function ( occupancy ) estimates occupancy-centric metrics per floor and is intended to inform building operators in refining ventilation schedules to appropriate amounts for the estimated occupancy. Occupant feedback may be used to estimate optimal indoor temperature setpoints for certain outdoor conditions that reduce the frequency of manual setpoint changes. Setpoint changes can impact a building’s energy performance [81] which can be exacerbated with increased frequency of user-solicited changes. The complaints analytics function ( complaintsAnalytics ) extracts hot/cold related complaints and models conditions which trigger those complaints, and is intended to aid building operators in understanding what conditions give rise to thermal complaints. Figure 2 summarizes the toolkit’s intended order to address operational deficiencies and the functions’ intended uses. It should be noted that the functions’ KPIs and visualizations, though developed with its intended use in mind, should not be limited to its intended use. For example, though the end-use disaggregation function is intended to monitor the flow of energy within a building, it can also be used to inform fault evaluation. However, the order of operation is critical. Detecting faults without first interpreting the metadata is difficult and attempting to understand the flow of energy in a building without first correcting hard and soft faults may lead to misinformed or erroneous insight. 2.3 Case study The capability of the toolkit was demonstrated on an academic building in Ottawa, Canada. Each function was employed using one or multiple streams of archived operational data accumulated over a year. The building is six-storeys high with one floor below-grade, has a gross area of 6650 m 2 , accommodates a suite of classrooms, offices, meetings rooms, and labs, and is equipped with two AHUs which serve 42 thermal zones. Each zone is equipped with at least one type of perimeter heating device – VAV reheat coils and/or ceiling-mounted hydronic heaters. Cooling is provided using two chillers located on site. A district plant provides steam which passes through the building’s heat exchanger and heats hot water used in the AHUs’ heating coils, VAV terminal reheat coils, and perimeter hydronic heating devices. The building has a switchover period between the heating and cooling season whereby mechanical cooling is unavailable during the heating season and space heating is unavailable during the cooling season. Two to five Wi-Fi access points are located on each of the seven floors. Hourly or sub-hourly Wi-Fi-enabled device count, HVAC control network trend, and energy meter network data were extracted, along with CMMS data, from four disparate operational databases. The case study dataset is provided along with the functions in the public GitHub repository [1] .\n\nResults and Discussion\n3 Results and discussion This section presents the inputs, generated KPIs and visualizations, algorithms used, assumptions and limitations, and accompanying literature which forms the basis of each function. The implementation of each function on data from the case study building is discussed along with the resultant visualizations and KPIs, as well as any potential insights. 3.1 Energy performance benchmarking ( energyBaseline function) Inputting energy meter data and outdoor weather data, the baseline energy function adopts the methodology described by Gunay et al. [16] and Afroz et al. [82] . The KPIs generated are the schedule effectiveness and after-hours energy use, calculated separately for heating, cooling, and electricity use. The schedule effectiveness reports the complement of the ratio of the after-hours to workhours rate of change of energy use as a function of outdoor air temperature. Lower values (approaching 0%) correspond to similar rates of change of energy use during workhours and after-hours which may be symptomatic of an ineffective or outright absence of a schedule where there is minimal reduction to energy use during after-hours. Greater positive values indicate a greater rate of change of energy use during workhours than after-hours while negative values indicate a greater rate of change of energy use during after-hours than workhours. The after-hours energy use computes the ratio of after-hours energy use to the total energy use separately for heating, cooling, and electricity. Lower values indicate minimal after-hours energy use while values approaching and exceeding 50% indicate similar or greater after-hours energy use. The energy baseline function generates two modified ASHRAE Guideline 14 [83] three-parameter univariate change point models - one representing workhours energy use and another representing after-hours energy use - for heating, cooling, and electricity use separately. Each model is defined using three parameters – the rate of change of energy use, the change point temperature, and the energy use associated with the change point temperature, with outdoor air temperature as the regressor. The after-hours and workhours separation of the modified three-parameter change point model is governed by a steady-periodic weekly AHU operating schedule. The model parameters and the start and stop times associated with the weekly AHU operating schedule were iteratively estimated using the GA which minimized the root-mean-square-error (RMSE) between the measured and modeled energy use, and were subject to upper and lower bounds. The GA was performed with 15 generations and a population size of 5000. Note that workhours and after-hours consumption is not representative of energy use during and outside occupant work schedules, but rather differentiates energy use during scheduled AHU operating hours and outside scheduled AHU operating hours, respectively. Collected meter data and outdoor temperature weather data from January 1st, 2019 to December 31st, 2019 from the building’s three dedicated heating, cooling, and electricity meters. These data were used to demonstrate the capability of the baseline energy function. Fig. 3 (a) compares the building’s heating energy consumption during and outside scheduled AHU operating hours as a function of outdoor air temperature; two other similar plots were produced which depicted cooling and electricity use. The gradient portion of the modelled energy use is indicative of the rate of change of energy use with respect to outdoor air temperature whereby steeper gradients represent greater rate of change of energy use. Fig. 3 (b) represents the building’s predicted heating load; another two plots were generated for cooling and electricity load in the same format. The predicted loads include the average steady-periodic variation during a weekday, resulting in the minor hourly variations, and are presented at select outdoor air temperature. They can be used to assess how energy use fluctuate during the day and how outdoor air temperature affects the magnitude of the fluctuations. Since the predicted energy loads are generated using the same datasets, alterations to the baseline consumption are reflected in the resulting predicted load. Table 1 presents the generated KPIs. Although the high schedule effectiveness and low after-hours energy use for cooling suggest an effective reduction in cooling energy use during after-hours in the case study building, it is unusual that any cooling energy is consumed outside the AHUs’ scheduled operating hours. In this case, an overheating IT room during the cooling season was identified to have woken up the AHUs overnight (i.e., night-cycling). The issue was discussed with the facility managers and the unoccupied mode temperature setpoint was increased from 27 °C to 28 °C; this behaviour has since stopped. Electricity use exhibited the lowest schedule effectiveness and highest after-hour energy use, suggesting that electricity energy use was not effectively reduced outside of the AHUs’ scheduled operating hours. This is not ideal. Although a fraction of the lights remains on in corridors and multi-purpose rooms during after-hours for safety purposes, the majority operate based on motion detection and turn off automatically if no motion from occupants is detected. Other electricity end-uses such as plug loads and elevators are influenced by occupancy. The most likely cause for the high after-hours electricity use may be from chiller activity and subsequent AHU fan power usage outside the AHU’s scheduled operating hours as a result of the previously mentioned overheating IT room (i.e., inappropriate night-cycling). Plug loads outside AHU operating hours would also contribute to the high after-hours electricity use (i.e., computers left on overnight, office appliances such as mini-fridges, etc.). Heating energy use is less effectively reduced during after-hours than cooling energy use. It should be considered that once the AHUs shut off, ventilation stops and there is no need to heat or cool outdoor air. Thus, the schedule effectiveness for heating is indicative of the role of ventilation on the overall heating demand. An abnormally high heating schedule effectiveness can indicate excessive heating demand during operating hours resulting from overventilation, at least beyond ASHRAE Standard 62.1 [84] . In contrast, an abnormally low heating schedule effectiveness indicates similar heating demands when ventilation is present during operating hours to when there is no ventilation outside operating hours. Such a case may be symptomatic of underventilation or poor envelope thermal insulative performance. In the case study building, the overheating IT room coupled with a disparate issue with the AHUs economizing in the heating mode, discussed later in subsection 3.3, caused the building to intake sub-zero outdoor air during the heating season which exacerbated perimeter heater loads outside scheduled hours. 3.2 Metadata inference for AHU and zone-level BAS labels ( metadata function) The metadata inference function which adopts the methodology described by Chen et al. [38] automates the metadata mapping process by classifying BAS labels into groups of the relevant sensor and actuator types, and then associating the labels to the corresponding AHU or zone [39,41,85] . The function classifies labels based on a pre-defined dictionary of common tag abbreviations which was developed by extracting multiple naming conventions from over 20 buildings’ BAS labels commissioned by varying control vendors. For example, labels representing supply air temperature trend log data commonly contain the abbreviations ‘tsa’ or ‘sat’. Thus, labels which contain one or more of these tag abbreviations are included in the label group for supply air temperature data. However, should the labels contain unsuitable tags such as ‘sp’, ‘stp’ or ‘set’, which may suggest the labels represent temperature setpoint data rather than temperature data, they are subsequently excluded. The edit distance for each label was computed and the least dissimilar label of each unique point type was associated to AHUs or zones. Should the labels be insufficiently descriptive and too dissimilar to be associated, the function resorts to applying the same analysis to the labels’ controller address which identifies the type of device and control points. A modified Levenschtein-distance analysis as depicted in Fig. 4 is employed for zone-level labels where numerical changes are weighed more heavily than alphabetical changes. The metadata inference function assumes that every AHU has one cooling coil with a unique label and that every zone has one airflow sensor with a unique label; the number of AHUs and zones are determined through this assumption. It is also assumed that HVAC controls data labels are associated with the AHU or zone so long as the label name or controller address are alphabetically or numerically similar (i.e., the cooling coil label for a particular AHU is similar to all other point type labels associated with that AHU). With the case study building, these assumptions resulted in inaccuracies in the metadata mapping process where one point label would be applied to multiple AHUs; these inaccuracies are expected. As such, this function is intended to be part of a semi-automated process administered by an analyst whereby review and manual revisions are allowed afterwards. Though the metadata inference function is intended to automate BAS metadata label classification in buildings without a metadata ontology, it is expected that this function may work just as well with metadata models like Brick and Project Haystack. The tag library which is used to classify metadata labels into groups of the relevant sensor and actuator types could be updated to specifically reflect the metadata ontology employed by such initiatives. This might even improve reliability of the function due to the greater level of labeling consistency that these initiatives provide. It should be noted that this function does not output any KPIs and serves purely to identify the labels which correspond to the required data types for HVAC controls network trend data. Though its purpose is inconsistent with the other functions in the toolkit, its inclusion was necessary as it enables the user to quickly identify the relevant HVAC controls network trend data required for the AHU anomaly detection, zone anomaly detection, end-use disaggregation, and complaints analytics functions. 3.3 Detection of AHU anomalies ( ahuAnomaly function) The AHU-level anomaly detection function inputs AHU- and zone-level HVAC controls network trend data to detect common soft and hard faults in AHUs and is based on the methodology described in by Gunay and Shi [86] and Darwazeh et al. [87] . The function outputs an AHU health index KPI for each AHU which yields a value of 100% when the AHU is free from the six fault types referenced in Table 2 (three hard and three soft fault categories) and 0% when all six faults are present. The function also develops two visualizations for each AHU in a building. The first presents the AHU actuator positions and the fraction of active perimeter heater devices on a schematic demonstrating the four modes of operation described in ASHRAE Guideline 36 [88] (i.e., heating, economizer, economizer with cooling, and cooling) over outdoor air temperature, see Fig. 5 . The coldest, warmest, and average zone temperatures as well as the supply air temperature are superimposed. The second visualization is a set of simplified AHU diagrams which capture AHU actuators and supply, return, outdoor, and mixed air temperatures at four to six distinctive periods of operations. The fraction of the captured actuator and temperature values to the total operating duration of the AHU and average perimeter heater valve state is also displayed as in Fig. 6 . The AHU-level anomaly detection function develops an inverse greybox model for each AHU and compares the estimated model parameters to detect common hard faults. The model predicts the supply air temperature of the AHU as a function of the outdoor and return air temperatures, outdoor air damper position, and the heating and cooling coil value positions. The inverse model for each AHU is defined using three parameters – the outdoor air fraction bias, the increase in air temperature across the heating coil when the heating coil valve is open, and the increase in air temperature across the cooling coil when the cooling coil valve is open. The parameters were iteratively estimated using the GA which minimized the RMSE between the measured and modeled supply air temperature. The GA was performed with 20 generations and a population size of 5000. Detailed information about the model form is described by Darwazeh et al. [87] . The hard faults detected by the function were outdoor air damper stuck (open or closed), and heating and cooling coil stuck (open or closed). In addition to hard faults, three soft faults were detected by employing the cluster analysis-based anomaly detection approach described by Gunay and Shi [86] . The k-means, Gaussian mixture, and agglomerative clustering algorithms were employed to group AHU operational periods of statistically similar damper, valve, and temperature measurements into four to six clusters for each AHU. Of the three algorithms, the best algorithm and its resultant number of clusters is selected using the Calinski-Harabasz index. The three soft faults detected by the function are excessive perimeter heating in the economizer mode, inappropriate economizer mode settings, and absence of a weekly schedule. The first soft fault is usually associated with an inappropriate supply air temperature setpoint reset approach. The second soft fault can be associated with the incorrect configuration of the split range AHU supply air temperature controller. The third fault can be due to the building not having a schedule or frequent cycling caused by a few rooms overheating beyond unoccupied indoor temperature setpoints; the former can be fixed by implementing an AHU operating schedule and the latter can be fixed by adjusting airflow and/or temperature setpoints of the VAV terminals of the overheating zones during unoccupied periods. HVAC controls network data from January 1st, 2019 to December 31st, 2019 were used to demonstrate the function’s ability to detect faults and energy use anomalies in the case study building’s AHUs. The schematic in Fig. 5 is the first generated visualization for one of the two AHUs in the building. The supply air temperature remains relatively constant at around 16 °C which indicates an absence of a supply air temperature setpoint reset logic where the supply air temperature is modulated with respect to outdoor air temperature to minimize concurrent cooling and heating. Ideally, supply air temperature is modulated to reflect the cooling and heating demands of the warmest and coldest zone respectively [89,90] . The GA determined the change point temperatures between the heating and economizer mode, economizer and economizer with cooling mode, and economizer with cooling and cooling mode to be about −5°C, 12 °C, and 21 °C, respectively. Two points of concern were observed in the case study building; the first point of concern was the unusually large fraction of operating perimeter heaters while the AHU was in the economizer mode. Ideally, there is minimal to no use of the perimeter heaters in this mode since the building is trying to induce cooling; hence the outdoor air damper modulating above its minimum position in the economizer mode. Second, the valve position of the heating coil, even at the peak of the heating season, was minimal; this suggests under-utilization of the AHUs’ heating coils. At −25 °C, the heating coil valve position is only at about 4% open. The heating coil valve positions are expected to be significantly more open (i.e., near/at 100% [88] ) at extreme cold outdoor air temperatures than what was observed. These abnormal trends suggested an identified conflict between the economizer mode and perimeter heating devices. To prevent overheating zones during the heating season, the economizer mode is engaged and subsequently the AHUs’ heating coils shut off if the average zone temperature exceeded an overheating zone temperature threshold. However, both the overheating threshold and zone temperature setpoints were 22 °C. The identical overheating threshold and the default zone temperature setpoints resulted in this threshold being frequently exceeded since the perimeter heaters, which are controlled through the zone temperature setpoints, operate on reactive-based controls and allow the zone temperature to slightly exceed their setpoints. This resulted in the AHUs operating in the economizer mode in an effort to cool the seemingly overheating building but with perimeter heaters working excessively to combat the intake of sub-zero outdoor air and maintain the zone temperature setpoint. Since the default zone temperature setpoints are 22 °C, the threshold for overheating in the heating season to engage the economizer mode was increased to 23.5 °C from 22 °C to allow the average zone temperature to slightly exceed its setpoint without engaging the economizer mode and differentiate from true overheating. The second generated visualization includes six diagrams for each of the case study building’s two AHUs (i.e., 12 diagrams in total) which provides a visual summary of common AHU operating periods and average actuator and damper positions and temperature measurements. The k-means clustering algorithm was selected based on the Calinski-Harabasz index and was used to group AHU operating periods of similar damper, valve, and temperature measurements into six clusters for each AHU.. Fig. 6 is one of six snapshots of one of the AHUs which characterizes 25% of the AHU’s cumulative operation. These summary diagrams can assist operating staff in interpreting the detected anomalies or in detecting other anomalies that were not detected by the function. Table 2 show the detected hard and soft faults and AHU health index. Low outdoor air was flagged in the second AHU which is typically symptomatic of an outdoor air damper that is stuck closed. However, this is more likely a result of a high fault detection threshold for outdoor air fraction bias. For the second AHU, lower outdoor damper positions tend to produce lower than expected outdoor air fractions, as indicated in Fig. 7 ; though not a fault, this resulted in an outdoor air fraction bias that is symptomatic of a stuck closed outdoor air damper. Even so, this can still prove problematic for indoor air quality purposes as outdoor air damper positions as high as 55% only supply about 20% outdoor air flow. The bias threshold is not suitable and should be reduced to avoid raising this false-positive. An absence of a schedule is detected in both AHUs which indicated operation of the AHUs exceeding 100 h per week (i.e., approximately 14 h per day); 100 h per week is the detection threshold for this fault for this case study. This was a result of an overheating IT room causing night-cycling. This issue has since been resolved as the unoccupied mode temperature setpoint was increased from 27 °C to 28 °C. Both AHUs were flagged for an inappropriate supply air temperature reset logic. The change point temperature between the heating and economizer with cooling mode for both AHUs was estimated to be about −5°C; it is suggested to increase the supply air temperature setpoint as an inappropriately low setpoint may exacerbate the use of perimeter heaters in the economizer mode. Both AHUs were also flagged for a stuck heating coil valve. This was expected as the conflict between the perimeter heating devices, which operate based on zone temperature setpoints, and the overheating zone temperature threshold to engage the economizer mode deterred the use of the AHUs heating coils. 3.4 Detection of zone-level anomalies ( zoneAnomaly function) Per the methodology presented by Gunay and Shi [86] , the zone-level anomaly function inputs the zone-level HVAC controls network trend data and groups zones with similar average seasonal errors for airflow and temperature setpoint control. The function outputs a zone health index KPI for the heating and cooling seasons separately which ranges from 0% if all zone clusters exbibit anomalous airflow control errors to 100% if no zone clusters exhibit anomalous conditions. Visualizations depicting the clustered zones with the corresponding indoor air temperature and acceptable ranges for airflow control error accompany the KPI. The function employs k-means, Gaussian mixture, and agglomerative clustering algorithms to group zones into three to five clusters, separately for the heating and cooling seasons. Of the three algorithms, the best algorithm and its resultant number of clusters is selected using the Calinski-Harabasz index and is used to produce the visualizations and KPIs. Faults are inferred should the mean zone temperature and/or mean airflow control error of a zone cluster fall beyond the pre-defined threshold for normal error. Note that this function may not be suitable for buildings with large core spaces and few perimeter heating devices; as the fraction of active perimeter heater devices is a required input for clustering for the heating season, this function is intended for building’s where the majority of zone contains some form of zone-level heating. Zone-level HVAC controls network data from January 1st, 2019 to December 31st, 2019 were used to demonstrate the zone-level anomaly detection function’s ability to detect anomalous zones in the case study building. Fig. 8 is the resulting visualization for the heating season analysis portion of the function; the cooling season analysis is depicted in a separate plot. The figure indicates which zone clusters suffer from airflow control and zone temperature anomalies and the severity of the anomalies. The airflow control error is the ratio of the error between the actual and the setpoint airflow rate over the setpoint airflow rate. In this analysis, an airflow control error of ± 20% and an indoor air temperature of 20 °C to 25 °C was deemed normal. For the heating season, four clusters of zones were identified using the k-means clustering algorithm. Zone clusters C0, C1, C2, and C3 were comprised of 17, 12, 12, and 1 zone respectively. Clusters C0, C1, and C2 all fall within acceptable airflow setpoint controls errors. The zone cluster C3 deviated from the other clusters and exhibited an airflow control error of −20.4% which is marginally below the threshold for normal airflow control errors. This may be symptomatic of a stuck damper inhibiting airflow to the zone, causing a deviation between the measured airflow and airflow setpoint. If a large number of zones exhibited this issue, it may be indicative of a low supply air pressure setpoint at the AHU-level. The health index, which is the ratio of zones within the threshold of acceptable airflow control error and indoor air temperature over the total number of zones, remains relatively high at 97.6% since only cluster C3 which contains only one zone is considered anomalous. For the summer, five clusters of zones were identified with the k-means clustering algorithm. The clusters comprised of 27, 3, 2, 4, and 6 zones, none of which exhibited anomalous conditions (within what is deemed normal). Thus, the health index remains at 100%. The breakdown of the plots and the zone health index KPIs are shown in Table 3 . 3.5 End-use disaggregation of meter data ( endUseDisaggregation function) The end-use disaggregation function inputs energy meter data, AHU- and zone-level HVAC controls network trend data, and Wi-Fi device count data and is based on the methodology described by Gunay et al. [74] and Darwazeh et al. [91] . The KPIs generated by this function are the EUIs for lighting and plug-loads, distribution (i.e., pumps and fans), and chiller for electricity energy use, EUIs for perimeter heating, the AHUs’ heating coils, and other appliances (i.e., domestic hot water) for heating energy use, and EUIs for the AHUs’ cooling coils for cooling energy use. Visualizations depicting the weekly distribution of the major end-uses for electricity, cooling, and heating accompany the KPIs. In Gunay et al. [74] , the GA was used to estimate the unknown parameters of separate disaggregation models for electricity use by lighting and plug-loads, distribution, and chillers. HVAC controls network data, such as fan state, and Wi-Fi data as proxy for occupancy were used to provide contextual information to the operational state of each end-use, allowing for higher disaggregation resolution. In other words, HVAC controls network and Wi-Fi data were used to inform the disaggregation. Darwazeh et al. [91] extended this approach beyond electricity alone by monitoring heating and cooling energy use and using HVAC controls network data such as heating and reheat coil states as contextual information. The end-use disaggregation function develops a load disaggregation model for each of the end-uses for cooling, heating, and electricity, and uses the GA to estimate its unknown parameters and minimize the RMSE between measured and modeled energy use. Each parameter represents a multiplier associated with the fraction of energy use attributed to each end-use. The GA was performed with 10 generations and a population size of 10000. Note that since lighting and plug loads, distribution, and chiller are the assumed major electricity end-uses, this function is not suitable for buildings with other significant electricity end-uses such as elevators and data centers, unless such end-uses are separated from the energy meter data prior to using the function. As Wi-Fi data were only available in the case study building from April 23rd, 2019 until the end of the year, these data along with energy meter data and AHU- and zone-level HVAC controls network trend data from the same period were used to demonstrate the capabilities of the end-use disaggregation function in the case study building. The generated visualizations in Fig. 9 represent the disaggregated EUI profiles of the major end-uses for electricity, heating, and cooling, and Table 4 shows the cumulative use for each end-use (i.e., the KPIs). Note that the due to the misaligned collection dates of data, specifically Wi-Fi data, the first 18 weeks of the plots are omitted. For electricity consumption, the lighting, plug-in, and distribution loads stay relatively consistent throughout the year whereas chiller loads transition during shoulder seasons and peak in the cooling season. This is not unusual since chiller use is largely seasonal and lighting is not expected to vary drastically by time of year. Likewise, the relatively constant daily energy use for distribution is expected as the building requires active ventilation during occupied hours regardless of season or operating mode. For heating, domestic hot water energy consumption is consistent and is expected. However, the heavy perimeter heating energy use relative to AHU heating coils is a point of concern. The heating coils in both AHUs seem to engage minimally, even at the peak of the heating season. This anomaly was also observed in the AHU-level anomaly detection function where the fraction of active perimeter heaters was consistently high and AHU heating coil valves remained minimal even at peak heating season. Chiller use shows similar load patterns and magnitude during the peak cooling season, though one AHU sees greater use near the shoulder seasons than the other. This is expected since the building will only use one chiller until it alone is insufficient to meet the cooling demand. 3.6 Analysis of hot/cold complaints ( complaintsAnalytics function) The complaints analytics function inputs CMMS data and extracts operator comments for thermal complaints for room air temperature. This function outputs four KPIs which indicate the daily frequency of hot complaints and cold complaints generated per 1000 m 2 during both the heating and cooling seasons. This is accomplished by employing the methods developed by Dutta et al. [64] whereby thermal complaints which contain the terms “hot” or “cool” are extracted from the CMMS data. As this function focuses on room air temperatures, the term “water” was also included in the search criteria to identify and remove complaints regarding water temperature. Three visualizations accompany the KPIs. The first depicts the hourly and monthly distribution of hot and cold complaints. The second is a decision tree model depicting the daily frequency of hot and cold complaints based on outdoor air temperature, indoor air temperature, and time of day. The third depicts the relationship between indoor and outdoor air temperature which trigger thermal complaints. Note that the function is limited only to hot and cold complaints, and that building area must be manually inputted. CMMS data from January 2nd, 2019 to December 23rd, 2019 were used test the capabilities of the complaints analytics function in the case study building. However, the suitability of this function with the case study building, and its ability to generate any meaningful insight from its visualizations and KPIs, were hindered by the small sample size of hot/cold complaints. In the case study building, a small fraction of the building’s occupants are full time employees while the majority are students with intermittent presence. The transient nature of occupancy may be a deterring factor for occupants to report thermal complaints [94,93] . A building with a more static occupancy would be expected to generate a substantially larger number of complaints, and would allow the function to provide more conclusive insights. Though the information provided by the function’s visualizations and KPIs are inconclusive, the generated visualizations are still provided as an example of how extracted information is presented to the user. Fig. 10 exemplifies the first set of visualizations generated by the function. These charts are provided to the user and are intended to break down the complaints by month, period of the day, and the type of complaint. The function also generates a regression tree which is intended to predict the expected frequency of hot/cold complaints based on the time of day, day of the week, and outdoor air temperature. Fig. 11 is an example of the visualization. Figure 12 is an example of the third generated visualization which is intended to depict the complaints in relation to outdoor air temperature and indoor temperature. 3.7 Occupant count estimation ( occupancy function) Based on the methodology presented by Hobson et al. [76] and Gunay et al. [94] , the occupancy function inputs Wi-Fi device count data to generate occupant count profiles of a building for weekdays and weekends separately. The function computes the earliest expected arrival time, latest expected departure time, and highest expected occupancy per floor, which are its KPIs. Visualizations depict the 25th, 50th, and 75th percentile occupant-count profile and the 75th percentile superimposed floor-level occupant-count profile for a typical weekend and weekday. The function uses Wi-Fi device count data as proxy for occupant count. Earliest arrival times are determined by the earliest timestep whereby the 75th percentile occupant count exceeded 10% of the maximum occupant count per floor. Likewise, latest departure times are determined by the latest timestep whereby the 75th percentile occupant count falls below 10% of the maximum occupant count per floor. Note that the occupant-count proxy assumes 1.2 Wi-Fi devices per occupant; this relationship between occupants and devices was established in the case study building using ground truth data in a previous study [95] . This assumption may not hold true in different buildings and might even change over time as Wi-Fi device protocols evolve and the presence of Wi-Fi enabled devices increases. An occupant count cut-off of three or less occupants per floor was also implemented to minimize the inclusion of artefacts caused by devices like printers and computers that are left on overnight. Wi-Fi device count data from April 23rd, 2019 to the end of the year were used to test the capabilities of the occupancy function in the case study building. Fig. 13 shows the resulting plots which depict the hourly occupant count at the 75th, 50th, and 25th percentile for a typical weekday and weekend. Fig. 14 disaggregates the 75th percentile occupant count per floor for weekdays and weekends. The earliest arrival time, latest departure time, and peak daily occupancy per floor KPIs are shown in Table 5 . The total occupancy of the building during workhours peaks at 292 occupants at around noon for the typical 75th percentile workday. This is a drastic reduction from the 1040 occupants during occupied hours that was assumed during the case study building’s design. The plots show the variation in occupant-count throughout the day and can be used to derive occupancy-based ventilation controls, which can modulate ventilation rates to suit the building’s actual occupancy and reduce the overventilation. The generated occupancy profiles and KPIs formed the basis for an occupancy-based predictive control program which implemented different hourly outdoor air damper position profiles in the case study building’s AHUs at the beginning of 2020 based on day-ahead occupant count predictions [96] . 3.8 Discussion and limitations The BEM toolkit’s multifaceted analytical approach is intended to provide operators with a method to capture and monitor the propagated effects of operational deficiencies through various KPIs and visualizations. The amount of unique analytical methods under one toolkit offers a more comprehensive understanding of building operations, thus allowing for a more flexible and diverse approach in addressing deficiencies and improving operations. Underlying deficiencies are more likely to be captured since energy use anomalies and suboptimal operations undetected from one function can be detected from a number of the other functions. Furthermore, since many KPIs and visualizations are derived from the same data, underlying deficiencies can be captured from multiple unique interpretations of the data which can be consolidated to focus fault correction efforts to specific components or systems. In fact, these redundant indicators between functions are encouraged if they suggest a mutual deficiency since it strengthens the confidence of the toolkit’s detection capabilities. For example, recall for the case study that the low heating schedule effectiveness KPI derived from the baseline energy function indicated excessive heating energy use outside of the AHUs’ operating hours. Should analysis be limited to this KPI, a number of different root causes should be examined such as a lack of an AHU heating schedule, conflicts in the operational logic, or excessive heating demand during operating hours due to overventilation. However, Fig. 5 from the AHU anomaly detection function indicated excessive use of the perimeter heating devices; this issue was also seen in Fig. 9 (c) from the end-use disaggregation function. Presented with this additional insight, an end-user would be compelled to investigate the relationship between excessive heating energy use and the perimeter heating devices. The root cause was determined as a conflict between the perimeter heating devices, which operate based on zone temperature setpoints, and the zone temperature overheating threshold to engage the AHUs’ economizer mode which led to excessive heating energy use; an overheating IT room propagated this issue to outside scheduled AHU operating hours. These issues have since been resolved. Though this example demonstrates the interrelated nature of the toolkit’s functions, and the benefit of multiple interpretations of the data, it also demonstrates that the toolkit’s ability to generate energy-saving insight is limited by the building operator’s interpretation of the generated KPIs and visualizations. The scope of the toolkit’s capability is limited to detection and monitoring of potential operational deficiencies whereas diagnosis and correction is left to the operator’s discretion. One of the inherent challenges of implementing a BEM toolkit to multiple buildings is the varying availability and granularity of data in different buildings. Underlying factors such as HVAC setups and physical building characteristics can also affect the toolkit’s ability to generate reasonable and accurate KPIs, particularly for the anomaly detection functions that rely on detection thresholds which may exclusively suit a case study building. Though this toolkit was never intended as a universal solution but rather a framework from which derivations of BEM solutions may be fostered, its preliminary state, including its structure and methodologies, should at least demonstrate that a toolkit encompassing multiple domains of data analytics can diversify opportunities to address operational deficiencies within an intended scope of building type and use; in this case study, medium to large commercial and institutional buildings. Regarding availability of data, the functions operate independent of each other such that if a lack of certain data or adequate data quality restricts one function, other functions that do not use that data can still be implemented and generate KPIs; this adds flexibility to the toolkit’s overall implementation. It is expected that not all functions will be useful for every building. For example, the complaints analytics function was not well suited for the case study building since the building is primarily occupied by students who are intermittently present and less likely to complain. In this case, a low frequency of complaints should not suggest optimal indoor air setpoints but rather that the function cannot produce conclusive insight for the building. In addition, each function was also developed to input as little data as possible to generate KPIs, even if it meant excluding data streams that were available in the case study building and could have been used to improve reliability or accuracy of the KPIs. The toolkit’s seven selected functions were built upon established data-driven methods which are familiar to the building energy performance community, and is intended to provide a basis for future development of multi-source solutions. A preliminary version of the toolkit is publicly available online for others to learn from, adapt, and foster into more specialised versions of multi-source, data-driven toolkits. The major domains which were identified to attribute considerable improvements to building energy performance were energy benchmarking, AFDD, and OCC. Each function, excluding the metadata inference function ( metadata ), can be categorized to address one of these three domains. Where multiple functions address a single domain, different data sources or combination of data sources are employed to allow flexibility of data availability in varying buildings.\n\nResults\n3.1 Energy performance benchmarking ( energyBaseline function) Inputting energy meter data and outdoor weather data, the baseline energy function adopts the methodology described by Gunay et al. [16] and Afroz et al. [82] . The KPIs generated are the schedule effectiveness and after-hours energy use, calculated separately for heating, cooling, and electricity use. The schedule effectiveness reports the complement of the ratio of the after-hours to workhours rate of change of energy use as a function of outdoor air temperature. Lower values (approaching 0%) correspond to similar rates of change of energy use during workhours and after-hours which may be symptomatic of an ineffective or outright absence of a schedule where there is minimal reduction to energy use during after-hours. Greater positive values indicate a greater rate of change of energy use during workhours than after-hours while negative values indicate a greater rate of change of energy use during after-hours than workhours. The after-hours energy use computes the ratio of after-hours energy use to the total energy use separately for heating, cooling, and electricity. Lower values indicate minimal after-hours energy use while values approaching and exceeding 50% indicate similar or greater after-hours energy use. The energy baseline function generates two modified ASHRAE Guideline 14 [83] three-parameter univariate change point models - one representing workhours energy use and another representing after-hours energy use - for heating, cooling, and electricity use separately. Each model is defined using three parameters – the rate of change of energy use, the change point temperature, and the energy use associated with the change point temperature, with outdoor air temperature as the regressor. The after-hours and workhours separation of the modified three-parameter change point model is governed by a steady-periodic weekly AHU operating schedule. The model parameters and the start and stop times associated with the weekly AHU operating schedule were iteratively estimated using the GA which minimized the root-mean-square-error (RMSE) between the measured and modeled energy use, and were subject to upper and lower bounds. The GA was performed with 15 generations and a population size of 5000. Note that workhours and after-hours consumption is not representative of energy use during and outside occupant work schedules, but rather differentiates energy use during scheduled AHU operating hours and outside scheduled AHU operating hours, respectively. Collected meter data and outdoor temperature weather data from January 1st, 2019 to December 31st, 2019 from the building’s three dedicated heating, cooling, and electricity meters. These data were used to demonstrate the capability of the baseline energy function. Fig. 3 (a) compares the building’s heating energy consumption during and outside scheduled AHU operating hours as a function of outdoor air temperature; two other similar plots were produced which depicted cooling and electricity use. The gradient portion of the modelled energy use is indicative of the rate of change of energy use with respect to outdoor air temperature whereby steeper gradients represent greater rate of change of energy use. Fig. 3 (b) represents the building’s predicted heating load; another two plots were generated for cooling and electricity load in the same format. The predicted loads include the average steady-periodic variation during a weekday, resulting in the minor hourly variations, and are presented at select outdoor air temperature. They can be used to assess how energy use fluctuate during the day and how outdoor air temperature affects the magnitude of the fluctuations. Since the predicted energy loads are generated using the same datasets, alterations to the baseline consumption are reflected in the resulting predicted load. Table 1 presents the generated KPIs. Although the high schedule effectiveness and low after-hours energy use for cooling suggest an effective reduction in cooling energy use during after-hours in the case study building, it is unusual that any cooling energy is consumed outside the AHUs’ scheduled operating hours. In this case, an overheating IT room during the cooling season was identified to have woken up the AHUs overnight (i.e., night-cycling). The issue was discussed with the facility managers and the unoccupied mode temperature setpoint was increased from 27 °C to 28 °C; this behaviour has since stopped. Electricity use exhibited the lowest schedule effectiveness and highest after-hour energy use, suggesting that electricity energy use was not effectively reduced outside of the AHUs’ scheduled operating hours. This is not ideal. Although a fraction of the lights remains on in corridors and multi-purpose rooms during after-hours for safety purposes, the majority operate based on motion detection and turn off automatically if no motion from occupants is detected. Other electricity end-uses such as plug loads and elevators are influenced by occupancy. The most likely cause for the high after-hours electricity use may be from chiller activity and subsequent AHU fan power usage outside the AHU’s scheduled operating hours as a result of the previously mentioned overheating IT room (i.e., inappropriate night-cycling). Plug loads outside AHU operating hours would also contribute to the high after-hours electricity use (i.e., computers left on overnight, office appliances such as mini-fridges, etc.). Heating energy use is less effectively reduced during after-hours than cooling energy use. It should be considered that once the AHUs shut off, ventilation stops and there is no need to heat or cool outdoor air. Thus, the schedule effectiveness for heating is indicative of the role of ventilation on the overall heating demand. An abnormally high heating schedule effectiveness can indicate excessive heating demand during operating hours resulting from overventilation, at least beyond ASHRAE Standard 62.1 [84] . In contrast, an abnormally low heating schedule effectiveness indicates similar heating demands when ventilation is present during operating hours to when there is no ventilation outside operating hours. Such a case may be symptomatic of underventilation or poor envelope thermal insulative performance. In the case study building, the overheating IT room coupled with a disparate issue with the AHUs economizing in the heating mode, discussed later in subsection 3.3, caused the building to intake sub-zero outdoor air during the heating season which exacerbated perimeter heater loads outside scheduled hours.\n\nConclusion\n4 Conclusions and future work The framework for a multi-source, data-driven BEM toolkit as a synthesis of established data-driven approaches from the literature has been proposed with its inputs, algorithms used, and generated visualizations and KPIs. The toolkit is intended to provide building operators with a method to address operational deficiencies such as energy use anomalies and inappropriate schedules by interpreting metadata, detecting faults and upgrading sequences, and monitoring KPIs. The current capability of the toolkit was demonstrated using various disparate types of archived operational data from an academic building. Though energy use anomaly detection was discussed extensively, the toolkit’s ability to produce energy benchmarking and occupancy-based analytics should not be overlooked as these insights are similarly instrumental for deriving energy-saving decisions. Should building operators capitalize on the toolkit’s flexibility, the toolkit can be implemented in a wide range of different buildings. A preliminary version of the toolkit is publicly available through GitHub [1] and is intended to facilitate community-driven efforts to refine the existing functions or serve as a basis upon which more specialized multi-source, data-driven solutions can be derived. A push to refine the functions should not be limited to improving reliability but should also work to improve robustness. Limiting data sources to what is absolutely required to generate the desired insight may not necessarily reduce the accuracy of the KPIs but would allow the toolkit to operate in buildings that lack high resolution data. Derivations of multi-source toolkits may also incorporate additional, reduced, or altered functions to suit a particular set of buildings, or even establish explicit interdependencies between functions. Currently, the only interdependency between functions exists with the metadata inferencing function. Even then, it only serves to prepare the data for input in subsequent functions. A potential benefit of using the same set of data is that the generated KPIs and visualizations may concurrently suggest the same deficiencies. Such redundancies, as demonstrated by the baseline energy, AHU anomaly detection, and end-use disaggregation functions’ role in detecting a conflict between the AHUs’ economizer mode and the perimeter heating devices, would add a layer of confidence to the toolkit, especially in its anomaly detection capabilities, and can minimize the likelihood of false-positive detection. Revisions to the toolkit should attempt to integrate the KPIs and develop likelihoods of true faults in addition to just simple detection. If two or more functions generate seemingly corroborative insight, the likelihood of a specific fault or number of faults would increase. By contrast, should conflicting insights exist, the likelihood would decrease. Future case studies will demonstrate the capabilities of the toolkit on other commercial and institutional buildings and the results will be disseminated to showcase its energy-saving potential and the need to further develop data-driven approaches to BEM. Furthermore, interviews with building operators will supplement understanding of how the toolkit’s generated KPIs are actually used by operators, inform the development of performance metrics and visualization, and further improve the existing capabilities of the toolkit.\n"
  }
}