{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nA model predictive control system with adaptive machine-learning-based building models for building automation and control applications is proposed. The system features an adaptive machine-learning-based building dynamics modelling scheme that updates the building model regularly using online building operation data through a dynamic artificial neural network with a nonlinear autoregressive exogenous structure. The system also employs a multi-objective function that could optimize both energy efficiency and indoor thermal comfort, two often contradicting demands. The proposed model predictive control system is implemented to control the air-conditioning and mechanical ventilation systems in two single-zone testbeds, an office and a lecture theatre, located in Singapore for experimental evaluation of its control performance. The model predictive control system is compared against the original reactive control system (thermostat in the office and building management system in the lecture theatre) in each testbed. The model predictive control system reduces 58.5% cooling thermal energy consumption in the office and 36.7% cooling electricity consumption in the lecture theatre, as compared to their respective original control. Meanwhile, the indoor thermal comfort in both testbeds is also greatly improved by the model predictive control system. Developing a model predictive control system using machine-learning-based building dynamics models could largely cut down the model construction time to days as compared to its counterpart using physics-based models, which usually take months to construct. However, the machine-learning-based modelling approach could be challenged by lack of building operational data necessary for model training in case of model predictive control development before the building has become operational.\n\nMethods\n2 Methodology 2.1 Overview Fig. 1 gives an overview of the methodology adopted by this study. Historical building operation data of the test building controlled by its original BMS is collected offline into a database. The historical building operation data is used to construct and train an initial building model using ANN, which is chosen due to its high accuracy to model nonlinear systems [36] . The ANN-based initial building model is then used to formulate an initial MPC controller. The initial MPC controller is integrated into the test building and replaces the original BMS to perform real-time control of the test building, which generates a new set of online building operation data. This new data set is collected and fed back to the database at each control interval for adaptation of the ANN-based building model periodically at a time interval (‘model adaption interval’). Once the ANN-based building model is updated by adaptation, a new MPC controller is formulated automatically using the updated model and performs real-time control during the next model adaption cycle. Finally, the control performance of the MPC controller is evaluated by comparing to historical building operation data. In this study, the proposed MPC system with an adaptive ML-based building model is developed and experimentally implemented in two single-zone testbeds, an office room and a lecture theatre, as described in Chapters 3 and 4. 2.2 Building modelling To achieve optimal energy efficiency and thermal comfort, the building model should be able to capture the dynamics of building physics and to estimate indoor thermal comfort. Thus, the building model includes two sub-models: (1) a building dynamics model that predicts indoor conditions such as air temperature, humidity and globe temperature with inputs of internal loads, weather conditions and cooling power of ACMV systems and, (2) a thermal comfort model to estimate indoor thermal comfort index with inputs of indoor conditions. A dynamic ANN for time series prediction is needed to capture the time-dependent nature of building dynamics [37] . An ANN with the dynamic recurrent nonlinear autoregressive exogenous (NARX) architecture, as shown in Fig. 2 , is employed in this study. The internal architecture of the NARX ANN is a feedforward multi-layer perceptron (MLP) ANN, which is an ANN structure for modelling continuous linear/nonlinear systems [37] . The NARX ANN architecture has three layers including input, hidden and output layers. It is constructed based on the MLP ANN by adding a feedback loop and time delays. A NARX ANN model could be expressed by a nonlinear function as, (1) y t = f y t - 1 , y t - 2 , ⋯ y t - d y , u t - 1 , u t - 2 , ⋯ u t - d u , where symbols f (), y , u , t and d refer to function, output, input, time and number of time steps delayed. This study employs a sigmoidal activation function, which is commonly used in MLP ANN. The model parameters including weights and biases are identified by supervised learning using measured building operation data. A large size (layers and neurons) MLP ANN could lead to issues including (1) high risks of overfitting in model training and (2) high computation load. These two issues could cause low prediction accuracy and computing efficiency for MPC, respectively, limiting the control performance. The ‘trial-and-error’ [38] method is used to obtain a small-size ANN with high prediction accuracy which also keeps the risk of overfitting and the demand of computing power low. Besides, the training, validation and testing procedures are employed using three datasets for each ANN. The prediction performance of the ANN is kept consistent during both training, validation and testing stages to avoid overfitting. Indoor thermal comfort is determined by multiple factors including indoor environmental factors (air temperature, humidity, mean radiant temperature and air velocity) as well as individual factors (occupants’ metabolic rate and clothing insulation). Indoor thermal comfort is not directly affected by outdoor conditions but some indoor environmental factors including indoor air temperature, humidity and mean radiant temperature are affected by outdoor conditions. The thermal comfort model of the predicted mean vote (PMV) index [39,40] is employed to evaluate indoor occupant thermal comfort. The PMV model is used for predicting the future indoor thermal comfort in the prediction horizon for MPC to optimize indoor thermal comfort. As the PMV model is nonlinear and its calculation requires an iteration procedure to evaluate clothing surface temperature [39] , using the original MPC model could cause a high computation load. Thus, a simplified PMV model is used in this study. The PMV model is also usually simplified for MPC in previous studies. Cigler et al. [7] developed a linear PMV model using a linear approximation to construct an MPC controller for optimizing indoor thermal comfort and building energy efficiency. West et al. [14] developed a simplified thermal comfort model that is a quadratic function using a numerical approximation approach and developed a MPC controller for optimizing the operation of an air-conditioning system. Klauˇco and Kvasnica [41] developed a linearized PMV model with time-varying parameters and formulated an explicit MPC controller using the linearized PMV model for optimizing indoor thermal comfort. In our previous study [10] , a linear PMV model was developed using linear approximation and it was used to construct MPC controllers [16,17] . Carli et al. [42] used the original PMV model to construct a MPC controller. However, the authors of Carli et al. [42] mentioned they had to use a very simple building thermodynamics model (1st order) in order to balance the complexity and nonlinearity of the original PMV model. Thus, the simplified PMV models that are of less complexity but with high-fidelity of accuracy as compared to the original PMV model. 2.3 MPC formulation MPC controllers are developed to control the ACMV systems in the two testbeds (to be described in Sections 3 and 4 ). Differing from conventional control approaches (e.g., PID) that track a set point temperature of room air, the objectives of MPC, as described by Eq. (2) , are to minimize the cooling energy consumed by ACMV systems and minimize the offset between indoor PMV and the thermal neutrality (PMV = 0). (2) J = M i n i m i z e ( ∑ k = 1 N Q ^ t + k | t 2 + ∑ k = 1 N [ W PMV ( PMV ^ t + k | t ) ] 2 + W ε ε t + k | t ) , where symbols J , Q ^ , PMV ^ , W , N , and ε refer to objective, normalized cooling power, normalized PMV index, penalty factor, prediction horizon, and slack variable. Subscript k refers to index of time steps. Particularly, the three terms on the right-hand-side refer to the costs of cooling energy consumption, thermal discomfort and constraint violation, respectively. The normalized cooling power, Q ^ , is the ratio of instantaneous cooling power over the cooling capacity of the ACMV system, defined as (3) Q ^ = Q / Q max . The normalized PMV index, PMV ^ , is the ratio of measured indoor PMV over the comfortable range of PMV, defined as (4) PMV ^ = P M V / ( PMV max - PMV min ) . The constraints of the manipulated variable (cooling power provided by the ACMV system) are (0, Q max ) and the constraints of the output variable (indoor PMV) are (-0.5, 0.5), which are the comfortable thermal comfort range [39] . In Eqs. (3) and (4) , symbol Q refers to heat flow rate (W). Subscripts min and max refer to minimum and maximum, respectively. The objective function (Eq. (2) ) also yields the building model, which is an equality constraint for the MPC. In this study, the penalty factor, W PMV , is set at 4 which gives a high weightage to the thermal comfort term compared to other terms in Eq. (2) [10] . With this setting, the MPC controller puts emphasis on keeping indoor PMV close to thermal neutrality (PMV = 0) as it seeks to minimize cooling energy consumption. The penalty factor, W ε , is set at 100,000, which represents very small allowable violations [43] . The control interval, control horizon and prediction horizon are 5 min, 2 control intervals and 12 control intervals, respectively. The prediction horizon of 60 min (12 control intervals) is long enough to cover the response time of the indoor thermal conditions of the two testbeds. For instance, it takes around 40 min for indoor PMV to be cooled down to the best thermal comfort during the morning start-up of ACMV of both testbeds. This chosen prediction horizon is also not too long to cause excessive computational load. The control interval is set at 5 min such that control responses are fast enough to catch up with the building dynamics. For instance, the building takes around 40 min to cool down, a control interval of 5 min means that there are 8 control responses made during the cool-down period. However, using an exceedingly short control interval would also cause excessive computation load [43] . The control horizon is set at 10 min (2 control intervals). This is the shortest control horizon possible without having a large impact from Q(t + 2) (optimal solution of cooling power at control interval t + 2) on the suboptimality of Q(t + 1) (optimal solution at control interval t + 1), which is the one that is applied as the control signal. Bemporad et al. [43] also suggest that using a short control horizon helps in internal stability in the MPC controller. The impact of length of control horizon on the suboptimality of Q(t + 1) was tested for up to 4 control intervals in the MPC development stage. The difference in the suboptimality of Q(t + 1) for horizon lengths of 2–4 control intervals is negligible. The control horizon of 2 control intervals means all the solutions after control interval t + 2 (i.e., Q(t + 3), …, Q(t + N)) are set to be the same as Q(t + 2). Other configurations of the MPC for the specific testbeds are described in Sections 3 and 4 . As the NARX ANN-based building dynamics model is nonlinear, a nonlinear optimizer is needed to solve the nonlinear optimization problem of the MPC. Several global optimization approaches such as exhaustive search method (ESM) [44] , genetic algorithm (GA) [45] , particle swarm optimization (PSO) [46] and firefly algorithm (FA) [47] as well as gradient-based approaches such as interior-point method [48] and subsequent quadratic programming (SQP) [49] have been used to solve the nonlinear optimization problems in BAC applications. The global optimization approaches have good performance in finding global optima as compared to the gradient-based approaches. However, these global optimization approaches are computationally intractable for real-time optimization in a dynamic system since solutions would need to be reached within a short control interval [50] . Gradient-based approaches could have much faster convergence than global optimization approaches [37] but are susceptible to yielding local optimal, instead of global, with inappropriate initial guesses of solutions. In order to address the challenges facing the two types of approaches, this study proposes a hybrid optimization approach that combines the global and gradient-based optimization approaches to solve the nonlinear optimization problem of the MPC. The concept behind the hybrid optimization approach is that coarse global optimal solutions in the prediction horizon are first searched using a global optimization approach (primary optimizer). The coarse solutions are then passed to a gradient-based optimizer (secondary optimizer) as initial guesses. The secondary optimizer then searches the final optimal solutions around the initial guesses by numerical computation. This hybrid approach speeds up the convergence and reduces the possibility of landing on local optimal solutions, as compared to a single gradient-based optimizer using fixed or random initial guesses. ESM, as shown in Fig. 3 , is employed in the primary optimizer. ESM is a ‘generate-and-test’ algorithm that searches all the candidates to find the optimal candidate [51] . For the optimization problem of the MPC, the solution (cooling power) is constrained within the range (0, Q max ) and it could be discretized into a series of candidates ( Q 1 , Q 2 , …, Q m ), where Q 1 = 0 and Q m = Q max . The prediction horizon and control horizon of the MPC are 12 and 2 control intervals. The variable m is given a value of 10 that gives computationally tractable optimization problems without making the initial guesses too coarse. With these settings, the search space of 100 candidates is generated for the ESM optimizer. The ESM optimizer evaluates the PMV result of each candidate using the building model (building dynamics and thermal comfort models). The ESM optimizer then evaluates the cost of each candidate using Eq. (2) . Finally, the ESM optimizer determines the optimal candidate by comparing the costs of all the candidates from the search space. The secondary optimizer employs an SQP algorithm, which is a nonlinear optimization algorithm and is from the MATLAB Optimization Toolbox [52] in this study. Since the ANN-based building dynamics/thermal comfort models (employing sigmoidal activation function as described Section 2.2 ) in this study are continuously differentiable, gradient-based SQP is capable of solving the nonlinear optimization problem using these ANN models as equality constraints. Similar approach is used in a number of previous studies such as Javed et al. [53] , Ławryńczuk [50] , Xie et al. [54] , etc. The hybrid optimization problem is solved employing the MATLAB environment [51] in this study. 2.4 MPC system architecture The proposed MPC system consists of a MPC controller, a model adaptation module and a local controller, as illustrated in Fig. 4 . The MPC system is initialized using measured historical building operation data as described in Section 2.1 . As the MPC system controls the building, the MPC controller generates optimal solutions of the manipulated variable (cooling power of ACMV systems) in the prediction horizon and passes the solutions of the first control interval to the local controller. The local controller is based on the PID scheme and tracks the optimal cooling power by regulating the actuators in ACMV systems. The disturbances, state variables and manipulated variables are measured/estimated in real-time and passed to the MPC controller at each control interval for next-step optimization. The disturbances are assumed to be constant during a prediction horizon. More details of the MPC system for specific testbeds are described in Section 3 and 4 . The online building operation data, including the cooling power control signal generated by the MPC controller, measured disturbances and room conditions, as shown in Fig. 4 , are stored in the database of the model adaptation module. The model adaptation module updates the building dynamics model by supervised learning using the building operation data stored in the database. The frequency of the model adaptation is controlled by a timer in the module. This study uses a model adaptation time interval of 24 h, covering a full diurnal operation cycle of test buildings [56] . This model adaptation time interval allows the accumulation of building operation data to a volume that could cause significant changes in the building dynamics model in model adaptation. To evaluate the control performance of the proposed MPC system in real building settings, testbeds are set up in two different buildings including (1) an office with moderate occupancy load representing typical commercial built environment and, (2) a lecture theatre with heavy occupancy representing high-heat-load built environment.\n\nMethods\n3 Experimental study in an office 3.1 Test building The MPC system was implemented in an office at level 3 of the Research Techno Plaza (RTP) building on the campus of NTU, as shown in Fig. 5 . The floor area of the office is 46 m 2 and the floor-to-ceiling height is 3 m. The office is surrounded by adjacent air-conditioned spaces including offices, corridor and atrium. Thus, outdoor thermal effect on indoor conditions of the office is neglected. Partition wall 1 and 2 are 0.1 m thick and each is fitted with four internal windows (1.8 m W × 1.2 m H). Partition wall 3 has an entrance (1.4 m W × 2.2 m H) and is fitted with a window (1.4 m W × 1.2 m H) at each side of the entrance. The structural wall adjacent to the atrium is 0.23 m thick and is fitted with a window (2.7 m W × 3.5 m H). The office has eleven desks arranged along the walls and a meeting table at the middle, as shown in Fig. 5 . Internal lighting is provided by eight 0.6 m × 0.6 m lighting fixtures with light-emitting-diode (LED) lamps fitted on the ceiling. Each light fixture draws 40 W of lighting power. The lights are controlled by a manual switch. 3.1.1 ACMV system Air conditioning to the office is provided by a ceiling-mounted variable air volume (VAV) box with maximum airflow capacity of 1320 m 3 /h. The VAV box supplies conditioned air through three 4-way spread type ceiling diffusers with dimensions of 0.6 m × 0.6 m. The conditioned air to the VAV box is supplied from a fan coil unit (FCU) mounted outside of the office. The FCU also serves a few other adjacent offices, simultaneously. Room air is returned through a liner grille and finally to the FCU through the ceiling air plenum, as shown in Fig. 5 . The supply air flowrate was regulated by an air damper in the VAV box, which was originally controlled by a thermostat with a room temperature set point of 23 °C. Supply air temperature is not controlled by the thermostat but it varied between 16 and 22 °C during the test period, based on measurement. The pre-set control parameters in the original thermostat are not being adjusted for this study so to preserve the original control characteristics of the thermostat. The MPC system is implemented as an add-on alternative control for the VAV box. The control of the VAV box could switch between the original thermostat control and the MPC system. Air conditioning is on from 8 am to 6 pm, Monday to Friday and is switched off during the remaining time of the week. 3.1.2 Instrumentation Additional sensors are installed in the room space and ACMV system, as shown in Fig. 5 , for the implementation of the MPC system and to monitor the performance of the two control systems (original thermostat and MPC). A combined air temperature-relative humidity (RH) sensor and an airflow sensor are installed in the supply air duct leading to the VAV box for real-time monitoring of cooling power supplied to the office. Another combined air temperature-RH sensor is installed on the meeting table for real-time monitoring of room conditions. The above-mentioned sensors are connected to an inputs/outputs (I/O) device and the readings are passed to the MPC system in real-time. A thermal comfort measurement device that consists of sensors for measuring air temperature, RH, air velocity and globe temperature and a data logger is installed near the meeting table for monitoring of thermal comfort in the room space. The sensor readings of the thermal comfort measurement device are stored in its data logger offline. The specifications of these additional sensors are listed in Table 1 . 3.2 Modelling Two ANN models including a building dynamics model for predicting room air temperature and a thermal comfort model for predicting indoor PMV of the office are developed, as illustrated in Fig. 6 . The ANN-based building dynamics model is based on the NARX structure. The input variables of the building dynamics model for room air temperature ( T z ) prediction include cooling power ( Q sa ) provided by supply air, hour of day ( hod ), operation status ( os ) of ACMV and lighting (1-on, 0-off) and the feedback of room temperature. As the office is not exposed to the outdoor environment as shown in Fig. 5 , the outdoor conditions would not impose heat exchanges with the indoor in the building dynamics model for this testbed. The building dynamics model could be expressed as (5) T z t + 1 = f Q sa t , h o d t , o s t , T z t , where f (), T , Q , hod, os, and t refer to function, temperature ( o C), heat flow rate (W), hour of day, operation status of ACMV and lighting (1 for on, 0 for off) and time (s). Subscripts z and sa refer to thermal zone and supply air. The room air temperature is measured by the combined air temperature - RH sensor installed on the meeting table. The cooling power provided by supply air from the VAV box is calculated using the measurements of supply air temperature, room air temperature and supply air flowrate, as expressed by (6) Q sa = m ̇ sa T z - T sa , where m ̇ refers to mass flow rate (kg/s), based on the assumption that room air is well mixed in the office. Since the air-conditioning of the office only involves the airside (VAV box), the measurement of latent cooling power is highly sensitive to the measurement error of RH in the supply/return air. The modelling of the ACMV system is based only on the sensible load for this testbed. Thus, indoor RH is not predicted by the building dynamics model but is measured and assumed constant at the measured value during a prediction horizon for indoor PMV prediction. As the sensor readings of the thermal comfort measurement device are stored in its data logger offline, there is no real-time feedback of the globe temperature to the MPC controller. Thus, the globe temperature is not predicted by the building dynamics model to avoid the error accumulation in globe temperature prediction. An MLP based feedforward ANN is used to predict indoor PMV using the inputs of indoor air temperature and RH instead of the original/linearized PMV model that requires the input of globe temperature. Indoor globe temperature is treated as an unmeasured disturbance. The feedforward neural network model could be expressed by (7) PMV = f T Z , RH z . The model is trained by providing measured room air temperature and RH data as input and measured indoor PMV data by the thermal comfort measurement device as output. The metabolic rate per occupant for PMV calculation in the office is assumed constant of 1.2 met for common office work. Cloth insulation is also assumed constant of 0.57 clo of the occupants wearing trousers and short-sleeve shirts in the office. The variables of the office model (building dynamics + thermal comfort) are listed in Table 2 . The historical building operation data for training of the initial ANN models was measured for one-month-long when the office was under the original thermostat control. The measured data is acquired by an inputs/outputs (I/O) device (National Instruments cDAQ-9189) in real-time at 5-second intervals and stored in the database at 5-minute intervals, except that the measured indoor PMV is stored in the data logger of the PMV measurement device at 5-minute intervals. The historical building operation data and indoor PMV data are divided into three subsets randomly picked along the timeline. 70% of the data is used for model training, 15% for model validation, the remaining 15% is used for testing. The two neural network models were trained using the Levenberg-Marquardt (LM) algorithm in MATLAB deep learning toolbox [57] . One hidden layer and two neurons of the hidden layer are selected for both the building dynamics model and the thermal comfort model of the office testbed based on the ‘trial-and-error’ method. The R 2 -values of training, validation and testing of the initial building dynamics model are 0.995, 0.995 and 0.996, respectively and 0.998, 0.998 and 0.998, respectively, for the thermal comfort model. The R 2 values indicate that the trained ANN models have high prediction accuracy. Increasing the size of the ANN model might not bring significant benefit but could lead to higher computation loads for MPC and higher risks of overfitting. For both building dynamics and thermal comfort models with the selected model size, the R 2 values during training, validation and testing stages are consistent, showing no evidence of overfitting. The building dynamics model will be further updated continuously when the MPC is controlling the office as described in Sections 2.1 and 2.4 using the online building operation data whereas the thermal comfort model remains unchanged. 3.3 MPC system The MPC system is added as an alternative control system to the original thermostat control. The objectives of the MPC system are to minimize cooling energy consumption and chase the best thermal comfort, as shown in Eq. (2) . To achieve the objectives, the MPC system minimizes the cooling power provided by supply air ( Q sa ) from the VAV box and indoor PMV. Cooling power provided by the supply air of the VAV box is calculated using supply air flowrate, supply air temperature and room air temperature as shown in Eq. (6) . At each control interval, the MPC controller generates an optimal cooling power of the VAV box and sends the optimal cooling power to the local controller. The local controller regulates the supply air flowrate through the air damper in the VAV box according to the optimal cooling power set point generated by the MPC controller. Since there are some time-varying disturbances (e.g. time-varying temperature difference between supply air and room air) on the cooling power that add uncertainties on set point tracking for the local controller, the local controller runs at a much shorter sampling interval (5 s) than the control interval of the MPC controller (5 min) to track the optimal cooling power set point continuously. The parameters of the PID loop of the local controller were manually turned by the ‘trial-and-error’ method so that the PID loop can track the set point rapidly without large overshooting. It was found that the average absolute mismatch between the set point and measured cooling power is 65 W based on the MPC test results. Since the measured state variable (room air temperature) is fed back to the MPC controller at each control interval, the prediction error of the thermodynamics model caused by the cooling power mismatch is eliminated at each control interval. The measured cooling power, room air temperature and RH are fed back to the MPC controller for next time step optimization through the same I/O device described in Section 3.2 at each control interval. Operation data of the office is stored at 5-minute intervals in the MPC system for model adaption of the building dynamics model. The MPC system was implemented in a control sever with a CPU of Intel Core i5-3317U @ 1.70 GHz and 4G RAM. 3.4 Experimental arrangement Two test cases including the VAV box is (1) controlled by the original thermostat (‘thermostat’ case), and (2) controlled by the MPC system (‘MPC’ case), were conducted. Each test case ran for a continuous period that contains 20 workdays (December 2018 – January 2019 for thermostat case and February 2019–March 2019 for MPC case). Besides the purpose of revealing the control performance of the thermostat, the building operation data measured during the thermostat case were also used to construct the initial ML-based building dynamics and thermal comfort models for the MPC controller, as described in Section 3.2 .\n\nMethods\n3.4 Experimental arrangement Two test cases including the VAV box is (1) controlled by the original thermostat (‘thermostat’ case), and (2) controlled by the MPC system (‘MPC’ case), were conducted. Each test case ran for a continuous period that contains 20 workdays (December 2018 – January 2019 for thermostat case and February 2019–March 2019 for MPC case). Besides the purpose of revealing the control performance of the thermostat, the building operation data measured during the thermostat case were also used to construct the initial ML-based building dynamics and thermal comfort models for the MPC controller, as described in Section 3.2 .\n\nMethods\n4 Experimental study in a lecture theatre 4.1 Test building, ACMV system and instrumentation Another testbed is set up in Lecture Theatre 3 (or LT) (seating capacity of 240 and floor area of 255 m 2 ) on the campus of NTU. LT is air-conditioned by a VAV air-handling unit (AHU) with a fan driven by variable speed drive (VSD), as illustrated in Fig. 7 . LT is also installed with variables sensors as shown in Fig. 7 . AHU was controlled by its original BMS according to a set point temperature of 24 °C in room air. Outdoor air temperature and humidity sensors are installed outside the LT to monitor outdoor conditions. Indoor air temperature, humidity, globe temperature and air velocity sensors are installed in the room space to monitor indoor conditions and the readings of these sensors are used to evaluate indoor PMV. Air temperature, humidity, CO 2 concentration and flowrate sensors are installed in the air loop of the ACMV system to monitor the ACMV variables. A thermal energy meter is installed at the chilled water loop to monitor the cooling power of the ACMV system. All the sensors described above are connected to an I/O system that passes the readings to the MPC system in real-time. Further details of the lecture theatre, its ACMV system and instrumentation used in the testbed can be found in Yang et al. [17] . 4.2 Modelling Three NARX ANN models to predict indoor air temperature, humidity ratio and globe temperature of LT are developed as shown in Fig. 8 and Eq. (8) . For the LT testbed, the building dynamics model described by Eq. (8) has input variables including cooling power ( Q cw ) provided by the chilled water supplied into the AHU, operation status of ACMV and lighting ( os ), outdoor air temperature ( T o ), outdoor RH ( RH o ), the estimated number of indoor occupancy ( n occ ) and the feedback of the output variables ( T z , RH z , T g ). Q cw , which is a heat sink to LT, is modelled as a manipulated variable for the MPC controller. T o and RH o , which are external heat loads to LT, are modelled as measured disturbances for the MPC controller. Another external heat load, solar radiation, is not measured/modelled in this study. This is because the LT is located within sunshades [17] . Solar radiation is treated as an unmeasured disturbance for the MPC controller. n occ , which is an internal heat load to LT, is another measured disturbance for the MPC controller. Other internal loads including lighting power are represented by os (lighting is on when os is 1 and lighting is off when os is 0) and os is also a measured disturbance for the MPC controller. T z , RH z and T g are the state variables for the MPC controller. The variables of the building dynamics model of LT are listed in Table 3 . T z t + 1 = f Q cw t , o s t , T o t , RH o t , n occ t , T z t , ψ z t + 1 = f Q cw t , o s t , T o t , RH z t , n occ t , RH z t , (8) T g t + 1 = f Q cw t , o s t , T o t , RH z t , n occ t , T g t . In Eq. (8) , symbol ψ refers to humidity ratio (kg/kg). Subscripts g , cw, occ and o refer to globe, chilled water, occupancy and outdoor, respectively. The input/output variables for training the ANN models described by Eq. (8) are measured by the sensors installed in LT. The cooling power Q cw is measured by the thermal energy meter installed at the chilled water loop of the AHU. The cooling power provided by the chilled water is calculated by, (9) Q cw = m ̇ cw T cwr - T cws , where subscripts cw , cwr and cws refer to chilled water, chilled water return and chilled water supply. The outdoor air temperature and RH are measured by the temperature and RH sensors installed in outdoor space. Room air temperature and humidity are measured by twelve combined temperature-humidity-pressure-lux (THPL) sensors. Room air velocity and globe temperature are measured by the air velocity and globe temperature sensors. The occupancy in LT is estimated based on the CO 2 balance in the room space using the measured CO 2 concentration in supply air and return air as well as the measured supply air flow rate by (10) n occ = G sa ( C ra - C sa ) / S , where symbol G , C and S refer to volume flow rate (m 3 /s), CO 2 concentration (m 3 /m 3 ) and CO 2 generation rate per person (m 3 /s). Subscript occ refers to occupant. CO 2 generation rate per person is assumed constant at 3 × 10 -4 m 3 /s for very light activity levels of occupants in classrooms [58] . The ANN models are initialized using measured historical building operation data of LT. The data used was measured in 5 weeks during 9th–20th January, 18th–24th February, 18th–24th March and 01st–07th April 2019 when LT was controlled by the original BMS. The data was stored at 5-minute intervals. Same model training, validation and testing setup as the office testbed is used for LT. One hidden layer and five hidden neurons are selected for the three ANN models for LT. The R 2 -values of training, validation and testing of the initial ANN model for room air temperature prediction are all 0.999. The R 2 -values of training, validation and testing of the initial ANN model for globe temperature prediction are also all 0.999. The R 2 -values of training, validation and testing of the initial ANN model for indoor humidity ratio prediction are 0.999, 0.998 and 0.998, respectively. As the indoor air temperature, humidity and globe temperature could be predicted by the building dynamics model (Eq. (8) ), a simplified PMV calculation equation developed in the previous study [10] is used for LT using the three variables as described by Eq. (11) . Eq. (11) is linear and simpler than that (Eq. (5) ) used for the office testbed. (11) PMV = 35.707 ψ z + 0.141 T mr + 0.159 T z - 89.625 Eq. (11) is derived based on the assumption that clothing insulation and metabolic rate of occupants are constant at 0.5 clo and 1.2 met in the room space of LT. Subscript mr refers to mean radiant. The variables of the LT model (building dynamics + thermal comfort) are listed in Table 3 . 4.3 MPC system The MPC system is installed in LT as an additional control system. The MPC system also adopts optimization formulation as described in Eq. (2) . The MPC system minimizes the cooling power provided by the chilled water ( Q cw ) supplied into the AHU and indoor PMV index. Q cw is calculated using flowrate, supply temperature and return temperature of the chilled water as shown in Eq. (9) . When the MPC system is controlling the AHU, the MPC system generates the optimal cooling power for the cooling coil and passes the optimal cooling power to the local controller (PID loops) in each control interval, as shown in Fig. 4 . The local controller regulates the chilled water flowrate supplied into the AHU through the water valve indicated in Fig. 7 to chase the optimal cooling power generated by the MPC controller. The local controller also runs at a 5-second sampling interval and was tuned by the same method as that for the office testbed described in Section 3.3 . The readings of the sensors shown in Fig. 7 are collected by an I/O system (Schneider AS) and passed to the MPC system in real-time. The number of occupants is estimated based on the measured supply air CO 2 concentration, return air CO 2 concentration and supply air flowrate using Eq. (10) . The measured outdoor air temperature, RH, cooling power of the ACMV system as well as the estimated number of occupants are passed to the MPC controller for the next-step optimization at each control interval. The local controller also regulates the VSD fan according to a set point temperature of 16 °C in the supply air. The local controller regulates the fresh air damper (FAD) and return air damper (RAD) using the same control logic as the original BMS which is described in the previous paper [17] . The MPC system for LT runs in a control server with a configuration of Intel i5-6200U CPU and 8 GB memory. 4.4 Experimental arrangement The weekly class schedule of LT during the test period is shown in Table 4 . There are 36.5 h of class time per week. The internal loads (occupancy and lighting loads) profile is assumed to repeat weekly. The ACMV system and lighting are turned on 30 min before the start of a class and turned off immediately after the class. Two test cases including (1) ACMV is controlled by its original BMS (‘BMS’ case) and (2) ACMV is controlled by the developed MPC (‘MPC’ case) were conducted in LT during August–September of 2019. The setup of the BMS is described in Section 4.1 and the research team also had not adjusted these default parameters in the BMS. Each test case ran for two weeks (consisting of 10 days with classes). The BMS case ran during 26th August–1st September 2019 and 16 th –22nd September 2019. The MPC case ran during 9th–15th September 2019 and 23rd–29th September 2019.\n\nMethods\n4.4 Experimental arrangement The weekly class schedule of LT during the test period is shown in Table 4 . There are 36.5 h of class time per week. The internal loads (occupancy and lighting loads) profile is assumed to repeat weekly. The ACMV system and lighting are turned on 30 min before the start of a class and turned off immediately after the class. Two test cases including (1) ACMV is controlled by its original BMS (‘BMS’ case) and (2) ACMV is controlled by the developed MPC (‘MPC’ case) were conducted in LT during August–September of 2019. The setup of the BMS is described in Section 4.1 and the research team also had not adjusted these default parameters in the BMS. Each test case ran for two weeks (consisting of 10 days with classes). The BMS case ran during 26th August–1st September 2019 and 16 th –22nd September 2019. The MPC case ran during 9th–15th September 2019 and 23rd–29th September 2019.\n\nResults\n5 Results To evaluate the control performance of the developed MPC systems, the test results of the MPC cases are compared to the baseline cases (thermostat case for the office testbed and BMS case for the LT testbed). The indoor thermal comfort performance is evaluated using the PMV index and the indoor PMV distributions of the MPC and baseline cases are compared. The energy performance is evaluated using the measured cooling power/energy of ACMV systems. 5.1 Test results of the office Fig. 9 shows the statistical distributions of indoor PMV and room air temperature measured during the office hours of the test period. The result is plotted in daily time series. The range from 5th percentile to 95th percentile as well as the median values are shown. Fig. 9 (a) shows that the median PMV was maintained very close to 0 (thermal neutrality) when MPC was used whereas the original thermostat control kept the median PMV negative at most of the time, suggesting better indoor thermal comfort achieved by the MPC as compared to the thermostat. During the morning start-up period (0800–0930 hrs), the thermostat control overcooled the office. This might be attributed to the reactive nature of the thermostat control, which allowed the morning cooling to overshoot. In contrast, the MPC cooled down the office smoothly to reach the desired comfort level without overshooting during the morning start-up period. The predictive capability of the MPC might have prevented the overshooting of cooling, bringing advantages in energy efficiency and occupant comfort. In addition, the distribution range of PMV is much narrower with the MPC than that with the thermostat. It suggests that occupants were subjected to much less fluctuation of thermal sensation during the day with MPC than they were with thermostat control. The corresponding statistical distributions of the measured indoor air temperature are shown in Fig. 9 (c) and (d). The measured room air temperature with the thermostat control is around 23.4 °C as the set point temperature of room air in the thermostat is 23 °C. The measured room air temperature with MPC is around 24 °C, which is the outcome of the MPC chasing the objectives (minimize the cooling energy consumed by ACMV systems and the offset between indoor PMV and thermal neutrality) defined by Eq. (2) , instead of a temperature set point. It echoes the observations from Fig. 9 (a) and (b). The distributions of indoor PMV, room air temperature measured during the office hours of the test period are also plotted as box-and-whisker diagrams in Fig. 10 . It shows that the median indoor PMV of the thermostat case is −0.09 with an interquartile range of (0.00, −0.20). In comparison, the median indoor PMV of the MPC case is 0.05 with a much narrower interquartile range of (0.01, 0.09). It suggests that the MPC provided better thermal comfort to the office by maintaining the PMV closer to thermal neutrality for most of the time than the thermostat control did. The MPC also reduced fluctuation of thermal sensation during office hours, compared to the thermostat. Fig. 11 shows the statistical distribution of measured cooling power in the two cases. The cooling power here refers to the sensible cooling power provided by the supply air from the VAV box to the office, as defined by Eq. (6) . The average cooling power reduces from 1.88 kW in the thermostat case to 0.78 kW in the MPC case, indicating that the MPC case consumed 58.5% less cooling energy than the thermostat case did. This energy saving is achieved by taking advantage of thermal comfort knowledge and model-based optimization feature of the MPC system to pursue thermal neutrality with minimum cooling energy consumption. The cooling power of the MPC case varies within a much narrower range (0–1.82 kW) than that of the thermostat case (0–6.30 kW), which echoes the observations that the MPC generally maintained more stable indoor conditions than the thermostat did. 5.2 Test results of LT Fig. 12 shows the statistical distributions of indoor PMV, room air temperature and cooling power measured during the class time of the test period. Fig. 12 (a) shows that the BMS control has tendency to overcool the lecture theatre as reflected by the fact that all measured PMV values in the BMS case are negative, with a median value of −0.38. 12% of the class time even goes below the comfort criteria of −0.5 in the BMS case. It indicates the deficiency of the reactive control employed by the BMS that tracks a single set point temperature of 24 °C. In comparison, the MPC significantly improves the thermal comfort by maintaining the PMV much closer to thermal neutrality, with a median value of 0.07. The MPC control maintained the PMV within the comfortable range (-0.5, 0.5) during all the class time. This could be attributed to thermal comfort optimization with a thermal comfort model described by Eq. (2) and Eq. (11) . Fig. 12 (b) shows that BMS kept room air temperature at a median valve of 24.13 °C, around the set point temperature (24 °C) of room air defined in the BMS. The average room air temperature of MPC case is 25.19 °C. The energy performance of the two cases is shown in Fig. 13 . Fig. 13 (a) shows the distributions of the cooling power provided by the AHU cooling coil, as defined by Eq. (9) . Cooling power is measured during the time when the ACMV system is on (class time + 30 min before class) by the thermal energy meter as indicated in Fig. 6 . It shows that the mean cooling power reduces from 32.06 kW in the BMS case to 22.33 kW in the MPC case, indicating cooling energy savings by the MPC as compared to the BMS. Based on the measured cooling power, the electricity consumed by the chiller is estimated with an assumed coefficient of performance (COP) value of 5.39 of the chiller, obtained based on the historical average from the BMS. The electricity consumption of the VAV fan in the AHU is measured by the electric power meter as indicated in Fig. 7 . Combining the estimated electricity consumption by the chiller (‘Cooling’) and the measured electricity consumption by the AHU Fan (‘Fan’), electricity consumption by the ACMV system is estimated. Fig. 13 (b) shows the average weekly ACMV electricity consumption of the two cases. The values in Fig. 13 (b) are averaged over the two-week test of each case. The MPC achieves 36.7% reduction of ACMV electricity consumption as compared to the BMS.\n\nResults\n5.1 Test results of the office Fig. 9 shows the statistical distributions of indoor PMV and room air temperature measured during the office hours of the test period. The result is plotted in daily time series. The range from 5th percentile to 95th percentile as well as the median values are shown. Fig. 9 (a) shows that the median PMV was maintained very close to 0 (thermal neutrality) when MPC was used whereas the original thermostat control kept the median PMV negative at most of the time, suggesting better indoor thermal comfort achieved by the MPC as compared to the thermostat. During the morning start-up period (0800–0930 hrs), the thermostat control overcooled the office. This might be attributed to the reactive nature of the thermostat control, which allowed the morning cooling to overshoot. In contrast, the MPC cooled down the office smoothly to reach the desired comfort level without overshooting during the morning start-up period. The predictive capability of the MPC might have prevented the overshooting of cooling, bringing advantages in energy efficiency and occupant comfort. In addition, the distribution range of PMV is much narrower with the MPC than that with the thermostat. It suggests that occupants were subjected to much less fluctuation of thermal sensation during the day with MPC than they were with thermostat control. The corresponding statistical distributions of the measured indoor air temperature are shown in Fig. 9 (c) and (d). The measured room air temperature with the thermostat control is around 23.4 °C as the set point temperature of room air in the thermostat is 23 °C. The measured room air temperature with MPC is around 24 °C, which is the outcome of the MPC chasing the objectives (minimize the cooling energy consumed by ACMV systems and the offset between indoor PMV and thermal neutrality) defined by Eq. (2) , instead of a temperature set point. It echoes the observations from Fig. 9 (a) and (b). The distributions of indoor PMV, room air temperature measured during the office hours of the test period are also plotted as box-and-whisker diagrams in Fig. 10 . It shows that the median indoor PMV of the thermostat case is −0.09 with an interquartile range of (0.00, −0.20). In comparison, the median indoor PMV of the MPC case is 0.05 with a much narrower interquartile range of (0.01, 0.09). It suggests that the MPC provided better thermal comfort to the office by maintaining the PMV closer to thermal neutrality for most of the time than the thermostat control did. The MPC also reduced fluctuation of thermal sensation during office hours, compared to the thermostat. Fig. 11 shows the statistical distribution of measured cooling power in the two cases. The cooling power here refers to the sensible cooling power provided by the supply air from the VAV box to the office, as defined by Eq. (6) . The average cooling power reduces from 1.88 kW in the thermostat case to 0.78 kW in the MPC case, indicating that the MPC case consumed 58.5% less cooling energy than the thermostat case did. This energy saving is achieved by taking advantage of thermal comfort knowledge and model-based optimization feature of the MPC system to pursue thermal neutrality with minimum cooling energy consumption. The cooling power of the MPC case varies within a much narrower range (0–1.82 kW) than that of the thermostat case (0–6.30 kW), which echoes the observations that the MPC generally maintained more stable indoor conditions than the thermostat did.\n\nResults\n5.2 Test results of LT Fig. 12 shows the statistical distributions of indoor PMV, room air temperature and cooling power measured during the class time of the test period. Fig. 12 (a) shows that the BMS control has tendency to overcool the lecture theatre as reflected by the fact that all measured PMV values in the BMS case are negative, with a median value of −0.38. 12% of the class time even goes below the comfort criteria of −0.5 in the BMS case. It indicates the deficiency of the reactive control employed by the BMS that tracks a single set point temperature of 24 °C. In comparison, the MPC significantly improves the thermal comfort by maintaining the PMV much closer to thermal neutrality, with a median value of 0.07. The MPC control maintained the PMV within the comfortable range (-0.5, 0.5) during all the class time. This could be attributed to thermal comfort optimization with a thermal comfort model described by Eq. (2) and Eq. (11) . Fig. 12 (b) shows that BMS kept room air temperature at a median valve of 24.13 °C, around the set point temperature (24 °C) of room air defined in the BMS. The average room air temperature of MPC case is 25.19 °C. The energy performance of the two cases is shown in Fig. 13 . Fig. 13 (a) shows the distributions of the cooling power provided by the AHU cooling coil, as defined by Eq. (9) . Cooling power is measured during the time when the ACMV system is on (class time + 30 min before class) by the thermal energy meter as indicated in Fig. 6 . It shows that the mean cooling power reduces from 32.06 kW in the BMS case to 22.33 kW in the MPC case, indicating cooling energy savings by the MPC as compared to the BMS. Based on the measured cooling power, the electricity consumed by the chiller is estimated with an assumed coefficient of performance (COP) value of 5.39 of the chiller, obtained based on the historical average from the BMS. The electricity consumption of the VAV fan in the AHU is measured by the electric power meter as indicated in Fig. 7 . Combining the estimated electricity consumption by the chiller (‘Cooling’) and the measured electricity consumption by the AHU Fan (‘Fan’), electricity consumption by the ACMV system is estimated. Fig. 13 (b) shows the average weekly ACMV electricity consumption of the two cases. The values in Fig. 13 (b) are averaged over the two-week test of each case. The MPC achieves 36.7% reduction of ACMV electricity consumption as compared to the BMS.\n\nConclusion\n7 Conclusion This paper presented the development, implementation, experimental testing and performance analysis of a proposed model predictive control system with an adaptive machine-learning-based building model for building automation and control applications. The system features an adaptive building dynamic modelling scheme that was developed using a dynamic artificial neural network with a nonlinear autoregressive exogenous structure and a fully automated process for model adaptation. The control performance of the system was experimentally evaluated in two testbeds, an office and a lecture theatre on the campus of NTU located in Singapore. The model predictive control system achieved 58.5% reduction of cooling energy in the office and 36.7% reduction of the electricity consumption of the air-conditioning system in the lecture theatre as compared to their original control. In parallel to the energy savings, the model predictive control system also significantly improved indoor thermal comfort by maintaining indoor conditions close to the thermal neutrality for most of the occupied time during the test periods in both testbeds, as compared to each testbed’s original control. The model adaptation feature greatly improves the prediction accuracy of the machine-learning-based building dynamics model, bringing benefits to the control performance of the model predictive control system. The prediction accuracy continues to improve as the volume of available building operation data for model adaption increases over time. This study has demonstrated that the machine-learning-based building dynamics model for model predictive control development can be constructed through fully automated processes. This makes the machine-learning-based modelling approach a favourable alternative to the conventional physics-based modelling approach in the implementation of model predictive control for existing buildings that are already operational.\n"
  }
}