{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nBuilding sensing technologies have evolved rapidly in the last two decades in aid of monitoring building environment and energy system performance. A series of occupancy sensing systems were developed to track the occupant behavior in the indoor space. Occupancy-based building system control is defined as a control method that adjusts the building system operation schedules and setpoints based on the measured occupant behavior and has been identified as a smart building control strategy that can improve building energy efficiency as well as occupant comfort. Some studies demonstrated energy-saving potential and comfort-maintaining capability from occupancy-based control. This study adopted a first-of-its-kind side-by-side experimental approach to quantify the performance of the occupancy-based control in commercial buildings. Three state-of-the-art occupancy sensing technologies were integrated into the real-time Heating, Ventilation, and Air-Conditioning (HVAC) system control in this study. Their detection accuracy and its effectiveness on energy-saving and thermal comfort were analyzed. It was found that the occupancy-based control can maintain good thermal comfort and perceived indoor air quality with a satisfaction ratio greater than 80%. Although the daily energy-saving varied with occupancy sensor accuracy and outdoor environment conditions, the weekly averaged energy saving was between 17 and 24%.\n\nMethods\n2 Methodology This study was done at the Total Indoor Environmental Quality (TIEQ) lab in Syracuse University (SU), New York (43.07° N, 76.07° W, Dfb climate type, ASHRAE climate zone 5A), from November to December of 2020 ( Fig. 7 ). The normal monthly mean temperature ranges from − 4.7 °C in January to 21.8 °C in July. A side-by-side building performance test approach was developed in this study ( Fig. 1 ). The study involved two rooms of the TIEQ lab. Each room is configured to be an open-plan office with a maximum occupancy of 12 people. Ten people were recruited to participate in this study and asked to work in one room (Test Lab). Three occupancy sensors were installed in this room to detect the occupancy level which will be used for OBC. The other room served as the Control Lab, where heating bulbs were used to simulate the same amount of heating from occupants as the Test Lab. The Control Lab is where the HVAC was controlled based on a fixed schedule. On the contrary, in the Test Lab, the temperature setpoint and ventilation rate were adjusted based on the occupant number that real-time measured by the occupancy sensor. Ground truth occupancy data were collected by button switches at the entrance and used to control the heating bulbs in the Control Lab. During the study, the temperature of the supply and return air of both rooms, the supply airflow rate, and the fan power were monitored for energy consumption analysis. The comfort feedback and preference on the indoor environment were collected during the test, and the energy consumptions of HVAC systems in both rooms were monitored at the same time. 2.1 Lab configuration The TIEQ lab includes two rooms side-by-side (Room 502 and 503), as shown in Fig. 2 a, to control environmental factors, including temperature, humidity, and air quality. The two rooms have the same dimension (36.0′ × 20.3′) and the same configuration as a typical open-floor office with 12 cubicles, as shown in Fig. 2 b&c. The lab is in the core zone of the floor with corridors and other rooms surrounding and ceiling exposed to the outdoor environment. TIEQ Lab is controlled by a Carrier Building Management System and is isolated from the rest of the building’s mechanical system. The temperature, relative humidity (RH), ventilation rate, CO 2 , illuminance level, and occupancy of each room are monitored or controlled by this system separately. In this study, both rooms were conditioned by an array of Carrier Air Treatment Modules (ATMs) placed under the floors of the two rooms ( Fig. 2 a). Each ATM has a cooling coil and a heating coil with its own fan to control the supplied air temperature and flow rate. A pair of dampers are placed upstream to control the ratio of outdoor air and return air. Each ATM can either serve an individually controlled cubicle or a group of cubicles and is designed to provide the heating/cooling and deliver 0–100% outdoor air to the room. The outdoor air is provided by a dedicated outdoor air (DOA) handler for filtering and preconditioning and can handle as large as 3400 m 3 /h outdoor air. The air from the ATM is supplied to each room through four underfloor air diffusers placed in the corridor and returned from the grilles located close to the suspended ceiling ( Fig. 2 d). Each room had been configured to have 5 Size 1 ATMs (2.8 kW, 350 m 3 /h) and 2 Size 2 large ATMs (4.1 kW, 500 m 3 /h). This study mapped the occupancy dynamics measured from Room 502 into Room 503. The two rooms were both assumed to be an open-plan office space with a maximum occupancy of 10 people. The occupancy in and out information in Room 502 was collected by a ground truth button recording system. Whenever people come in or leave the room, they were asked to press the button to record the real-time occupancy in the room. Infrared heating bulbs were used in this study to simulate the heat generated from the occupants. According to ASHRAE standard 55 [32] , the total heat generated from each occupant is around 100 W (seated), of which 70% is the sensible part. Assuming that the heat generation by a laptop is around 30 W, the total sensible heat generation by an occupant in the office is around 100 W. To simulate the occupants’ sensible heat generated in the room, ten heating bulbs were placed in Room 503 ( Fig. 3 b). With the information sent from the ground truth button, the same number of bulbs as the occupancy was turned on immediately so that the two rooms had the same occupancy sensible load dynamics. 2.2 People counting sensor installation and integration Three sensors were installed and tested in this study, including a depth sensor, a pressure-based sensor, and a Radio-Frequency Identification (RFID) sensor ( Fig. 4 ). Information about the sensors’ installation, calibration, integration, data collection, and underlying algorithms are presented in Table 1 . 2.3 Experiment setup and data acquisition Both the supply and return air temperature of the two rooms were monitored. In each room, four Type-T thermocouple sensors were used to measure the supply temperature from the four underfloor air diffusers in the corridor. Two more Type-T thermocouple sensors were placed in the return air vent to monitor the return air temperature. Two Campbell CR3000 dataloggers were used to collect the temperature reading from the thermocouples on a 1 min time frame. Since each room was served by seven ATMs, the energy consumed by all the ATMs had to be monitored to get the total energy consumptions under two control strategies. The energy consumption of the ATMs consisted of two parts: the power driving the fan and the cooling/heating energy conditioning the air. The fan is powered by a 230 V/50 Hz power supply, and this study used an ONSET EG4115 power meter to monitor the power consumption of each fan. The reading from the power meter was recorded on a 1 min time frame. Fig. 5 shows the diagram of the system integration for this study. The data collected from the occupancy sensors were sent to an API program written in Python either directly or via the cloud service. The API program was developed and tested before this study and served as the controller in the lab testing. Together with the room temperature, outdoor air temperature, and fan speed data collected from the ATMs (via the i-Vu system), the program determined the outdoor airflow intake as well as the heating/cooling temperature setpoint and sent the control signal back to the ATMs. The program read and save the occupancy data from the sensor and change the control of the ATM, including temperature setpoint and fan speed, accordingly every 30 mins. In addition, the room/supply/return air temperature measured in each room and the occupants’ feedback (see Sec. 2.4) on the thermal comfort and perceived air quality as well as the data collected by the API program were all saved in a database. 2.4 Subjects participation Ten participants were recruited for this study. They are all Syracuse University students and over 18 years of age with no reported health concerns. They were asked to come and do office work (1.1–1.3 met) in any of the cubicles (except Cubicle 1 and 10) in the lab for at least 4 h per day during regular office hours (7:00 am to 7:00 pm) and should not be out of the office for more than three continuous days. They were also asked to wear typical winter indoor clothing and trained to use the button switch to record their entering and exiting before the test started. There was a lunch break between 12:00 pm to 1:30 pm. During the lunch break, the participants could have their lunch in a dining area outside the room. Following Syracuse University’s COVID-19 policy, all the participants had to wear masks and maintain social distancing while working in the lab. The test had been approved by the Institutional Review Board (IRB) under the Approval 20–218 and the Return to Face-to-Face Research Approval entitled as Quantification of HVAC Energy Savings for Occupancy Sensing in Buildings Through an Innovative Testing Methodology . In order to collect the participant’s feedback on the thermal comfort and perceived air quality under the OBC, a survey was created in google form (Appendix I). The participants were asked to report their feedback and evaluation on thermal comfort and perceived air quality and their preference for the indoor environment as well as their clothing level (average clothing level 0.72 clo) at least twice a day, which had to be 30 min after entering the room and right before they left for home. They were also suggested to report anytime they felt uncomfortable during their stay in the room. Each survey typically takes less than 1 min to finish. Occupants’ thermal sensation and comfort were scaled based on ASHRAE’s seven-point thermal vote [32] , in which + 3 represents hot, 0 represents neutral, and −3 represents cold, and 4-point thermal comfort scale (1: very un-comfortable, 2: uncomfortable, 3: comfortable, 4: very comfortable) [33] . Occupants were also asked for their perception of the air quality based on a 9-point scale, in which −4 represents very bad, 0 represents just acceptable, and + 4 represents very good [34] . In addition, their preferences on the thermal environment and air quality were asked. 2.5 Control strategy Two control strategies, a baseline control and an occupancy-based control (OBC), were tested simultaneously and compared side-by-side in the two rooms of TIEQ in this study. The baseline control strategy was applied in Room 503 and controlled the HVAC system based on a pre-defined schedule, that the office was assumed to be fully occupied between 7:00 am and 7:00 pm. The OBC strategy was applied in Room 502 and controlled the HVAC system based on the actual measured occupancy number by the sensors. For the baseline control, during the occupied hour, the temperature setpoint was 23.3 ℃ (74.0 °F) with the heating setback at 20.0 ℃ (68.0°F), and the ventilation rate was held constant for maximum occupancy during the occupied hour. The OBC strategy had three modes: unoccupied mode, occupied mode, and standby mode ( Fig. 6 ); and two scenarios: temperature control and ventilation/outdoor air (OA) intake control. The unoccupied mode was when the whole building is assumed to be unoccupied (7:00 pm – 7:00 am next day); the occupied mode was activated when the room is occupied; the standby mode was activated when the room was temporarily unoccupied during the building occupied hour (7:00 am – 7:00 pm). The detailed control action of each scenario is explained in Table 2 . In this study, the combined temperature and ventilation control was conducted in the first three weeks, i.e. , one week for each sensor type. Then, Sensor B was tested for another two weeks , i.e., one week for each control scenario ( Fig. 7 ). During the test period, in both the baseline control room and OBC room, the lighting was turned on when the first people came and turned off when the last people left every day. The detailed control action of every week is shown in Table 2 . 2.6 Load and total energy consumption calculation As mentioned earlier, the energy consumption by the ATMs consists of two parts. The fan power was monitored by the ONSET meter, while the cooling/heating load was calculated based on the measurement on the air side. The basic equation for calculating the cooling/heating load is defined below: Q ̇ = m ̇ h 2 - h 1 = m ̇ ∙ c p ∙ T 2 - T 1 (1) A schematic of the airflows through each room is shown in Fig. 8 . The airflow rate is determined by the correlation between the fan speed and supply airflow rate and is used to calculate the cooling/heating load of the two rooms. The cooling/heating energy of the room, i.e. , space load or coil load, can be further split into outdoor air load (for conditioning the outdoor air to room temperature) and internal load or other load (for maintaining the room temperature at setpoint). These loads can be calculated using Eqn. 2, 3, and 4. (2) Coil l o a d = m ̇ sup c p T sup - T mix = m ̇ sup c p T sup - m ̇ ret T ret + m ̇ out T out m ̇ ret + m ̇ out = m ̇ sup c p T sup - c p m ̇ ret T ret + m ̇ out T out = m ̇ sup c p T sup - ( m ̇ sup - m ̇ out ) c p T ret + m ̇ out c p T out = m ̇ sup c p T sup - T ret + m ̇ out c p T ret - T out (3) Other l o a d = m ̇ sup c p T sup - T ret (4) Outdoor A i r L o a d = Q ̇ 0 = m ̇ out c p T ret - T out , when O t h e r l o a d > 0 Q ̇ 0 - O t h e r l o a d , when - Q ̇ 0 < O t h e r l o a d < 0 0 , when O t h e r l o a d < Q ̇ 0 < 0 Since the lab space is partially an internal space (only the ceiling is exposed to the outside), for most of the days, the internal load was heating in the morning and cooling in the afternoon. The outdoor air served as free cooling during the cooling period. In this case, the outdoor air load was determined as following (Eqn. 4): 1) When other load is positive (heating), outdoor air load is m ̇ out c p T ret - T out . 2) When other load is negative (cooling) and the absolute cooling load is less than the cooling that the outdoor air can provide, partial outdoor air is used as free cooling, and the outdoor air load is the energy needed for heating the remaining outdoor air. 3) When other load is negative (cooling) and the absolute cooling load is more than the cooling that the outdoor air can provide (free cooling provided by the outdoor air is not enough for cooling the room), all the outdoor air is used as free cooling, and the outdoor air load is 0.\n\nResults\n2.3 Experiment setup and data acquisition Both the supply and return air temperature of the two rooms were monitored. In each room, four Type-T thermocouple sensors were used to measure the supply temperature from the four underfloor air diffusers in the corridor. Two more Type-T thermocouple sensors were placed in the return air vent to monitor the return air temperature. Two Campbell CR3000 dataloggers were used to collect the temperature reading from the thermocouples on a 1 min time frame. Since each room was served by seven ATMs, the energy consumed by all the ATMs had to be monitored to get the total energy consumptions under two control strategies. The energy consumption of the ATMs consisted of two parts: the power driving the fan and the cooling/heating energy conditioning the air. The fan is powered by a 230 V/50 Hz power supply, and this study used an ONSET EG4115 power meter to monitor the power consumption of each fan. The reading from the power meter was recorded on a 1 min time frame. Fig. 5 shows the diagram of the system integration for this study. The data collected from the occupancy sensors were sent to an API program written in Python either directly or via the cloud service. The API program was developed and tested before this study and served as the controller in the lab testing. Together with the room temperature, outdoor air temperature, and fan speed data collected from the ATMs (via the i-Vu system), the program determined the outdoor airflow intake as well as the heating/cooling temperature setpoint and sent the control signal back to the ATMs. The program read and save the occupancy data from the sensor and change the control of the ATM, including temperature setpoint and fan speed, accordingly every 30 mins. In addition, the room/supply/return air temperature measured in each room and the occupants’ feedback (see Sec. 2.4) on the thermal comfort and perceived air quality as well as the data collected by the API program were all saved in a database.\n\nResults and Discussion\n3 Results and discussion 3.1 People counting sensor performance evaluation The occupancy information read by the sensor was recorded every 30 mins and compared with the ground truth recorded by the button switch. In this study, three sensors were tested, and they used two different logics to obtain the occupancy data. Two of them, Sensor A and Sensor B, obtain the occupancy in the room based on the measured entries and exits. Therefore, the error could accumulate if the sensor missed any entries or exits until the occupancy data was reset at midnight. The other one, Sensor C, measures the occupancy directly. The difference in the measurement logic results in two methods to evaluate the performance of the sensors: detection accuracy and system accuracy. Detectionaccuracy = numbesoftrialswhenthesensordetectsthechangecorrectly totalnumberofdetectiontrials × 100 % (5) Systemaccuracy = numbesoftrialswhenthedetectedoccupancyiscorrect totalnumberofdetectiontrials × 100 % (6) Fig. 9 illustrates the performance of the sensors during the five weeks test, during which Sensor A was tested for one week, Sensor B was tested for three weeks, and Sensor C was tested for one week. The averaged accuracies of the three sensors are summarized in Table 3 . Sensor A had the best detection and system accuracies, 99.16% and 76.12%, respectively, while Sensor C had the lowest ones, 33.76% and 33.76%. It should be noted that because Sensor C measured the occupancy directly, its detection accuracy equals the system accuracy. Observations during the test revealed that most of the errors of Sensor A and B were caused by simultaneous entering or exiting, especially during the lunch break. 3.2 Lab commissioning and energy balance test Before the main tests began, a lab commissioning study was done to make sure the two rooms of the TIEQ lab were working in the same manner, and all the sensors, meters, and data acquisition systems were working properly. During the commissioning, the two rooms were both under baseline control with the same internal heat gain and schedule. The fan energy consumption, fan speed, supply and return air temperature, and outdoor air temperature were monitored and recorded, and the coil load was calculated accordingly. Since the energy consumption of the primary system, chillers, and boilers, was not monitored, the energy used by them was calculated based on assumed cooling (3.0) and heating (0.8) coefficients of performance (COPs). Therefore, the total energy consumption used can be calculated as E = E fan + E cond = E fan + Q clg COP clg + Q htg COP htg (7) Fig. 10 illustrates the comparison of the fan power (a), total power (b), and total energy consumption (c) of the two rooms during the commissioning. A good agreement was achieved between the two rooms. The fan energy consumptions of the two rooms were 24.90kWh and 23.98kWh, the coil load or space load of the two rooms were 50.91kWh and 49.55kWh, and the total energy consumption of the two rooms were 88.54kWh and 85.91kWh. The results show that the total power follows the same trend, and the energy usage difference during the commission is within 3%. 3.3 HVAC Energy-saving by the occupancy-based control The daily energy-saving percentages during the five-week are presented in Fig. 11 . It was shown that the energy-saving varied between 0 and 35%. The averaged weekly energy savings in this study are 24.01%, 18.93%, 17.13%, 5.89%, and 16.74%. The occupancy-based temperature control gave minimal energy saving compared with the ventilation control. 3.3.1 Occupancy-based temperature/outdoor air (T/OA) control The first three weeks’ test was under occupancy-based temperature and ventilation control (OBC-1) with Sensor A. The total power of the baseline and OBC rooms were plotted in Fig. 12 . The plot clearly shows when the energy-saving happened. For most days, when the occupancy detection was correct, the energy was saved during three time periods, namely morning, lunch break, and afternoon. 1) In the morning, the baseline room system was turned on at 7:00 am, with the setpoint adjusted to 23.3℃ (74°F) and ventilation rate set on the maximum, while the OBC room was switched to the standby mode, with the setpoint adjusted to 21.7℃ (71°F) first and then 23.3℃ (74°F) when the room was detected occupied. The ventilation of the OBC room was not turned on until the room was occupied, and the ventilation rate was varied with the detected occupancy. One should note that before people came to the office, there was almost no internal heat gain. The baseline room relied on the HVAC system to heat the space all the way up to 23.3℃ (74°F), while the OBC room started to heat the space from 21.7℃ (71°F) to 23.3℃ (74°F) after people entered the room and brought in the internal heat gain ( i.e., heat from people, computers, and lighting). This caused even more energy-saving when the outdoor temperature rose in the morning. 2) During lunch time, since everybody left the room for lunch, the system in the OBC room was switched to standby mode, with both the fans for outdoor air and recirculation shut down and room naturally cooled down or heated up, and the energy consumption dropped to 0. 3) After all the people left the room in the late afternoon, the system in the OBC room was switched to standby mode again. Since the internal heat of both rooms was turned off, and the baseline room still had to maintain the room temperature at 23.3℃ (74°F), energy consumption by the baseline room surged up in most of the cases. When the occupancy detection failed, the failure might cancel the energy-saving because the system of the baseline room could not enter the standby mode when there was nobody in the room. For example, on Day 2, the occupancy sensor missed an exit count at the lunch break, which caused an overestimation of the occupancy until the end of the day. This overestimation canceled the energy-saving during lunchtime and in the late afternoon; on Day 9, the energy-saving during the lunch break was canceled by an error that happened at the beginning of the lunch break, but because it was corrected by another error at the end of the break, the energy saving in the late afternoon still existed; on Day 10 and the whole week using Sensor C, the error happened in the morning canceled both the energy savings of the lunch break and late afternoon. One should note that Sensor C requires frequent calibration for best performance. However, for building system occupancy-based control, frequent calibration is not realistic because, during the calibration, all of the people have to leave the room. In this test, only one calibration was done every day before the test started that day. Therefore, Sensor C worked less accurately than the other two. Furthermore, because Sensor C worked worse in rooms with high occupancy density, the sensor almost missed all the lunch breaks and early leave in the late afternoon. There is only one apparent energy-saving period found for all days during this week, which is in the morning before the room was occupied. 3.3.1.1 Single-day example with perfect occupancy detection In order to find out where the energy-saving came from when the occupancy detection worked perfectly, a single-day example is given in Fig. 13 . As per Eqn. 2, 3, 4, and 7, the total HVAC power primarily consists of two parts: fan energy and coil load. The coil load can be further split into outdoor air load and other load. Fig. 13 shows a very typical day when the occupancy sensor worked perfectly. It is illustrated that most of the fan energy-saving came from lunchtime and late afternoon when the OBC room relaxed the HVAC setpoints during the standby mode. Although a large amount of total energy was saved in the morning, once the system was on, no matter whether it was on standby heating or occupied heating, the fan power of the two rooms was very close. Since the test was done in late fall and early winter, the outdoor air temperature was always lower than indoor. Fig. 13 shows that the outdoor air load for the baseline room only happened in the early morning before people came, and almost no outdoor air load existed for the OBC room. This is because when people came, the room switched from heating to cooling due to the internal heat and rising outdoor temperature, i.e. , other load was negative (cooling) for the rest of the day. It was also shown that during lunchtime, the coil load of the OBC room dropped to 0 because the system was on standby mode. In the late afternoon, after all the participants left the room, although the fan in the baseline room was still on, other load in the room became neutral because the internal heat dropped to 0, and the outdoor temperature was around 21℃. 3.3.1.2 Single-day example with imperfect occupancy detection A single-day example of the fan energy, OA load, other load, and coil load, when the fan did not work perfectly, is plotted in Fig. 15 . Since during the example day, the occupancy sensor did not work perfectly, a comparison of the occupancy detected by Sensor C and the ground truth is shown in Fig. 14 . The first people came to the lab at 9:30 am, but the sensor did not report any occupancy until 10:30 am, which led to more energy-saving in the morning. Different from the previous cases shown for the first two weeks, the coil load of the OBC room did not show two peaks (one for preheating under standby mode, one for occupied heating when first occupied). After the first people came, the internal heat was turned on at 9:30 am before the temperature setpoint was changed to 23.3℃ (74.0°F). The internal heat load kind of preheated the space. Furthermore, as discussed before, since the sensor missed lunch break and early absence in the late afternoon, there was no noticeable saving at noon or in the late afternoon. 3.3.2 Occupancy-based temperature control The fourth week’s test was under occupancy-based temperature control (OBC-2) with Sensor B, i.e. , only the temperature setpoint was controlled based on the measured occupancy. The total power of the two rooms are plotted in Fig. 12 . Different from the second week, because the maximum ventilation was provided to the OBC room from 7:00 am to 7:00 pm, the energy-saving was not as significant as in the second week. Especially at lunch break and late afternoon, the HVAC power of the OBC room never dropped to 0 again. But since the temperature control was relaxed during the standby mode with the setback at 21.7℃ (71°F), there was still some energy saving in the morning, at lunch break, and in the late afternoon if the sensor detected the occupancy correctly. A single-day example of the fan energy, OA load, other load, and coil load was plotted in Fig. 17 . The day of the example has accurate sensor reading before 2:00 pm ( Fig. 16 ). Although the lunch break was successfully caught by the sensor, most of the energy-saving during the lunch break was due to the fan energy. The OA load almost followed the same trend. Most of the energy-saving came from the energy saving in the morning. In the late afternoon, although participants still left early, there was no energy-saving found due to the error in occupancy detection. 3.3.3 Occupancy-based OA control The fifth week’s test was under occupancy-based OA control with Sensor B, i.e. , only the ventilation rate was controlled based on the measured occupancy. The total power of the rooms with baseline control and OBC are plotted in Fig. 12 . Different from the second and fourth week, because the temperature was controlled at 23.3℃ (74.0°F) in the OBC room from 7:00 am to 7:00 pm, the energy-saving was primarily due to the saving in outdoor air load. Although energy savings were also found from the three time periods: morning, lunch break, and late afternoon, the energy-saving at lunch break and in the late afternoon was not that significant. This is because the outdoor air temperature in the morning was usually lower than during the noon and afternoon. A single-day example of the fan energy, OA load, other load, and coil load is plotted in Fig. 19 . The day plotted had the sensor reading incorrectly at lunch break ( Fig. 18 ), which was because the sensor missed exits count when people left the room for lunch and missed the same number of entries count after people came back. It was shown that the other load of both rooms was very similar, but most of the energy-saving came from the outdoor air load and the fan energy associated with the outdoor air. 3.4 Energy-saving v.s. Sensor performance The five-week test shows that the HVAC energy could be saved with the occupancy-based control. The energy-saving potential is highly dependent on the accuracy of the sensor because the occupancy sensor can help identify when the room needs to be conditioned and ventilated or not. If the sensor system worked perfectly, all the desired savings could be caught, but if the sensor worked inaccurately, some energy-saving opportunities might be missed. Fig. 20 illustrated the relationship between the daily energy-saving and the sensor system accuracy as well as the averaged outdoor air temperature. A triangular concave region was shown by a shadow region. It indicates that the higher the outdoor temperature is, the less accuracy the system can bear with for the same energy-saving potentials. The is because when outdoor air was hot, more energy was needed to condition the building, and the energy-saving potential was large. Even though the sensor was not working correctly all the time, we could still achieve significant energy savings. When the outdoor temperature was mild ( i.e., lower than the room air temperature but not low enough to call for heating from the HVAC system), the mild outdoor air could be used as free cooling in an air-side economizer mode. Such economizer modes caused less energy needed to condition the building and reduced the energy-saving potential by the OBC. Since this test was done in the late fall and early winter in Syracuse, NY, the weather was still mild, and the system mostly ran in a transition season mode. If the outdoor temperature keeps going down, we should be able to observe another triangular region, indicating that the colder the outdoor air, the less accuracy tolerable. However, one should note that the failure of the occupancy detection did not always cause less energy saving. As mentioned in Sec. 3.3.1, during the third week, Sensor C sometimes missed the first few occupants, which postponed the switch from the standby mode to the occupied mode. This failure caused an extended duration of the standby mode and caused more energy-saving than it should have. Furthermore, for the week tested with Sensor C, the occupancy rate in the room was always underestimated during the day, which means most of the time the supplied outdoor air was less than required. And it caused undesired energy-saving and explained why the less-accurate Sensor C did not result in less energy saving significantly. A minor objective of this study was to investigate whether the daily energy-saving can be predicted based on the system accuracy with some other quantity, such as outdoor air temperature. A standard two-layer feedforward neural network was used in this study for a function fitting, with a sigmoid transfer function in the hidden layer and a linear transfer function in the output layer [36] . Fifteen neurons were used in the hidden layer. The maximum epoch number is 1,000. Levenberg-Marquardt algorithm is used in the neural network for backpropagation because of its fast speed, although it requires more memory [37] . With the information that the energy-saving potential is related to the outdoor air temperature and system accuracy of the sensors, a two-layer neural network model was developed to help fast-predict the energy-saving potential ( Fig. 21 ). The model was trained using ten days’ outdoor temperature and system accuracy as the input and energy-savings as the target. The Levenberg-Marquardt algorithm is used for training. Three days’ data is used as the validation group, and two days’ data were used as the test group. The results show a good overall performance of the model (R 2 = 0.96795). 3.5 Thermal comfort and indoor air quality (IAQ) evaluation ASHRAE standard 55 [32] established the environmental conditions that are considered comfortable by at least 80% of occupants. However, depending on the clothing worn, activity levels, and other factors, the objective comfortable conditions may vary. The environmental survey is the most direct way to evaluate thermal comfort and perceived air quality. Most of the previous studies evaluated thermal comfort and IAQ based on measured physical quantities [27,38] , such as temperature and humidity, which may not be able to represent the real perception of the occupants. Even for the studies which included subjective surveys in their work, only one survey was taken for each session [39] , which might have missed the possible dynamic characteristics of the OBC. Totally 459 surveys were collected in the study. Fig. 22 illustrates the summary of the thermal sensation (a), thermal comfort (b), and perceived air quality (c) vote by the participants. In order to investigate how the initial stage (usually in the first 1 h after people came, the temperature was ramping up from standby setback to occupied setpoint) influenced the environment, the responses were split into two groups: morning group (referred to as AM) and afternoon group (referred to as PM). It was found that with the OBC, around 70% of responses reported neutral (0) thermal sensation. The histogram of the thermal sensation is almost symmetric, and no significant difference was observed between AM and PM (p greater than 0.1). The averaged thermal sensation vote is 0.06 with a standard deviation of 0.70. The thermal comfort response also shows a good result: around 70% of responses reported comfortable (1) and more than 90% of responses reported comfortable or slightly comfortable (2) responses, which is better than ASHRAE’s 80% criteria. No significant difference was found between AM and PM (p greater than 0.1). The averaged thermal comfort vote is 1.40, with a standard deviation of 0.65. Even more encouraging results were found for the perceived air quality. More than 95% of responses reported neutral or good air quality (≥0). Still, no significant difference was found between AM and PM (p greater than 0.1). However, the AM group reported more “Good” (4) responses than the PM group, which might be because the air temperature during the initial stage was usually cooler than the setpoint and cool air was perceived as “fresh” and “more pleasant” than warm air [40] . The average perceived air quality vote is 2.01, with a standard deviation of 1.60. A further analysis was done to look into the group of responses that reported uncomfortable or bad perceived air quality. Totally 24 uncomfortable responses were reported. Within these responses, 8 of them reported neutral thermal sensation and no need to change. Within the other 16 responses, 9 preferred a cooler environment, and 7 preferred warmer. Only 3 (18.8%) happened in the morning, which also confirmed the previous conclusion that the initial stage of the OBC did not impose negative effects on people’s thermal comfort. Notably, all of these 16 responses came from the subjects sitting close to the end walls of the room (in Cubicle 2, 3, 4, and 11), which might be due to the uneven temperature in the room. 15 responses reported bad perceived air quality. 5 of them happened when the sensor undercounted the occupancy, but 4 of them happened when the sensor overcounted the occupancy. What is more interesting is that during the third week, when Sensor C undercounted the occupancy for most of the time, nobody reported bad perceived air quality. This is probably because the perceived air quality can be affected by various factors other than ventilation rates, such as air temperature and humidity. Furthermore, among these 15 responses, 10 came from the subjects sitting close to the end wall (Cubicle 2, 3, 11, 12), which might imply not enough fresh air to these cubicles; 5 came from the same cubicle in the middle of the room (Cubicle 8), which is presumably because a local stagnation zone might present in this cubicle. However, this evidence can help us confirm the previous observation that OBC did not significantly reduce the perceived air quality, which affects people’s work performance [41,42] .\n\nResults\n3.1 People counting sensor performance evaluation The occupancy information read by the sensor was recorded every 30 mins and compared with the ground truth recorded by the button switch. In this study, three sensors were tested, and they used two different logics to obtain the occupancy data. Two of them, Sensor A and Sensor B, obtain the occupancy in the room based on the measured entries and exits. Therefore, the error could accumulate if the sensor missed any entries or exits until the occupancy data was reset at midnight. The other one, Sensor C, measures the occupancy directly. The difference in the measurement logic results in two methods to evaluate the performance of the sensors: detection accuracy and system accuracy. Detectionaccuracy = numbesoftrialswhenthesensordetectsthechangecorrectly totalnumberofdetectiontrials × 100 % (5) Systemaccuracy = numbesoftrialswhenthedetectedoccupancyiscorrect totalnumberofdetectiontrials × 100 % (6) Fig. 9 illustrates the performance of the sensors during the five weeks test, during which Sensor A was tested for one week, Sensor B was tested for three weeks, and Sensor C was tested for one week. The averaged accuracies of the three sensors are summarized in Table 3 . Sensor A had the best detection and system accuracies, 99.16% and 76.12%, respectively, while Sensor C had the lowest ones, 33.76% and 33.76%. It should be noted that because Sensor C measured the occupancy directly, its detection accuracy equals the system accuracy. Observations during the test revealed that most of the errors of Sensor A and B were caused by simultaneous entering or exiting, especially during the lunch break.\n\nResults\n3.4 Energy-saving v.s. Sensor performance The five-week test shows that the HVAC energy could be saved with the occupancy-based control. The energy-saving potential is highly dependent on the accuracy of the sensor because the occupancy sensor can help identify when the room needs to be conditioned and ventilated or not. If the sensor system worked perfectly, all the desired savings could be caught, but if the sensor worked inaccurately, some energy-saving opportunities might be missed. Fig. 20 illustrated the relationship between the daily energy-saving and the sensor system accuracy as well as the averaged outdoor air temperature. A triangular concave region was shown by a shadow region. It indicates that the higher the outdoor temperature is, the less accuracy the system can bear with for the same energy-saving potentials. The is because when outdoor air was hot, more energy was needed to condition the building, and the energy-saving potential was large. Even though the sensor was not working correctly all the time, we could still achieve significant energy savings. When the outdoor temperature was mild ( i.e., lower than the room air temperature but not low enough to call for heating from the HVAC system), the mild outdoor air could be used as free cooling in an air-side economizer mode. Such economizer modes caused less energy needed to condition the building and reduced the energy-saving potential by the OBC. Since this test was done in the late fall and early winter in Syracuse, NY, the weather was still mild, and the system mostly ran in a transition season mode. If the outdoor temperature keeps going down, we should be able to observe another triangular region, indicating that the colder the outdoor air, the less accuracy tolerable. However, one should note that the failure of the occupancy detection did not always cause less energy saving. As mentioned in Sec. 3.3.1, during the third week, Sensor C sometimes missed the first few occupants, which postponed the switch from the standby mode to the occupied mode. This failure caused an extended duration of the standby mode and caused more energy-saving than it should have. Furthermore, for the week tested with Sensor C, the occupancy rate in the room was always underestimated during the day, which means most of the time the supplied outdoor air was less than required. And it caused undesired energy-saving and explained why the less-accurate Sensor C did not result in less energy saving significantly. A minor objective of this study was to investigate whether the daily energy-saving can be predicted based on the system accuracy with some other quantity, such as outdoor air temperature. A standard two-layer feedforward neural network was used in this study for a function fitting, with a sigmoid transfer function in the hidden layer and a linear transfer function in the output layer [36] . Fifteen neurons were used in the hidden layer. The maximum epoch number is 1,000. Levenberg-Marquardt algorithm is used in the neural network for backpropagation because of its fast speed, although it requires more memory [37] . With the information that the energy-saving potential is related to the outdoor air temperature and system accuracy of the sensors, a two-layer neural network model was developed to help fast-predict the energy-saving potential ( Fig. 21 ). The model was trained using ten days’ outdoor temperature and system accuracy as the input and energy-savings as the target. The Levenberg-Marquardt algorithm is used for training. Three days’ data is used as the validation group, and two days’ data were used as the test group. The results show a good overall performance of the model (R 2 = 0.96795).\n\nResults\n3.5 Thermal comfort and indoor air quality (IAQ) evaluation ASHRAE standard 55 [32] established the environmental conditions that are considered comfortable by at least 80% of occupants. However, depending on the clothing worn, activity levels, and other factors, the objective comfortable conditions may vary. The environmental survey is the most direct way to evaluate thermal comfort and perceived air quality. Most of the previous studies evaluated thermal comfort and IAQ based on measured physical quantities [27,38] , such as temperature and humidity, which may not be able to represent the real perception of the occupants. Even for the studies which included subjective surveys in their work, only one survey was taken for each session [39] , which might have missed the possible dynamic characteristics of the OBC. Totally 459 surveys were collected in the study. Fig. 22 illustrates the summary of the thermal sensation (a), thermal comfort (b), and perceived air quality (c) vote by the participants. In order to investigate how the initial stage (usually in the first 1 h after people came, the temperature was ramping up from standby setback to occupied setpoint) influenced the environment, the responses were split into two groups: morning group (referred to as AM) and afternoon group (referred to as PM). It was found that with the OBC, around 70% of responses reported neutral (0) thermal sensation. The histogram of the thermal sensation is almost symmetric, and no significant difference was observed between AM and PM (p greater than 0.1). The averaged thermal sensation vote is 0.06 with a standard deviation of 0.70. The thermal comfort response also shows a good result: around 70% of responses reported comfortable (1) and more than 90% of responses reported comfortable or slightly comfortable (2) responses, which is better than ASHRAE’s 80% criteria. No significant difference was found between AM and PM (p greater than 0.1). The averaged thermal comfort vote is 1.40, with a standard deviation of 0.65. Even more encouraging results were found for the perceived air quality. More than 95% of responses reported neutral or good air quality (≥0). Still, no significant difference was found between AM and PM (p greater than 0.1). However, the AM group reported more “Good” (4) responses than the PM group, which might be because the air temperature during the initial stage was usually cooler than the setpoint and cool air was perceived as “fresh” and “more pleasant” than warm air [40] . The average perceived air quality vote is 2.01, with a standard deviation of 1.60. A further analysis was done to look into the group of responses that reported uncomfortable or bad perceived air quality. Totally 24 uncomfortable responses were reported. Within these responses, 8 of them reported neutral thermal sensation and no need to change. Within the other 16 responses, 9 preferred a cooler environment, and 7 preferred warmer. Only 3 (18.8%) happened in the morning, which also confirmed the previous conclusion that the initial stage of the OBC did not impose negative effects on people’s thermal comfort. Notably, all of these 16 responses came from the subjects sitting close to the end walls of the room (in Cubicle 2, 3, 4, and 11), which might be due to the uneven temperature in the room. 15 responses reported bad perceived air quality. 5 of them happened when the sensor undercounted the occupancy, but 4 of them happened when the sensor overcounted the occupancy. What is more interesting is that during the third week, when Sensor C undercounted the occupancy for most of the time, nobody reported bad perceived air quality. This is probably because the perceived air quality can be affected by various factors other than ventilation rates, such as air temperature and humidity. Furthermore, among these 15 responses, 10 came from the subjects sitting close to the end wall (Cubicle 2, 3, 11, 12), which might imply not enough fresh air to these cubicles; 5 came from the same cubicle in the middle of the room (Cubicle 8), which is presumably because a local stagnation zone might present in this cubicle. However, this evidence can help us confirm the previous observation that OBC did not significantly reduce the perceived air quality, which affects people’s work performance [41,42] .\n\nConclusion\n4 Conclusion and limitations The performance of the occupancy-based control was tested in this study using side-by-side rooms configured as typical open-plan offices. One room was set as the baseline case with the fixed schedule control, while the other room was controlled by occupancy counting sensors. Three sensors of different technologies were tested individually in this study. The complete occupancy-based control, both temperature and ventilation rate were controlled based on the occupancy, occupancy-based temperature control, and occupancy-based ventilation control were tested. The supply and return air temperature, outdoor air temperature, and fan speed and power were monitored and recorded for calculating the heating and cooling load and total energy consumption. The accuracy of the occupancy sensors was compared against the ground truth and correlated with the energy-saving potential by occupancy-based control. The occupant’s feedback on the environment by occupancy-based control was surveyed to demonstrate its comfort-maintaining capability. Occupancy sensors of different technologies perform differently in occupancy-based control applications. The accuracy varied between 5% and 100% compared with the ground truth. By using two side-by-side energy-balanced rooms, the real energy savings by occupancy-based control were quantified. The results have shown that with occupancy sensors of different levels of accuracy, the daily energy-saving by the occupancy-based control varied from 0% to 35%, depending on the weather and sensor accuracy. The occupancy-based temperature control gave minimal energy saving compared with the ventilation control. A correlation between the daily energy-saving and system accuracy as well as the outdoor temperature was found in this study. It could be represented using a two-layer neural network model. The relationship could be generally interpreted as the higher the outdoor temperature was, the less accuracy the system could bear with for energy savings, with in mind that the continuously lower occupancy detection may cause undesired energy savings. The thermal comfort level and perceived indoor air quality both far achieved the 80% comfort criteria under the occupancy-based control. No significant discomfort was observed during the initial startup stage in the morning. The findings from this study confirm the real-time and real-world energy-saving potential by occupancy-based HVAC control in a side-by-side experimental comparison. The results indicate, on the one hand, how much energy can be saved by the occupancy-based control and, on the other hand, when these energy savings happen. Furthermore, the effect of the occupancy sensor accuracy on energy saving was demonstrated, and this information can be used to guide the application of the occupancy sensing technologies in occupancy-based HVAC control, i.e. , how accurate the sensor needs to be for significant energy savings and what the most challenging situation is during the daily usage. In addition, the study also confirms the occupancy-based control will not sacrifice occupants’ comfort while saving energy. Last but not least, the study can also help the sensor developers to improve the sensor structure and data analysis algorithm for better performance under challenging situations, e.g. , when multiple occupants enter or leave the room simultaneously. The limitations of this study include: (1) This study was conducted for five weeks, with each scenario tested for only one week. Long-term data will make our conclusion, energy savings by occupancy-based control and its relationship with occupancy detection accuracy, more convincing; (2) This study should cover all the seasons for the best conclusion, but the experiment was conducted mostly in the late fall and early winter when the outdoor condition was still mild. Energy savings under hot and cold outdoor conditions should give us more confidence in the application of occupancy-based control; (3) The climate zone and building type will affect the selection of the energy source and the energy performance of the heating, ventilation, and air-conditioning system, and therefore the energy-saving potential by occupancy-based control. Similar studies should be conducted at different climate zones and for different building types to generalize the results; (4) The heating, ventilation, and air-conditioning system used in this study, a series of air treatment modules with a dedicated outdoor air system, is unique, which may have affected the energy-saving. More commonly used systems, such as a variable air volume and a fan-coil system, should be tested in the future; (5) This study was conducted at a room level, which was mostly an internal zone with only ceilings exposed to the outside. Although it is more difficult or even impossible to do a side-by-side comparison for a zone-level or building-level study, one should note that the integration of occupancy-based control in the zone-level and the building-level control is more complex and may yield different results.\n"
  }
}