{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nThe Energy Performance Gap (EPG) in buildings is a recognized phenomenon. However, its definition and underlying factors are extensive, necessitating a thorough investigation of the quantitative impact of each factor contributing to the EPG. In this research, a calibration-based approach is employed to identify and measure the contribution of these factors. Questionnaires, measurements, analyses, and calibrations are conducted on the energy performance of four residential units of an apartment block building in Iran as a case study. Subsequently, the impact rates of three key causes of the EPG, namely heating system efficiency, weather data in an EnergyPlus Weather (EPW) format file, and occupant behavior, are determined. By incorporating these causes into the model calibration process, the disparities between the design and operation stages are decreased. The study highlights the significance and quantifiable effects of accurate and measured boiler efficiency, utilizing a genuine EPW file rather than a convenient EPW file e.g., airport stations, and adopting precise and adaptable assumptions for occupant behavior modeling in bridging the EPG between the design and operation stages. There are a number of factors that impact the design stage gap, including boiler efficiency, occupant behavior, and a corrected EPW file, which contribute 43.9%, 26%, and 6.6%, respectively.\n\nMethods\n3 Methodology In this research, the impact of technical issues, occupant behavior, and the EnergyPlus® Weather (EPW) file on reducing the Energy Performance Gap (EPG) associated with the design stage was investigated in a four-story residential building. As Fig. 1 illustrates, this study has five steps. Initially, the design data of case studies including building envelope, heating system details, and ASHRAE assumptions for the design stage were collected. The second step contains actual data collected from the field. In this step, a questionnaire was used to obtain the occupants' usage patterns and behavior, and the real heating system’s efficiency. Also, indoor and outdoor temperatures and monthly gas bills from September 2022 to March 2023 were collected. The real EPW file and the operational heating consumption are the outcomes of this step. After that, in Step 3, the heating gas consumption in the design stage is predicted using the ASHRAE standard [63] and the design data from Step 1, the real EPW file, and the real heating system's efficiency from Step 2. In Step 4 a calibrated model is simulated for each case by using Step 2 data. Also, calibrated models with questionnaire data were validated using ASHRAE Guideline 14 [70] . Finally, the impact of the occupant behavior, the heating system's efficiency as a technical issue, and the EPW file on the EPG are obtained. 3.1 Case study The case study in this research consists of four residential units located within an apartment block building in Mashhad, Iran, as shown in Fig. 2 a. In these cases, gas is used for cooking and heating, while electricity is used for cooling. Fig. 2 b presents a 3D model of the building created in DesignBuilder, and Fig. 2 c displays the floor plans of each case study. According to ASHRAE [71] climate classification, Mashhad city is in the 4B category which indicates mixed dry weather. Table 4 shows building physics, occupants’ data, and HVAC system information of the case study. Each floor has a wall-mounted heating system (its nominal capacity is 25.7 kW) inside. Heating systems in this study are almost identical, same model (M24FF) by the same manufacturer. This model has two converters and a fan for smoke and exhaust gas. These boilers were installed on all four floors at the same time. The boiler has two coils, one for domestic hot water and the other for the space heating system. In space heating, the water enters the boiler and after heating it is transferred to the radiators in each zone of the house through the pipes. In terms of domestic hot water, the water enters the boiler, and after heating it is transferred to the faucets. 3.2 Data collection The building envelope data and technical specifications of the building systems were obtained from the case study’s design documents. To collect actual operational details, questionnaires were distributed and collected from the occupants. The questionnaire is provided in Appendix A. In addition, hourly indoor temperatures of the living room on each floor and outdoor weather data were measured using the Ambient Weather WS-2000 device. Gas consumption data were collected through metered energy. In this research, we intend to investigate the amount of heating gas gap. Since the gas meter in the case study is singular per residence, the gas bill includes gas usage for domestic hot water, cooking, and space heating purposes. In order to isolate the space heating gas consumption for our investigation, the average summer gas consumption was subtracted from the autumn bills (when the space heating system is on) for the studied period, based on the assumption that hot meals and beverages are consumed more in cold seasons. According to Fuentes et al., [72] and Gerin et al., [73] , the amount of hot water used by occupants in the winter is almost 125 % higher than in the summer season. In addition, according to Tanaka et al., [74] the gas for cooking in the winter is almost 125 % higher than in the summer. Therefore, to estimate the heating gas consumption, 1.25 times the average summer gas consumption was deducted from the winter gas bills. In this way, a more accurate estimation of the gas used for heating in each case was obtained. The questionnaire was necessary to simulate heating consumption and assess occupants' awareness of their own behavior. Occupants may not be accurate regarding their energy behavior [75] , therefore occupants' lack of awareness is a factor in operational stage’s gap. It consisted of four parts: (a) Occupancy schedule, (b) Hours and months of HVAC system usage, (c) Hours of use for lighting facilities and power ratings of lamps, and (d) The timetable of cooking and usage of electrical equipment along with their power. Occupants were also asked questions about the heating setpoint. However, they did not provide accurate responses regarding the setpoint of their house, so in order to measure the setpoint on each floor, the Ambient Weather WS-2000 device was used, and the data was used to calculate the gap due to occupant behavior. Our approach involved using indoor temperature measurements to indirectly estimate the approximate heating setpoint for each floor. We utilized the actual temperature data from the indoor environment to infer this information. This indirect approach was chosen as it allowed us to gather valuable data leading to a more comprehensive and less intrusive data collection process. The outdoor weather data was used to generate an actual EPW file, while the indoor temperature measurements were employed to validate the simulation results and estimate the approximate heating setpoint for each floor. 3.3 Heating gas simulation To comprehensively investigate the Energy Performance Gap (EPG) concerning heating gas, a comparative analysis between the operational stage (bills), the as-designed stage (based on ASHRAE standards), and simulations based on questionnaire responses was conducted. The focused was on three significant causes of EPG and explored potential reduction strategies. The parameters examined were technical issues, occupant behavior, and the EPW file. Hourly weather data for the designated period were collected using the Ambient Weather WS-2000 device, and an EPW file was generated based on the recorded data. The heating setpoint was determined by monitoring indoor temperature. Occupant behavior, including occupancy schedules, was obtained through questionnaires. In Section 2.2 , the importance of boiler efficiency as a technical issue affecting heating consumption is investigated. Therefore, the accurate efficiency of a gas-fired system is measured and the calculations are summarized in Section 4.2 . For the design stage, three simulations were conducted: the first using ASHRAE assumptions with the Airport EPW file, the second using ASHRAE assumptions with the actual EPW file, and the last considering ASHRAE assumptions with the actual EPW file and a 56 % boiler efficiency (the two previous were with 89 % efficiency). Regarding the questionnaire, the simulation was with the assumptions collected from occupants with a 56 % boiler efficiency, which is consistent with the finding reported by other researchers [76] . Finally, the results of heating gas consumption were compared for the studied time period. 3.4 EnergyPlus weather (EPW) file To collect outdoor weather data at the site, the Ambient Weather WS-2000 device was implemented. This device has two instruments, for indoor and outdoor data collection. Fig. 3 a shows this device when it was installed on the roof to collect outdoor weather data, and Fig. 3 b shows the indoor humidity and temperature collecting device. The following factors of outdoor weather are collected through this device: outdoor dry bulb (°F) with an accuracy of ± 2°F, dew point (°F), outdoor humidity with ± 5 % accuracy, barometric pressure (inHg) with an accuracy of 0.08 inHg, solar radiation (w/m2), wind direction with an accuracy of ± 10°, wind speed (mph) with an accuracy of ± 2.2 mph and hourly rain (in.) with an accuracy of ± 5 %. The remaining factors needed in EPW files which are mainly regional and do not vary much at short distances are extracted from the Mashhad Airport EPW, which is accessible freely from the Climate One Building website [77] .The outdoor data are collected hourly from October 2022 to March 2023. The Ambient Weather WS-2000 device data was exported in CSV format. To create the EPW file, the Elements Software [78] convert CSV to EPW format.\n\nMethods\n3.2 Data collection The building envelope data and technical specifications of the building systems were obtained from the case study’s design documents. To collect actual operational details, questionnaires were distributed and collected from the occupants. The questionnaire is provided in Appendix A. In addition, hourly indoor temperatures of the living room on each floor and outdoor weather data were measured using the Ambient Weather WS-2000 device. Gas consumption data were collected through metered energy. In this research, we intend to investigate the amount of heating gas gap. Since the gas meter in the case study is singular per residence, the gas bill includes gas usage for domestic hot water, cooking, and space heating purposes. In order to isolate the space heating gas consumption for our investigation, the average summer gas consumption was subtracted from the autumn bills (when the space heating system is on) for the studied period, based on the assumption that hot meals and beverages are consumed more in cold seasons. According to Fuentes et al., [72] and Gerin et al., [73] , the amount of hot water used by occupants in the winter is almost 125 % higher than in the summer season. In addition, according to Tanaka et al., [74] the gas for cooking in the winter is almost 125 % higher than in the summer. Therefore, to estimate the heating gas consumption, 1.25 times the average summer gas consumption was deducted from the winter gas bills. In this way, a more accurate estimation of the gas used for heating in each case was obtained. The questionnaire was necessary to simulate heating consumption and assess occupants' awareness of their own behavior. Occupants may not be accurate regarding their energy behavior [75] , therefore occupants' lack of awareness is a factor in operational stage’s gap. It consisted of four parts: (a) Occupancy schedule, (b) Hours and months of HVAC system usage, (c) Hours of use for lighting facilities and power ratings of lamps, and (d) The timetable of cooking and usage of electrical equipment along with their power. Occupants were also asked questions about the heating setpoint. However, they did not provide accurate responses regarding the setpoint of their house, so in order to measure the setpoint on each floor, the Ambient Weather WS-2000 device was used, and the data was used to calculate the gap due to occupant behavior. Our approach involved using indoor temperature measurements to indirectly estimate the approximate heating setpoint for each floor. We utilized the actual temperature data from the indoor environment to infer this information. This indirect approach was chosen as it allowed us to gather valuable data leading to a more comprehensive and less intrusive data collection process. The outdoor weather data was used to generate an actual EPW file, while the indoor temperature measurements were employed to validate the simulation results and estimate the approximate heating setpoint for each floor.\n\nResults and Discussion\n4 Results and discussion In this research, the investigation of the Energy Performance Gap (EPG) involved comparing three energy consumption results: actual energy consumption, simulated energy consumption based on occupants' behavior, and simulated energy consumption based on the ASHRAE standard. The causes and solutions of EPG at both the design and operation stages were examined through a case study of four residential apartments. The effect of three significant causes of EPG was examined: occupant behavior, the EPW file, and technical issues. 4.1 Evaluation of field research The analysis of questionnaires collected from occupants of the four case studies revealed that approximately 75 % of them utilized the heating system from October to March and 25 % from October to April. Moreover, all occupants reported that the heating system is always turned on during cold days. This finding indicates that thermal comfort is the occupants' priority, not optimal energy consumption. Using questionnaires, it has been determined that occupants of the 4th floor reduce the radiator's setpoint from around 11 am to 2 pm in order to maintain thermal comfort. However, the occupants were unable to provide precise information about hourly boiler temperature adjustments, as they are influenced by outside temperature and behavioral factors. Analysis of the occupants' operation schedules based on the questionnaires revealed that in weekdays, 35 % of occupants spend 3 h, 14 % spend 13 h, and 21 % spend 9 h outside. Furthermore, 30 % of occupants typically spend most of their time at home. On weekends, 58 % of occupants spend 7 h, 21 % spend 3 h and 21 % spend 16 h outside. The occupants' operation schedules based on the questionnaires also indicate that the occupants' age and occupation have an impact on the pattern of operation schedules. Fig. 4 illustrates the gas utilities for each apartment unit over the past three years. The examination of gas consumption data from the bills indicates that the highest gas consumption in the investigated case studies occurred during the cold months, primarily due to the use of the heating system. Conversely, the lowest gas consumption was observed during the summer season, attributed to hot water and cooking. Specifically, the highest gas consumption was recorded in December and January. However, in order to investigate the heating energy performance gap, this study focused on the period from October 2022 to March 2023. This particular period was selected because it offered comprehensive and reliable data regarding occupant behavior and weather conditions (the EPW file). 4.2 The efficiency of gas-fired boiler The boiler efficiency is effective on the simulated energy consumption in the design stage and the resulting gap as mentioned in Section 2.2 . Ibrahim and Al-Qassimi [79] provided the calculation formula for the boiler efficiency. To use this formula, some parameters should be measured to obtain loss fractions. The measured parameters and loss fractions are listed in Table 5 . Considering that the boilers used in the case study building have the same specifications, only the parameters of the fourth-floor boiler have been measured. The thermal efficiency can be calculated by subtracting the heat loss fractions from 100. So, the overall efficiency of the boiler is calculated to be 56 % instead of 89 %, which is mentioned in the manufacturer’s catalog. (1) Gas - f i r e d b o i l e r e f f i c i e n c y = 100 - L 1 + L 2 + L 3 + L 4 + L 5 + L 6 = 56 % The observed 33 % reduction in boiler efficiency is indeed noteworthy and may raise questions about the potential root causes. To address this concern, we offer the following insights: 1. Operational Factors: The reduction in boiler efficiency may be attributed to various operational factors, such as suboptimal maintenance practices, incorrect fuel type or quality (gas BTU in winter during peak demand might not be the same as in summer), improper combustion settings, variations in load profiles during the study period, burner settings, control system calibration, or water treatment. Investigating the specific operational conditions during the measurement period is essential. We cannot measure the quality of the incoming gas and we can only measure the efficiency of the boiler. On the other hand, claiming gas BTU variation, need substantial support as it will have considerable legal and political consequences. 2. Manufacturers' Reported Efficiency: Manufacturers typically report boiler efficiencies under ideal or standardized conditions, which may not reflect real-world operating conditions. These standard conditions often assume optimal combustion, load, and other factors that can differ from actual usage. 3. Maintenance and Cleanliness: Boiler efficiency can degrade over time due to the accumulation of soot, scale, or other deposits. Differences in maintenance practices or cleanliness might contribute to the lower efficiency observed. 4. Boiler Sizing: The boiler's capacity might not align perfectly with the actual load requirements, leading to less efficient operation. 5. System Integration: The efficiency of the entire heating system, including distribution and control components, can affect the overall observed boiler efficiency 4.3 Heating gap The results of the questionnaire simulations provide insights into occupants' behavior and their level of knowledge regarding energy usage. Simulations based on ASHRAE assumptions [63] are considered representative of the design stage, while gas consumption for heating, as indicated in the bills, represents the operational stage. Fig. 5 illustrates each floor's heating gas consumption from October 2022 to March 2023, comparing data from bills, questionnaire simulations, and ASHRAE simulations. This allows for an investigation of the impact of selected causes of the Energy Performance Gap (EPG). In Mashhad, heating systems are typically on from October 2022 to March 2023. Therefore, this period is selected for investigating the heating performance gap in this study. For this investigation, four simulations were conducted. Firstly, the energy consumption in the design stage according to the ASHRAE standard is simulated with the Airport EPW file and the boiler efficiency which is mentioned in its manufacturer’s catalog. The second simulation is the design stage which is affected by the actual boiler efficiency. The third simulation is the design stage simulation affected by the actual boiler efficiency and real EPW file. So far, the impacts of two factors on the design stage have been considered. Through the questionnaire, user behaviors that affect energy consumption such as occupancy schedule and indoor setpoints have been collected. Therefore, the fourth simulation is the questionnaire simulation with the actual boiler efficiency and the real EPW file. In this simulation, the impact of the third factor, occupant behavior, is considered. From Fig. 5 , the difference between the first and second simulations shows the effect of the boiler efficiency on the EPG; which is referred to as the “gap due to heating system efficiency”. The difference between the second and third simulations shows the effect of the EPW file on the EPG; which is referred to as the “gap due to the EPW file”. The difference between occupants' behavior (fourth simulation) and the assumptions made by the standard (third simulation) shows the effect of occupant behavior on the EPG and is termed the “gap due to occupant behavior”. The “design stage's gap” represents the disparity between actual energy consumption (as indicated in the bills) and predicted energy usage during the design stage (first simulation). The “operational stage's gap” is related to bills and the fourth simulation, and encompasses other technical issues such as U-values and occupants' lack of awareness [75] regarding their behavior. The assumptions for energy modeling based on ASHRAE are the same for all case studies, and the second and third floors have the same physical characteristics and adiabaticity (ceiling, floor, western wall). So, as shown in Fig. 5 , the energy consumption calculated for the models based on the ASHRAE standard is the same on these two floors. However, the energy consumption for the first floor, in which the western wall and roof are adiabatic (does not have an adiabatic floor), is more than the second and third floors. Finally, the energy consumption for the fourth floor, which has only an adiabatic floor been more than other case studies. In addition, the difference between case studies in terms of energy consumption obtained by bills and simulation with the questionnaires is related to the differences in occupants' behavior. Fig. 5 demonstrates that energy consumption exceeds the values considered by the simulations of the ASHRAE standard, indicating that the operational stage energy consumption is more than the design stage consumption. Gap due to occupant behavior shows the suboptimal occupant behavior and inefficient energy usage. In addition, the amount of gap due to occupant behavior on the third and fourth floors is less than the other two floors, exhibiting better energy efficiency on the third and fourth floors. This highlights the significant impact of occupant behavior on energy consumption and the EPG in both the design and operation stages. The fixed occupancy schedule prescribed by standards in the design stage led to differences in energy consumption between the design and the operational stages. These schedules should be adjusted to reflect societal conditions, such as quarantine measures resulting from the COVID-19 pandemic, as well as cultural aspects, to ensure that the results of the design stage align better with the operational stage. It should be noted that changes in occupants' operational schedules will also affect data related to lighting and equipment usage in the building. Additionally, occupants' comfort temperatures during the operational stage often differ from the temperatures considered in the standard simulations in the design stage. By relying on fixed assumptions regarding occupants' behavior in simulations, different behavior patterns are overlooked, leading to the occurrence of EPG during the design stage. In this study, the cooling and heating setpoints according to the ASHRAE standard for residential buildings are 23.8 °C and 21.1 °C, respectively [63] . However, the questionnaire and indoor temperature measurements showed that the setpoints are different based on the occupants’ preferences. This highlights the importance of recognizing behavioral differences among residents. Table 6 lists the numerical data of the investigated performance gaps; in other words, it presents the numerical results of Fig. 5 . Table 6 reveals that the third floor exhibits the lowest gap during the design stage, while the first floor has the largest gap. As mentioned in the literature review, accurate design stage simulation is significant for reducing EPG, due to designers and engineers have the most influence on reducing EPG in the design stage than in the operational stage. This study examined the effect of three significant factors on the design stage gap, and Table 7 identifies the impact of each factor on the design stage gap. From Table 7 , the first floor has the most operational stage gap and gap due to occupant behavior, which means occupants are less cognizant of using energy and therefore consume more energy than they think. Therefore, the influence of occupants on the EPG is greater compared to other factors on the first and second floors, which can be numerically recognized in Table 7 . Conversely, on the third and fourth floors, where occupants demonstrate conscious behavior and possess knowledge of energy usage according to Table 6 , the effect of wall-mounted gas-fired boiler efficiency surpasses other factors as shown in Table 7 . Furthermore, Table 7 shows that the real EPW file has an impact of over 2 % in the investigated cases, underscoring the need to consider this factor in design stage simulations. Respectively, correct boiler efficiency, accounting for different occupant behaviors, and employing the accurate EPW file have the greatest influence on reducing the design stage gap. As listed in Table 7 , the accuracy of the EPW file can influence the gap in the design stage. The weather file used in the design stage simulation was based on data from Mashhad airport station between 2007 and 2021. Given the issue of climate change since 2021 and the fact that the station is located approximately 20 km away from the studied building, as shown in Fig. 2 , the weather file information deviates from reality, resulting in the design stage gap. In addition to the distance, there are other factors that affect the difference between the data of the airport station and the building station. For instance, the vegetation cover around the airport station was more than the building site, as shown in Fig. 2 . In addition, the terrain around the building was mountain-type, while around the airport station was plain. Also, the height above sea level at the building site was 1128 m, and at the airport station was 990 m. Therefore, collecting regional weather data to obtain accurate EPW files can help eliminate the effect of this factor on EPG. Another factor that can contribute to the gap at the design stage is the mismatch between the power and efficiency of heating system components, including the wall-mounted gas-fired boiler, and the specifications provided in manufacturer’s catalogs. The catalog specifications for materials and equipment are typically obtained under specific conditions. It is advisable to gather detailed specifications for building physics and equipment efficiency at the construction site to utilize in simulations. The boiler can also impact EPG during operational stage. Equipment deterioration and lack of regular maintenance result in increased energy consumption during operational stage. To investigate another factor influencing the EPG, thermal imaging of the building envelope was conducted. Fig. 6 depicts thermal images revealing leakage through the mortar between construction junctions. The use of insulation in external walls, the involvement of experienced personnel, and collaboration among all project stakeholders improve construction quality, subsequently reducing the EPG during the operational stage. 4.4 Validating the accuracy of simulations To validate the accuracy of the model's energy results, ASHRAE Guideline 14 [70] recommends using the coefficient of variation (CV) of the root-mean-square error (RMSE) and the Normalized Mean Bias Error (NMBE). Additionally, the model's predictions for indoor temperatures are cross-validated against monitored data. The calibrated model should exhibit a CV(RMSE) of less than 15 % [70] , NMBE of 5 % [70] , mean absolute error (MAE) of less than 1 °C, and RMSE of less than 1.5 °C [20] . These can be computed as follows: (2) C V RMSE = Σ i ̇ = 1 n M i - S i 2 n M ¯ (3) N M B E = Σ I ̇ = 1 n M i - S i n × M ¯ (4) RMSE = Σ i ̇ = 1 n M i - S i 2 n (5) M A E = 1 n Σ i = 1 n | M i - S i | where n is the number of samples of the test set, M i refers to the real value of i-th sample, S i refers to the predictive value of i th sample. Table 8 presents the validation results, based on the indoor temperature and heating gas consumption, for all simulations conducted based on the questionnaire. The first and second floor simulations have CV(RMSE) and NMBE values exceeding 15 % and 5 %, respectively. This can be attributed to the occupants' lack of knowledge about their own behavior, as discussed in Sections 3.2 and 4.3 , and also to the fluctuations of gas quality in winter, when the pipeline network is heavily tasked [80] . The CV(RMSE) and NMBE for the third floor are less than 15 % and 5 %, and CV(RMSE) for fourth floor is less than 15 % which validates the accuracy of the simulations. In addition, as mentioned in Table 8 , MAE and RMSE results are less than 1 °C and 1.5 °C. Consequently, it can be concluded that the simulations are partially validated. Fig. 7 illustrates the simulated and measured temperatures which verify the accuracy of the model. Time periods for each floor in Fig. 7 were selected through the occupants’ convenience, based on the time when occupants were at home and allowed to place measuring instruments.\n\nResults\n4.1 Evaluation of field research The analysis of questionnaires collected from occupants of the four case studies revealed that approximately 75 % of them utilized the heating system from October to March and 25 % from October to April. Moreover, all occupants reported that the heating system is always turned on during cold days. This finding indicates that thermal comfort is the occupants' priority, not optimal energy consumption. Using questionnaires, it has been determined that occupants of the 4th floor reduce the radiator's setpoint from around 11 am to 2 pm in order to maintain thermal comfort. However, the occupants were unable to provide precise information about hourly boiler temperature adjustments, as they are influenced by outside temperature and behavioral factors. Analysis of the occupants' operation schedules based on the questionnaires revealed that in weekdays, 35 % of occupants spend 3 h, 14 % spend 13 h, and 21 % spend 9 h outside. Furthermore, 30 % of occupants typically spend most of their time at home. On weekends, 58 % of occupants spend 7 h, 21 % spend 3 h and 21 % spend 16 h outside. The occupants' operation schedules based on the questionnaires also indicate that the occupants' age and occupation have an impact on the pattern of operation schedules. Fig. 4 illustrates the gas utilities for each apartment unit over the past three years. The examination of gas consumption data from the bills indicates that the highest gas consumption in the investigated case studies occurred during the cold months, primarily due to the use of the heating system. Conversely, the lowest gas consumption was observed during the summer season, attributed to hot water and cooking. Specifically, the highest gas consumption was recorded in December and January. However, in order to investigate the heating energy performance gap, this study focused on the period from October 2022 to March 2023. This particular period was selected because it offered comprehensive and reliable data regarding occupant behavior and weather conditions (the EPW file).\n\nConclusion\n5 Conclusions This paper presents a comprehensive analysis of the Energy Performance Gap (EPG) across four residential units in the same block to provide valuable insights into performance issues during the design stage. The EPG relates to the difference between designed and actual energy consumption, and reducing EPG enables better energy management, cost savings, and environmental sustainability. In this study, the EPG examined by comparing standard model, questionnaire model, and billing records for heating gas consumption. The validation of the questionnaire model, for energy use by CV(RMSE) and NMBE and for space temperatures by MAE and RMSE, confirms its suitability for modeling occupant behavior. This simulation-based approach allows for the investigation of parameters that impact the design stage. Based on the literature review, three factors were identified as influencing the EPG in the design stage: occupant behavior, the EPW file, and the boiler efficiency as a technical issue of the heating system. The impact of the first factor can be reduced by incorporating at least three occupant behavior types (occupants with high, moderate, and low consumption) into the standard assumptions. The second factor requires accurate EPW files, which may necessitate specialized equipment. The third factor requires attention and correction from manufacturers to ensure optimal system functioning. In addition, this factor requires measuring boiler efficiency, as our study shows the efficiency of the boiler was 56 %, whereas the manufacturer’s catalog shows it as 89 %. Furthermore, improving occupants' knowledge about their behavior and implementing regular equipment maintenance during the operational stage can reduce the effects of the first and third factors. Overall, the average impact on reducing the design stage gap for correct boiler efficiency, consideration of different occupant behaviors, and use of accurate EPW files was about 43.9 %, 26 %, and 6.6 %, respectively. According to the results, the third floor showed the lowest energy performance gap because of accurate occupancy behavior report and on the other hand, the first-floor significant gap is mainly because of the inability of its' occupants in reporting their real energy behavior. While our research has made significant strides in quantifying the impact of heating system efficiency, weather data accuracy, and occupant behavior on bridging the Energy Performance Gap (EPG), it is important to acknowledge that this study focuses on a specific case study in Iran, which may not capture the full spectrum of factors influencing EPG in diverse geographical and building contexts. In this study, the measured boiler efficiency is not seasonal average efficiency and it is only measured one time by an expert. It is worth noting that this study is performed during one cold season (6 months), hence the dataset is limited. Studies such as the research by Hansen et al., [81] demonstrated that increasing the sample size can reduce statistical error e.g. RMSE. Conducting research for multiple cold seasons might increase validation accuracy. These limitations suggest several promising avenues for future research: • Future studies could expand their scope to include a broader range of geographical locations and climate zones to assess how regional variations in weather patterns and building designs contribute to EPG. • Investigating EPG in different types of buildings (e.g., commercial, industrial) can provide insights into how the phenomenon varies across various sectors of the construction industry. • As new technologies and building materials continue to emerge, research can explore how these innovations impact EPG and energy efficiency. • Assessing the effectiveness of energy efficiency policies and incentives on reducing EPG can provide valuable insights into the role of government initiatives in mitigating this gap. • Conducting long-term studies that track building performance over several years can shed light on how EPG evolves and fluctuates over time, accounting for changes in technology, occupant behavior, and building maintenance. • Increasing the sample size and investigating heating gas consumption for multiple cases. The results yielded that it is crucial to consider including the number of electrical appliances, boiler efficiency, and occupancy schedules to enhance the reliability of simulation results. In addition, using smart technologies such as building automation, control systems, and smart meters, as noted by Li et al., [39] , can improve energy efficiency and enhance occupant comfort by employing self-regulation devices to optimize indoor climate control. These findings align with similar studies [21,39,51] , suggesting that the identified issues are likely applicable to the design stage and standards. For future research, it is recommended to develop a framework that investigates other factors influencing the reduction of the gap by eliminating the effect of occupant behavior on energy consumption. Furthermore, addressing uncertainties related to the building performance gap can help stakeholders identify the most influential parameters in reducing the EPG during the design, construction, and operation stages. Adopting a smart city perspective and exploring the impact of Internet of Things (IoT) technology and smart homes on the EPG can also be an effective avenue for investigation.\n"
  }
}