{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nUsing separate cooling coils for sensible and latent loads provide extra control flexibility to optimise the energy efficiency and comfort in air-conditioning and mechanical ventilation (ACMV) systems. A popular implementation of such technology is dedicated outdoor air system (DOAS)-assisted separate sensible and latent cooling (SSLC) systems. However, a sophisticated control technique is needed to coordinate the control of multiple cooling coils in such systems. This paper presents a novel model predictive control (MPC) developed for a DOAS-assisted SSLC system. The MPC adopts a linear state-space model that captures building thermodynamics, thermal comfort and ACMV for building response prediction and optimization. Subsequently, a multi-objective cost function is employed to optimize energy use and thermal comfort while fulfilling constraints of predicted mean vote (PMV) (-0.5, 0.5) and relative humidity (0%, 65%) in buildings. The performance of the MPC for controlling a conventional single-coil air-handling unit (AHU) system and a DOAS-assisted SSLC system is experimentally investigated and compared to a conventional feedback-control-based building management system (BMS). The MPC system achieved 18% and 20% electricity savings for the single-coil AHU and DOAS-assisted SSLC, respectively, as compared to the BMS controlled single-coil AHU. Furthermore, indoor thermal comfort is significantly improved, compared to the BMS. DOAS-assisted SSLC is shown to be advantageous compared to single-coil AHU to achieve better indoor environment in terms of thermal comfort and humidity, when both systems are controlled by MPC.\n\nMethods\n2 Methodology 2.1 Test facility Experiments were conducted in Lecture Theatre 3 (LT3) in the north academic complex on the campus of Nanyang Technological University (NTU) in Singapore, as shown in Fig. 1 . The original AHU is of conventional single-coil setup, which is later modified to a DOAS-assisted SSLC setup for comparative study. The walls of the test room (LT3) are of 0.2-m-thick reinforced concrete and the external surfaces are exposed to outdoor air, as shown in Fig. 2 . The wall surface area is 204 m 2 . The roof and floor of the test room are composed of 0.4-m-thick reinforced concrete. The total floor area of LT3 is 255 m 2 . The test room is fitted with 240 seats, divided into 3 columns (left, middle and right) as shown in Fig. 3 . A total of 151 lamps are fitted on the ceiling, each rated at 30 W, providing a lighting power density of 17.8 W/m 2 of floor area. The heat gain from occupants and lighting forms the bulk of the internal load. 2.1.1 The ACMV system LT3 is originally air-conditioned by a single-coil variable air volume (VAV) AHU (DAIKIN, DDMI-0717-H), as shown in Fig. 4 , that is controlled by a conventional existing BMS of the test building. The maximum airflow volume of the AHU is 14,882 m 3 /h. Airflow volume is regulated by a variable speed drive (VSD) fan that varies between 25 and 45 Hz, according to a temperature set-point of 24 °C in the return air. The supply air is distributed into the room space through 24 diffusers and room air returns to the AHU through 18 return air grilles, as shown in Fig. 2 . Fresh air flowrate is regulated by a motorized fresh air damper (FAD) according to a CO 2 concentration set-point of 900 ppm in the return air. The return air damper (RAD) is kept 100% open when the CO 2 concentration in return air is below 1000 ppm and is regulated to 50% open when the CO 2 concentration goes beyond 1000 ppm. Chilled water flowrate through the cooling coil is regulated by a two-way motorized water valve (WV1) according to the temperature set-point of supply air, defined in Eq. (1) , (1) T sa , s p = 288.15 - ( T ra - T ra , s p ) where T refers to temperature (K), while subscripts sa , ra and sp refer to supply air, return air and set-point, respectively. The setup of supply air temperature set-point described in Eq. (1) is from the original BMS of the test building. It is essentially a proportional controller that regulates the supply air temperature set-point based on the difference between the measured and set-point temperatures of the return air. The regulation of supply air temperature assists in the control of return air temperature according to the set-point (24 °C), which is mainly tracked by the regulation of the supply air flowrate through the VAV fan as described above. The chilled water is provided by a central chiller plant in the test building, which has an average COP of 5.388. The average chilled water supply temperature is 8.5 °C. In the later stage of the study, the ACMV system was modified by adding a DOAS between the FAD and fresh air inlet, as shown in Fig. 5 . The original cooling coil in AHU became a secondary cooling coil for dealing with the remaining sensible load. Chilled water flowrate through the water loop of the DOAS was regulated by a two-way motorized valve (WV2 in Fig. 5 ). Since there is no separate higher-temperature chiller in the main chiller plant of the test building, the water loop of the secondary cooling coil was modified such that the chilled water supply temperature could be raised. A constant-speed water pump (ELEMO, YE3-90L-2) and two three-way motorized valves (WV3 and WV4 in Fig. 5 ) were installed, which regulated the mixing of chilled water from the chiller plant and recirculated chilled water from the secondary cooling coil. The mixed chilled water with higher-temperature of 11 °C was supplied into the secondary cooling coil. The control of the WV2–4 and the constant-speed water pump is described in Section 2.4 . Another configuration (or ‘Configuration B’) of DOAS-assisted SSLC system that differs from the proposed (or ‘Configuration A’) in this study could be found in the literature [5] . In Configuration B, the secondary cooling coil is installed at the return air duct for cooling the sensible heat of return air. The rest of the settings for Configuration B are the same as Configuration A. However, the setup of Configuration B is more costly than Configuration A as it requires new installation of the secondary cooling coil in the return air duct while Configuration A could utilize the existing AHU as a secondary cooling coil. In addition, the dew point temperature of the return air entering Configuration B is higher than that of Configuration A (mixed air of return air and pre-cooled fresh air), resulting in the former having higher chances of water condensation in the secondary cooling coil. Thus, only Configuration A is studied in the current work. 2.1.2 Instrumentation A set of sensors were installed for the implementation of the MPC system and for monitoring of control performance. These include twelve temperature-humidity-pressure-lux (THPL) sensors in the room space, as shown in Figs. 2 and 3 , as well as globe temperature and air velocity sensors at seating level at the middle of the test room. The air temperature, globe temperature, relative humidity (RH) and air velocity measured by the above-mentioned sensors are used to calculate predicted mean vote (PMV) in the test room, which is a comprehensive index of thermal comfort used in this paper and adopted by comfort standards ISO 7730 [34] and ASHRAE Standard 55 [35] . Other variables for PMV calculation including metabolic rate and clothing insulation are assumed to be constant at 1.2 met and 0.5 clo per occupant, respectively. Sensors for monitoring air variables in the ACMV system including combined temperature-RH, flowrate and CO 2 concentration sensors were installed as shown in Fig. 5 . CO 2 readings in the ACMV system are used for estimating the number of occupants inside the room space and a detailed calculation is described in Section 2.2.3 . A combined temperature-RH sensor was installed outside of the test room to measure outdoor conditions. Two thermal energy meters were installed in the water loop to monitor the cooling powers supplied to DOAS and AHU, respectively. Each thermal energy meter has two water temperature sensors (ABB TSC420) and one water flow sensor (ABB WaterMaster Series) to measure the temperature (supply and return) and flowrate of the chilled water, respectively. A data logger (Contrec 212) in the thermal energy meter calculates the cooling power provided by the chilled water. An electric power meter (Siemens PAC3200) was installed to measure the electrical power of the constant speed drive (CSD) pump and VSD fan. Detailed specifications of the above-mentioned sensors are summarized in Table 1 . 2.2 Modelling 2.2.1 Building dynamics model In the test room, heat gain includes internal heat gain (occupancy and lighting loads), heat exchange with building thermal mass (walls, roof and floor.) and thermal energy from the ACMV system. A thermal resistance-capacitance (RC) model is developed to describe the heat transfer in the room space, as shown in Fig. 6 . A first-order thermal RC model, which is widely used for building modelling application [36–37] is used to describe the thermal mass of the test room in this study. The RC model has thermal nodes representing the temperature of interior thermal mass (building structures without surfaces exposed to outdoor air such as roof and floor of the test room), exterior thermal mass (building structures with surfaces exposed to outdoor air such as walls of the test room) and air in the room space. Other thermal masses such as furnishings and installation are not modelled in the thermal RC model, as the dimension and property information is not available. However, a model calibration procedure based on measured building data is conducted to refine the thermal RC model and details are described in Section 2.2.3 . As the adjacent lecture theatres (above and below the lecture theatre) are also air-conditioned by the same BMS with the same room air temperature set-point, the temperature difference between the lecture theatre and the adjacent rooms is expected to be small. Thus, thermal effects in adjacent rooms are not modelled (assumed that there is no heat exchange through the floor/roof) and it is treated as unmeasured disturbances for the MPC. There are no adjacent rooms on the four side walls of the lecture theatre. The equivalent thermal resistance and capacitance of the exterior thermal mass are calculated through Eqs. (2) and (3) , respectively. (2) R em = 1 / ( 1 R 1 + 1 R 2 ⋯ 1 R n ) (3) C em = C em , 1 + C em , 2 + ⋯ C em , n In Eqs. (2) and (3) , subscripts n and em refer to the number and exterior thermal mass, respectively. Symbols R and C refer to thermal resistance (K/W), thermal capacity (J/K), respectively. Eqs. (2) and (3) can also be applied to the calculation of equivalent thermal resistance and capacitance for the interior thermal mass of the test room. The thermal RC model in Fig. 6 could be described by, (4) C z T ̇ z = Q int + Q sa + T is , e m - T z R is , e m + T is , i m - T z R is , i m (5) C im T ̇ im = T is , i m - T im 0.5 R cond , i m (6) C em T ̇ em = T is , e m + T is , e m - 2 T em 0.5 R cond , e m (7) T is , e m - T z R is , e m + T is , e m - T em 0.5 R cond , e m = 0 In Eqs. (4)–(7) , the symbol Q refers to heat flux (W). Subscripts is , es , o , z , im , int , and cond refer to surface exposed to room air, surface exposed to outdoor air, outside, thermal zone, interior thermal mass, internal and conduction, respectively. The surface thermal insulance of the inner and outer surface of wall/roof/floor are 0.12 and 0.044 (K-m 2 )/W, respectively, according to Ref. [38] . Assuming that there is no infiltration of outdoor air into the room space, the dynamics of humidity ratio in the room space is modelled as, (8) ρ air V z ψ ̇ z = m ̇ moi , s a + m ̇ moi , i n t where symbols ρ , V , ψ and m ̇ refer to density (kg/m 3 ), volume (m 3 ), humidity ratio (kg/kg) and mass flow rate (kg/s), respectively. Subscripts moi and air refer to moisture and room air, respectively. Particularly, m ̇ moi , s a refers to the moisture gain from ACMV through supply air and the calculation is described in Section 2.2.2 . m ̇ moi , i n t refers to internal moisture gain from occupants, which is calculated by, (9) m ̇ moi , i n t = n occ m ̇ moi , o c c The number of occupants, n occ , is estimated based on CO 2 balance in the room space and the calculation is described in Section 2.2.3 . m ̇ moi , o c c refers to the moisture generation ratio per occupant. A linear PMV calculation model developed in the previous study [29] is used to evaluate indoor thermal comfort, described by, (10) PMV = 35.71 ψ z + 0.1411 T mr + 0.1592 T z - 89.63 where subscript mr refers to mean radiant. Eq. (10) is derived based on the assumption that clothing insulation and metabolic rate of the occupants in LT3 are constant at 0.5 clo and 1.2 met. The detailed modelling procedure of the linear PMV model is described in Ref. [29] . 2.2.2 ACMV model When the ACMV system of the test room operates in the single-coil mode (DOAS off and AHU on), RH of the air from the cooling coil of AHU is assumed at 100%. A linearized ACMV model developed in a previous study [29] is employed to predict moisture and heat gain from the original AHU ACMV system, (11) m ̇ moi , s a = 2.578 × 10 - 4 m ̇ fa T fa + 2.578 × 10 - 4 m ̇ ra T ra - 2.565 × 10 7 Q AHU + 0.6325 m ̇ fa ψ fa - m ̇ fa + 0.3675 m ̇ ra ψ ra - 0.07031 m ̇ fa - 0.07031 m ̇ ra and (12) Q sa = 369.4 m ̇ fa T fa - 1005 m ̇ fa + 63 5.6 ra T ra - 0.3675 Q AHU + 9.062 × 10 5 ( m ̇ fa ψ fa + m ̇ ra ψ ra ) + 1.734 × 10 5 m ̇ fa + 1.734 × 10 5 m ̇ ra In Eqs. (11) and (12) , subscripts fa and ra refer to fresh air and return air, respectively. Particularly, Q AHU refers to cooling power supplied by the chilled water in the cooling coil of AHU. The detailed modelling procedure is described in Ref. [29] . When the ACMV system for the test room operates as DOAS-assisted SSLC (both the AHU and DOAS are on), the air coming off from the DOAS coil is assumed to be saturated. The cooling coil in AHU becomes a secondary cooling coil for dealing with the remaining sensible load. The secondary coil operates at a higher temperature such that there is no water condensation, and thus, the secondary cooling coil acts as a sensible heat sink to the room space. This allows the model of the DOAS-assisted SSLC system to be linear. Incorporating with the linear ACMV model (Eqs. (31) and (32) in Ref. [29] ) for conventional single-coil system, moisture and heat gain from the DOAS-assisted SSLC system is modelled based on Eqs. (13) and (14) , (13) m ̇ moi , s a = 2.578 × 10 - 4 m ̇ fa T fa - 2.578 × 10 7 Q DOAS + 0.6325 m ̇ fa ψ fa - m ̇ fa ψ ra - 0.07031 m ̇ fa and (14) Q sa = 369.4 m ̇ fa T fa - 1 005 m ̇ fa T ra - 0.3675 Q DOAS - Q AHU + 9.062 × 10 5 × m ̇ fa ψ fa + 1.734 × 10 5 m ̇ fa In Eqs. (11) and (14) , variables T fa , T ra , Q DOAS , Q AHU , ψ fa and ψ ra are input variables for calculating moisture and heat gain from the ACMV system. m ̇ fa and m ̇ ra are coefficients which are time-varying variables. Q DOAS refers to cooling power supplied by the chilled water in the cooling coil of DOAS. In real-time control, the ACMV model can be adapted at each time step with measured flowrates of fresh air and return air. Thus, MPC employing the adaptive ACMV model is also reformulated at each time step based on the updated ACMV model. Details of the MPC in this study are described in Section 2.3 . 2.2.3 Model calibration To reduce prediction errors due to uncertainties in the thermal RC model described by Eqs. (4)–(6) , the thermal RC model was calibrated and refined using measured data of the test room. The uncertainties can result from undefined properties of building structure and simplification that is assumed in the modelling. A total of fourteen days of measured data in the test room are collected for model calibration and verification. The data was measured by the sensors described in Table 1 and stored at 5-min intervals. Measured data of the first 8 days is used to calibrate the parameters of the thermal RC model. The calibrated thermal RC model was then verified by comparing predicted results against the measured data of the remaining 6 days. The weather, AMCV and room conditions during the measurement period are shown in Figs. 7 and 8 . Lighting power in the test room is assumed to be 100% when the ACMV system is on and 0% when the ACMV is off. The number of indoor occupants is estimated based on the steady-state CO 2 balance in the room space using measured supply air flowrate as well as CO 2 concentration in return and supply air [39] , (15) n occ = G sa ( X ra - X sa ) / S where G , n , X and S refer to volume flow rate (m 3 /s), number, CO 2 concentration (m 3 /m 3 ) and CO 2 generation rate per person (m 3 /s). Given that uncertainties in the thermal RC model are the R and C parameters [29] , they are tuned in the calibration to minimize the sum-square error of room air temperature between measurements and that predicted by the thermal RC model. Fig. 8 shows the comparison of room air temperature predicted by the thermal RC model and measured in the test room during both calibration and verification periods. The daily mean absolute error is below 1 °C for all the calibration and verification days. The mean absolute errors are 0.48 °C and 0.62 °C during the calibration and verification periods, respectively, which indicates good agreement between predicted and measured room air temperatures. Incorporating with the calibrated thermal RC model, room humidity ratio predicted by Eq. (8) also has good agreement with measured room humidity ratio and the mean absolute error is 0.0007 kg/kg. 2.2.4 State-space representation The building model including sub-models of thermal RC, PMV, ACMV and indoor moisture described by Eqs. (4)–(14) can be represented in a state-space model (SSM), (16) x ̇ = A x + B u (17) y = C x + D u where x , u and y are the state, input, output vectors, respectively. A , B , C and D are state, input, output and feedthrough matrices. The descriptions of states, inputs and outputs of SSM are listed in Table 2 . For the outputs T z , T mr and ψ Z , there is no feedthrough from inputs. For the output PMV , it requires feedthrough from input CONS (described in Table 2 ) as there is a constant term in Eq. (10) for PMV calculation. For each of the two studied ACMV systems (original single-coil AHU and DOAS-assisted SSLC), a SSM for building model is created. Matrices A , B , C and D of SSMs for the original AHU system and the DOAS assisted-SSLC system are shown in Appendix A , Eqs. (A.1)–(A.8) . The two SSMs are linear with time-varying parameters ( m ̇ fa and m ̇ ra ). 2.3 MPC controllers Two MPC controllers are developed for controlling the original AHU system and DOAS-assisted SSLC system, respectively. The MPC controller for original AHU (MPC-AHU) controls the original AHU to deal with both sensible and latent load by a single cooling coil. The MPC controller for DOAS-assisted SSLC system (MPC-SSLC) controls the DOAS to deal with the latent load and a fraction of the sensible load and the AHU to deal with the remaining sensible load. The two MPC controllers share the same overall structure, as shown in Fig. 9 , consisting of an optimization solver, SSM, constraints and a cost function. With inputs of measured disturbances, MPC optimizes control signals to the ACMV system of the test room. State parameters in SSM are updated at each control interval to compensate for the model error of SSM and avoid the accumulation of prediction error in the MPC controller. The feedback of state parameters is estimated by a Kalman filter based on the difference between SSM predicted and measured room conditions. Measured flowrates of fresh and return air are fed back to MPC to update the ACMV model in the SSM. 2.3.1 MPC controller for the original AHU MPC-AHU optimizes the cooling power provided by the chilled water in the cooling coil of AHU according to an objective function (Eq. (18) ) which minimizes the cooling energy consumption and chases best thermal comfort in a prediction horizon. (18) J = M i n i m i z e ( ∑ k = 0 N Q ^ AHU , t + k | t 2 + ∑ k = 0 N ( W PMV PMV ^ t + k | t ) 2 + ∑ k = 0 N W ∊ ( ∊ t + k | t ) 2 ) In Eq. (18) , symbols Q ^ , PMV ^ , W and ∊ refer to normalized cooling power, normalized thermal comfort, penalty weighting factor and slack variable. N refers to the prediction horizon. Subscripts t and k refer to the current time and index variable. Particularly, the three terms on the right-hand-side refer to thermal energy (AHU) cost, thermal discomfort cost and constraints violation cost. The thermal energy cost term minimizes the thermal energy consumption of the AHU. The thermal discomfort minimizes the offset of indoor PMV from 0 (best thermal comfort). The constraints violation cost with the slack variable ∊ softens constraints (In Eq. (22) ) by allowing variables to exceed the constraints by a certain amount. The weighting factor W PMV determines the trade-off between energy saving (first term) and thermal comfort (second term). In this study, a high W PMV of 4 is used such that the objective function is thermal comfort bias [29] . The objective function, Eq. (18) , holds for the SSM-AHU described in Eqs. (A.1)–(A.4) in Appendix A , the constraints of cooling power provided by the cooling coil in AHU, constraints of indoor PMV index and constraints of indoor humidity ratio. The normalized cooling power and PMV are defined by, (19) Q ^ = Q / Q max and (20) PMV ^ = P M V / ( P M V max - PMV min ) where subscripts max and min refer to maximum and minimum. Particularly, Q max , refers to the cooling capacity of a cooling coil. PMV max and PMV min refer to maximum and minimum acceptable PMV, which are 0.5 and −0.5 according to ASHRAE Standard 55 [35] . A maximum indoor RH of 65%, recommended by ASHRAE Standard 62.1 [40] , is used to calculate the upper bound of indoor humidity ratio, (21) ψ z , m a x = 0.0007510 T z - 0.005915 Eq. (21) is a linear correlation of air humidity ratio and air temperature for a fixed air RH of 65%, which is fitted based on psychrometric data [38] . Eq. (21) is valid in a temperature range of 22–27 °C, which covers typical range of room air temperature. The approximated results by Eq. (21) is compared to the data generated by psychrometrics is shown in Fig. 10 and good agreement is observed. Thus, the constraints for the MPC controller are (22) 0 ≤ Q AHU ≤ Q max , PMV min ≤ P M V ≤ PMV max , a n d 0 ≤ ψ z ≤ ψ z , m a x The constraints of thermal comfort and humidity ratio are softened by the slack variable ∊ and more details could be found in Refs. [29] and [30] . 2.3.2 MPC controller for the DOAS-assisted SSLC The objective function of MPC-SSLC aims at minimizing the cooling energy consumed by cooling coils in both AHU and DOAS, and achieving the best indoor thermal comfort, (23) J = M i n i m i z e ( ∑ k = 0 N Q ^ AHU , t + k | t 2 + ∑ k = 0 N Q ^ DOAS , t + k | t 2 + ∑ k = 0 N ( W PMV PMV ^ t + k | t ) 2 + ∑ k = 0 N W ∊ ( ∊ t + k | t ) 2 ) In Eq. (23) , the four terms on the right-hand-side refer to thermal energy (AHU) cost, thermal energy (DOAS) cost, thermal discomfort cost and constraints violation cost. A weighting factor W PMV of 4, same as that of MPC-AHU, is used. The objective function, Eq. (23) , holds for the SSM-SSLC described in Eqs. (A.5)–(A.8) in Appendix A , the constraints for cooling power of cooling coils in both the AHU and DOAS, constraints for indoor PMV index and constraints for indoor humidity ratio. The constraints for cooling power of AHU and DOAS are the cooling capacities of the cooling coils in AHU and DOAS, respectively. The constraints of indoor PMV index and indoor humidity ratio are the same as that of MPC-AHU. A control interval of 2-min is applied to the MPC controllers, which enables the MPC controllers to deal with the dynamic occupancy level in the lecture theatre. Other control interval levels including longer (5 min) and shorter (1 min) values were investigated during the MPC implementation and tuning stage. However, it was observed that MPC with longer control interval (5 min) could not accommodate the high dynamics of indoor occupancy load well, especially at the beginning and end of a class. On the other hand, it was also observed that the low-level controllers (described in Section 2.4 ) could not track the cooling power set-point generated by MPC with 1-min. control intervals well due to the frequent change (1 min) of cooling power set-point. In addition, a shorter control interval will result in more intervals in a prediction horizon, increasing the effort to solve the optimization problem in MPC. As such, 2 min was chosen to be fast enough, yet providing sufficient time for the low-level controllers to respond. The prediction horizon of the MPC controllers is 30 control intervals (60-mins), which covers the response time of the thermal conditions in the lecture theatre (e.g., around 30-mins for indoor PMV to be cooled down to the best thermal comfort during morning start-up of ACMV). 2.4 Control system architecture The control system for the test room is illustrated in Fig. 11 . In parallel to the original BMS, an additional MPC system is added. A manual switch is installed to allow switching between the original BMS and the new MPC system for controlling the ACMV system. When the original AHU is running, the two-way motorized valve (WV1), VSD fan and FAD shown in Figs. 4 and 5 are controlled by the selected control system. If the original BMS is controlling (BMS-AHU), the BMS controls the AHU according to the strategies described in Section 2.1.1 . If the MPC is controlling (MPC-AHU), the MPC server generates optimal cooling power set-point for the AHU and passes the set-point to a local controller (Schneider AS-P) through Modbus TCP/IP. The local controller regulates the various actuators according to the logics summarised in Table 3 . When the ACMV system is running in DOAS-assisted SSLC setting, all the actuators in the ACMV system are controlled by MPC (MPC-SSLC). MPC-SSLC generates optimal cooling power set-points for both the DOAS and AHU. The two cooling power set-points are passed to the local controller, which then regulates the actuators according to the logics summarised in Table 4 . The dew point temperature of the mixed air is constantly monitored based on the measured air temperature and RH at return air and off-coil of DOAS. The supply air temperature is controlled to be 1 °C higher than the dew point of mixed air so that there is no latent load in the secondary coil. Readings from sensors in the ACMV system, room space (except for the THPL sensors) and outdoors are fed through the local controller to the MPC system at 5-seconds intervals. THPL sensor readings are passed to the MPC controller directly through internet. The MPC controller stores all the measured data on the MPC server. Unless otherwise stated, data storage occurs every 5 min. The stored data is used for subsequent analysis of system performance. The MPC is programmed and executed in MATLAB/Simulink installed in the MPC server. The MPC server is a computer with configuration of Intel i5-6200U CPU and 8 GB memory. The hardware specification is not significantly higher than typical modern building BMS servers. For example, CSI standard MasterFormat [41] suggests a minimum configuration of 16-core AMD Opteron Processor for BMS. This suggests the current hardware configuration is representative to modern BMS servers. Under the current setting, the CPU time consumption per optimization of the MPC is less than 0.2 s, which is much smaller than the control interval (120 s). If the MPC is implemented on other BMS servers, it is still possible for the developed MPC to perform real-time control as long as the CPU time consumption per optimization is less than the control interval (120 s). 2.5 Experiment arrangement The weekly class schedule in the test room during the test period is listed in Table 5 . There are 40 h of classes per week and the schedule repeats weekly for the test period. The internal loads (occupancy and lighting load) during class time are assumed to be the same for every week. The ACMV system is switched on 30 min before and switched off immediately after each class. However, if the time gap between the end of a class and the start of the next class is shorter than 60 min, the ACMV system is kept on during the time gap. Lighting power is assumed 100% when ACMV is on and 0% when ACMV is off. Three settings (1) BMS-AHU, (2) MPC-AHU and (3) MPC-SSLC are conducted in the test room during January – March of 2019. The test for each setting ran for two weeks.\n\nResults\n2.5 Experiment arrangement The weekly class schedule in the test room during the test period is listed in Table 5 . There are 40 h of classes per week and the schedule repeats weekly for the test period. The internal loads (occupancy and lighting load) during class time are assumed to be the same for every week. The ACMV system is switched on 30 min before and switched off immediately after each class. However, if the time gap between the end of a class and the start of the next class is shorter than 60 min, the ACMV system is kept on during the time gap. Lighting power is assumed 100% when ACMV is on and 0% when ACMV is off. Three settings (1) BMS-AHU, (2) MPC-AHU and (3) MPC-SSLC are conducted in the test room during January – March of 2019. The test for each setting ran for two weeks.\n\nResults\n3 Test results Fig. 12 shows time series of the measured indoor PMV, room air temperature, RH and cooling power under the three settings (BMS-AHU, MPC-AHU and MPC-SSLC) on a Tuesday, which is the busiest day of the week in terms of class schedules. As shown in Fig. 12 (a), indoor PMV was maintained close to the best thermal comfort (PMV = 0) during most of the class time in the two MPC settings. This could be attributed to the thermal comfort model, described by Eq. (10) , for thermal comfort optimization in MPC controllers. In contrast, BMS-AHU kept indoor PMV at the cool side (PMV < 0) of thermal comfort for most of the class time, indicating excessive cooling of the room space due to the tracking of a single temperature set-point. Fig. 12 (b) and (c) illustrate that BMS-AHU maintained lower room air temperature and RH whereas compared to the MPC settings, echoing the trend for PMV observed in Fig. 12 (a). Fig. 12 (d) shows that BMS-AHU uses higher cooling power than the two MPC settings for most of the time, suggesting that BMS-AHU could consume higher amount of cooling energy than the two MPC settings. The statistical distributions of the measured indoor PMV, room air temperature and RH, as well as cooling power during class time for the three settings in the test period are shown in Fig. 13 as box plots. Fig. 13 (a) shows that the median indoor PMV for BMS-AHU, MPC-AHU and MPC-SSLC are −0.23, −0.09 and −0.02, respectively. This suggests that MPC-SSLC maintains the best indoor thermal comfort among the three settings whereas BMS-AHU is the worst. Both MPC settings kept indoor PMV within the comfortable zone (−0.5 ≤ PMV ≤ 0.5) during all the class time whereas indoor PMV went below −0.5 (overcooling) occasionally in BMS-AHU setting. Fig. 13 (b) shows that BMS-AHU chases the indoor air temperature set-point of 24 °C whereas the MPC settings kept the indoor air temperature at around 24.7 °C, which is decided by the objective of achieving best thermal comfort in both MPC controllers. However, the indoor temperature distribution for MPC-SSLC is much narrower than that observed in MPC-AHU, indicating that SSLC is more capable of maintaining stable room temperature than the single-coil AHU. Fig. 13 (c) shows that MPC-SSLC kept room air RH under the upper bound (65% as described in Section 2.3 ) at all class time whereas the room air RH in the MPC-AHU setting goes beyond the upper limit occasionally. MPC-SSLC also maintains more stable room RH than MPC-AHU. Fig. 13 (d) shows that the average cooling power in the BMS-AHU setting during class time is the highest among the three settings, which echoes the observation in Fig. 12 . The cooling power of MPC-SSLC is slightly lower than MPC-AHU. In summary, Fig. 13 suggests that MPC-SSLC outperforms the other two settings in terms of reducing cooling power and maintaining thermal comfort. BMS-AHU has the worst performance among the three settings. Fig. 14 shows the average weekly ACMV electricity consumption for each setting. The values shown in Fig. 14 are averaged over the two-week test period in each setting. ACMV electricity consumption consists of the consumption by chiller, fan and pump (in the case of MPC-SSLC). The chiller electricity consumption is estimated based on the measured cooling energy and a COP value of 5.388 for the central chiller plant serving the test building. Electricity consumption by the fan and pump are measured by the electric power meters as described in Table 1 . The MPC settings produce 16 – 18% energy saving as compared to BMS-AHU. Among the two MPC settings, MPC-SSLC consumes slightly less chiller energy than MPC-AHU but MPC-SSLC consumes extra fan and pump energy. The extra fan energy in SSLC is mainly due to the higher airflow volume needed to compensate for the raised supply air temperature to avoid condensation in the secondary cooling coil. The extra pump energy in SSLC is because of the need to recirculate chilled water in the secondary coil loop to achieve raised chilled water supply temperature, due to the lack of a separate higher temperature chiller in the test building. These extra consumptions lead to less energy saving by MPC-SSLC than MPC-AHU.\n\nConclusion\n5 Conclusion This work proposed a model predictive control (MPC) system for the control of conventional single-coil air handling unit (AHU) and dedicated outdoor air system (DOAS)-assisted separate sensible and latent cooling (SSLC) systems. The MPC system employs a linear state-space building model, which consists of sub-models of thermodynamics, predicted mean vote (PMV) and air-conditioning system, for forward prediction of building responses. A real-time optimization scheme with a multi-objective cost function is implemented which optimizes both cooling energy efficiency and indoor thermal comfort while maintaining indoor PMV and humidity within required ranges. The proposed MPC system was developed and experimentally implemented in a lecture theatre. The control performance of the MPC system for the single-coil AHU and DOAS-assisted SSLC systems was compared to a conventional feedback-control-based building management system (BMS). The MPC system achieved 18% and 16% electricity savings for the single-coil AHU and DOAS-assisted SSLC systems, respectively, as compared to the BMS. The slightly lower energy saving by the DOAS-assisted SSLC system is mainly caused by the lack of a separate higher-temperature chiller in the test building. If the system is implemented in a building equipped with a separate higher-temperature chiller, it is estimated that the MPC-controlled DOAS-assisted SSLC system can achieve 20% energy savings compared to the conventional BMS-controlled AHU system. The MPC system significantly improved indoor thermal comfort by maintaining indoor PMV stably close to thermal neutrality (PMV = 0), as compared to the BMS which kept indoor thermal comfort at the cool side (PMV < 0) with large variations for most of the time. Compared to the single-coil AHU, DOAS-assisted SSLC has better control capability for the MPC system to achieve better indoor environment in terms of indoor thermal comfort and humidity.\n"
  }
}