{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nThe energy performance gap in buildings is a well-known phenomenon. However, its actual definition and extent is dependent on the baseline used for defining the gap. In this paper a calibration-based methodology is used to identify and validate the root causes of the performance gap. Following analysis of the performance of four case studies in the UK, from different building sectors, cross sectoral learnings that are applicable in the wider industry context are uncovered. Through the model calibration process and in the overall performance assessment, Indoor Environmental Quality (IEQ) parameters have been used to improve the robustness of validation of the calibrated models and to highlight the interrelationship of energy and IEQ. The study shows the importance of contractual accountability to minimise performance issues, building a case for having IEQ in energy performance contracts to manage the trade-offs of IEQ against energy performance that leads to unintended health consequences for the occupants.\n\nResults\n2.1 Performance prediction approaches and the energy performance gap As policies increasingly focus on creating low energy buildings and benchmarking their performances, the use of computer modelling has become essential to assess and improve performance throughout a building’s life (Design, Construction, Operation, & Retrofit). In most countries modelling is primarily undertaken for regulatory compliance and that type of modelling can be termed as compliance modelling [72] . Under the EU Energy Performance of Buildings Directive (EPBD), in the UK’s regulatory compliance systems, models are created to assess the energy performance for comparative assessments [27] . To calculate energy use, the compliance modelling approach followed in the UK uses standardised operating conditions, as per the UK National Calculation Methodology (NCM) [27] . These models often do not accurately reflect the building’s actual operating conditions such as occupancy, temperature set points, and schedules of operation of HVAC systems. Furthermore, compliance modelling calculations in the UK do not report energy use related to equipment (plug loads). Compliance modelling calculations are suitable for policy application where there is a need for simplicity, replicability, verifiability and most importantly applicability for the entire building stock, and where ‘relative’ performance is important (e.g. comparing energy performance of a buildings against a reference building using the same method). However, these compliance calculation methods are sometimes inappropriately used to evaluate the energy use performance of buildings as discussed in CIBSE TM54 [24] and Burman [18] . This happens due to the lack of understanding about the intentions, limitations and finer details of the calculations used, often resulting in misinterpreted prediction of actual performance [41] . Comparing actual energy use of a building with compliance modelling results, as per current UK Building Regulations which do not necessarily use real operation settings and do not report non-regulated energy (such as small power equipment) in building energy use totals, can inflate the performance gap and lead to a perceived gap [19,72] . To address this, CIBSE TM54 sets out a framework for projecting energy performance at the design stage. It allows designers to tailor the operating conditions as per the project brief and the predicted performance accounts for all end uses. In contrast with compliance modelling this approach is termed as performance modelling [72] . The resultant gap between performance modelling calculation and the actual energy use might be termed as the actual gap . Fig. 1 describes the calculation baselines and their relation to the various performance gaps. CIBSE TM54 calculations are designed to deal with design stage issues. Problems during construction and operation stages, such as technical issues arising from poor workmanship or maintenance, or changes in building functions or occupancy trends over time can lead to underperformance but are not necessarily reflected in the model created using CIBSE TM54.\n\nResults\n2.2 Causes of the performance gap A key finding of the Post Occupancy Review of Building Engineering (PROBE) studies was that there was little connection between design assumptions and on-site observations [14] . The actual energy use of most buildings was almost twice the design estimates [14] . The evidence from other countries corroborates this. A two-to-one discrepancy between actual and predicted energy performance in office buildings was identified in the US by Norfold et al. [53] . Studies on LEED certified buildings also revealed significant deviations in measured performance from the design projections [71,68,18] . Table 1 provides summary of the design and actual energy performance in the UK reported across the four case study building sectors. Being voluntarily provided data, the design calculations are not necessarily calculated in the same way for all the data, with some calculated with proper design assumptions and others based on regulatory compliance calculations. Nevertheless, because of the significant sample size, this data can be used to highlight the performance gaps indicatively. The performance gap can be due to many factors during design, construction and operation of buildings. Understanding of the causes of the gap is essential to maintain confidence in the performance estimates and the tools used for it. A review of 28 case studies in the UK found that 75% of the buildings underperformed due to serious shortcomings in construction practices, control strategies, commissioning, building fine-tuning in early stages of post-occupancy, user training, building management and maintenance [20,69] . Another cross-sectoral study documented problems associated with building fabric, control strategies, commissioning, installed metering strategies and inadequate provision of training [56] . Table 2 describes the major causal factors identified for energy performance gap in previous studies.\n\nResults\n2.3 Energy simulation, model calibration and its role in performance assessment Efforts have been made to improve the predictive capabilities of the simulation process by using better tools [3] and improving the understanding of building-occupant interactions [37] . While these efforts help to close the performance gap by making the performance modelling calculations more accurate, calibrating simulation models using monitored data has also been used to understand the performance issues that are the cause of the actual gap [41] . A typical calibration process requires two sets of data. One is the simulation input data which is often based on the design values and the operational assumptions. This simulation input data is used to calculate the predicted performance. The other data set is the metered data from the monitoring of the real building. Depending on the objective of the calibration, the parameters affecting the specific outputs concerned are fine-tuned to create a suitable match between the simulated performance and the monitored data. To develop calibrated model for diagnosing performance gap issues, a step by step, evidence-based calibration methodology should be followed which is procedural and replicable [63,62,78] . The minimum monitored data needed for any energy use calibration is the operational consumption for all fuels for a period of at least one year [6] . More detailed monitored data including disaggregated end-use energy consumption provides an opportunity for finer calibration and thereby increasing accuracy and confidence in the simulation model [33] . Monitoring of IEQ data streams can also provide evidence for detailed operational profiles. Temperature data can provide evidence of zone set-point temperature. Similarly, CO 2 and PM 2.5 concentrations can provide details about occupancy patters, ventilation and infiltration rates [43,58,9] . Calibration can give insights into the operational inefficiencies and pinpoint underlying causes for the performance gap [18] . Subsequently, a calibrated model could be used for detailed analysis by reintroducing design assumptions and quantify impacts of the underlying causes on performance.\n\nResults\n2.4 Going beyond the energy performance gap Energy efficiency is a key objective for new buildings and major renovations and the debate about the performance gap has raised awareness about the need of meeting the energy performance goals in practice. However, this is not necessarily the case for IEQ parameters - IEQ has only come to prominence relatively recently. This can be seen in the changes in the revised version of the EPBD (EPBD 2018/844). The original EPBD (EPBD 2010/31/EU) focused on reducing energy use. The revised EPBD highlights the importance of health, comfort, indoor air quality (IAQ) and indoor climate. However, details about their practical implementation are yet to be addressed [26] . In current practice, while adhering to IEQ standards is an essential aspect during design, the actual performance post-construction is not usually evaluated. Similar to the performance gap in energy use, the underperformance can also be seen in IEQ parameters such as temperature, air quality (pollutants, CO 2 ), noise and lighting [70,34,60] . Moreover, the ways to achieve better IEQ and building user satisfaction might contradict with the measures to achieve better energy performance. Therefore, if the focus is only on energy or on carbon emissions, this can lead to the unintended consequence of poor IEQ in buildings. Energy use reduction is not enough unless it allows the buildings to perform their desired functions i.e. to be healthy, comfortable and productive places to live and work in [40] . An example of these conflicts is the overheating and air quality issues that are uncovered in some new buildings which are constructed to higher energy standards with high insulation and airtightness [46,45,47,1] . CO 2 concentrations are often used as a proxy for IAQ. However, in urban areas, traffic-related external pollutants such as fine Particulate Matter (PM 2.5 ) and NO 2 are linked to adverse health impacts and can potentially compromise IAQ [4,5] . This may have significant implications where ventilation strategies are adopted that improve energy efficiency but don’t necessarily address outdoor pollution. Therefore, a holistic energy and environmental performance approach is necessary to understand the intricate interrelationship between these performance aspects to avoid unintended consequences and address gaps in the performance.\n\nMethods\n3 Methodology A robust M&V framework aiming to close the performance gap should identify and separate: i. Deviations of operating conditions from design that are driven by the building’s function and occupancy, ii. Technical issues that cause a performance gap between the design intent and the actual operation. This process can be achieved by making dynamic thermal simulation and model calibration integral to M&V. This paper uses a systematic calibration-assisted method to find and validate the building level performance issues, identifying deviations in operating conditions as well as technical issues separately. The process starts with collecting data and comparing actual data against the design information to quantify the magnitude of the gap and to identify discrepancies in the two datasets. Next, a design model is created using the design data and is then calibrated using evidence based fine-tuning as per the operation stage information to match to the metered data. The calibrated model’s energy results are validated through standard statistical checks (Cv(RMSE) and NMBE) and further cross-validated by checking the zone temperatures predicted by the model against the monitored data. The identified changes in the building, its systems and overall operations, that are verified during site investigations and had led to the creation of the calibrated model are assumed to be the key factors causing the gap. In the final stage, an operational baseline is created and the gap due to technical issues is calculated by reverting the technical changes in the calibrated model to their design intents. Fig. 2 explains the operational baseline and the two types of gap that constitute the actual gap . Applying this process across the case study buildings provides lessons that may also be applicable across the building sector along with an understanding of model calibration issues and unintended consequences on IEQ. The method is explained in greater detail below and diagrammatically presented in Fig. 3 . 3.1 Data collection First, the building’s design intents, and actual data were collected. Design data was collected from the design documents with details about the energy (1A) and IEQ (1D) targets, technical specifications of building systems (1B) and building operational parameters (1C). Actual data was collected during site-visits, recording metered energy use (2A) and documenting building technical and operational details (2B/2C). The actual IEQ performance (2D) was captured through regular monitoring of typical zones for Temperature, CO 2 concentrations (a proxy for fresh air), NO 2 (primarily a traffic driven pollutant) and PM 2.5 . 3.2 Comparison Design intended energy performance was then compared with the actual measured monthly energy use to quantify the magnitude of the performance gap (3A). Comparing the technical specifications and operations of the building and systems also gives insight into possible operational stage deviations (3B). 3.3 Modelling In the next stage, an initial design model (4A) was created using DesignBuilder V6.0 [31,32] based on the design data. This design model was then modified in accordance with actual operations (2C) and IEQ measurements (2D); and operational stage deviations (3B). Further calibration was undertaken by evidence-based manual fine-tuning of various input parameters. Actual weather as per station and satellite measurements for relevant location for the calibration period was obtained from DesignBuilder Climate Analytics tool [31,32] and was used in the simulations. The calibrated model (4B) was validated using the monthly calibration criteria of ASHRAE Guideline 14 (Cv(RMSE) < 15%; NMBE < ±5%). Also, hourly temperatures for typical weeks were compared against measured values (2D) in a sample space (Criteria used: MAE < 1 °C, RMSE < 1.5 °C). The intention of this stage is that once the calibrated model is created and validated then the deviations that were identified in 3B are considered to be verified. 3.4 Analysis and lessons The classification shown in Fig. 2 is used to assess each building’s performance. The deviations in 3B (and their potential causes) in relation to building’s use, operation settings, systems’ functioning and controls were classified into the differences that were due to change in operational requirement (5A) and those due to technical issues (5B) . The classification is done as per building performance evaluations and based on the understanding of the building characteristics. The deviations in operating conditions related to the changes in building function or occupancy and required by the building to perform its functions in practice were classified into 5A, whereas all the technical and technological shortcomings into 5B. Subsequently, to quantify the performance gap due to technical issues (5C) only, deviations relating to technical issues (5B) were reverted to their design intents as per 1B and 1C to create an operational baseline . This baseline reflected the actual operating conditions (such as modified space-time use of the building and its systems) needed by the building to perform its functions in practice but assumed the original design technical specification. Comparing the actual energy use with this baseline determines the actual energy performance gap arising from technical issues . After analysing all four case study buildings, common performance issues were identified and then used to suggest some remedies that can impact a large cross-section of the building stock (5D). Besides this, general lessons relating to model calibration and validation of results were identified (6A). The findings from IEQ data showing underperformance issues and conflicts related with energy objectives were also reported (7A).\n\nMethods\n3.1 Data collection First, the building’s design intents, and actual data were collected. Design data was collected from the design documents with details about the energy (1A) and IEQ (1D) targets, technical specifications of building systems (1B) and building operational parameters (1C). Actual data was collected during site-visits, recording metered energy use (2A) and documenting building technical and operational details (2B/2C). The actual IEQ performance (2D) was captured through regular monitoring of typical zones for Temperature, CO 2 concentrations (a proxy for fresh air), NO 2 (primarily a traffic driven pollutant) and PM 2.5 .\n\nConclusion\n4.1 Summary of building characteristics The case studies are typical examples of newly built buildings in their respective sectors. Table 3 describes their key information and Table 4 explains their design-stage construction and operational characteristics.\n\nResults\n4.2 Comparison of design stage (compliance/performance modelling) results vs actual energy use Fig. 4 shows the annual design stage (compliance/performance modelling calculation) energy use results and the actual energy use, comparing it with UK good practice benchmarks. The monthly breakdown of energy use for all the case study buildings is also shown. We discuss these numbers for each building below and point out key issues found during initial observations. 4.2.1 Office The building was procured under an energy performance contract within the Soft Landings Framework [74] . The design team, since project inception, regularly tracked the impact of their design decisions on energy used with the intention of ensuring that the very low energy use performance targets of the building could be met. However, Fig. 4 shows that the actual performance, two years after building handover was not at the desired levels. The design calculations, during concept design phase, determined the performance targets. These targets went beyond the restrictions of regulatory compliance calculations. The actual data was collected from the sub-meters installed on site. Initial observations suggested that some of the increase in gas use is because the heat pumps, designed to use rejected heat from the servers to heat the building, had technical problems. Consequently, the gas-fired boilers provided all the heating. In spite of this gap, due to the stringency of the targets and the use of performance contracting, the building’s actual performance compares favourably against the good practice benchmark [22] for naturally-ventilated public office buildings in the UK. 4.2.2 School There are eight buildings on the campus. During the campus’s redevelopment, six new buildings were constructed, and two existing ones were refurbished. Along with an overall campus level assessment, detailed performance issues were assessed in one of the teaching buildings. The school was installed with a biomass boiler to reduce its gas use and minimise carbon emissions. The design stage projections were taken from the calculations done as a part of the UK Building Regulations (Part L) compliance. The actual performance was recorded from the Building Management System (BMS). A significant underestimation of energy use of the teaching building is shown in Fig. 4 , mainly because design regulatory calculations were used as design projections. Despite being a new building, gas and electricity use is 1.5 times and 2.5 times more respectively, when compared to the good practice benchmarks [22] . Some of the deviation could be because the biomass boiler installed was not used due to logistic issues of handling of the biomass. Also, site observations suggested that building was occupied after school hours and during half-term breaks and school holidays. 4.2.3 Hospital This building is a new ward complex built within an existing campus and is classified as an ‘acute hospital’ [16] . The design stage projection of energy performance was done as a part of UK Building Regulations (Part L) compliance. The actual electricity use was obtained from the BMS. The energy use projection in Fig. 4 differs from the actual use significantly. Besides the perceived gap issue, one of the main reasons for underestimation of the gas use is ongoing use of the low efficiency district heating system, which, as per design intent, was to be replaced by a new high efficiency Combined Heat and Power (CHP) system. Furthermore, monthly trends show a significant gas use during the non-heating periods (Jun-Sep). This base demand is primarily for hot water use, which in hospitals in the UK has been reported to constitute a significant proportion of total energy use [30] . 4.2.4 Apartment The apartment block consists of 98 flats across two towers. Performance issues were assessed for the entire apartment block with a detailed investigation of a typical flat. Fig. 5 shows the spread of energy use in all flats. The typical flat selected for detailed analysis and calibration has energy use near the average value across the flats in the apartment block. The design performance was calculated for building regulation compliance whereas the actual monthly gas and electricity use were obtained from the utility bills. Fig. 4 shows that while actual gas use was marginally more than the design estimates, the actual electricity use had much more deviation because the equipment energy use was not reported in the total energy use in the design calculation. In the monthly energy use data, reduction in heat demand in April and May and increase in Jun and July can be attributed to change in occupancy (such as holidays and guests) and other epistemic uncertainties of occupant behaviour such as opening of windows in summer months. These can be explored further and validated using calibrated models.\n\nResults\n4.3 Key performance issues identified and reasons for the performance gap Some of the possible operational stage deviations areas, observed during the data comparison stage (3B in Fig. 3 ) were further fine-tuned (along with identification of more issues) during the calibration stage to create a calibrated model (4B in Fig. 3 ). The calibration process validated the identified issues by ensuring that the changes made in the calibrated model can account for most of the performance gap. Analysing the deviation of the model input parameters in this calibrated model against the as-design model, the key performance gap issues were listed. Then based on engineering judgement, these issues were categorised as per their root causes into either those related to changes in operational requirements or those arising from technical issues. Table 5 lists all the factors responsible for building underperformance that were validated through model calibration. The classification of the factors into changes in operational requirement and technical issues are undertaken as part of performance gap assessment (5A and 5B in Fig. 3 ). However, for brevity, these have been shown in conjunction with the parameters changed for calibrated model (4B in Fig. 3 ). Fig. 6 shows calibrated simulation results with their statistical error values. To ensure the calibrated model reasonably reflected the actual building’s operation, Fig. 7 shows the temperature trends for typical days for a few monitored spaces in all the buildings. The simulated temperatures closely follow the measured air temperature, except the few instances where there are some deviations. For example, there is a dip in simulated temperatures in the office during the weekends. Similarly, overnight simulated temperatures over the weekend in the school are lower than the monitored values. Also, the modelled radiant temperature is sometimes less than the modelled air temperature in some building types due to a poor thermal envelope and the subsequent heat losses. For example, in the case of the office, thermal imaging of the envelope revealed leakage through poorly sealed vents and at construction junctions ( Fig. 8 ). Similarly, in the school significant thermal bypasses around insulation was observed and verified with U-value measurements ( Fig. 9 ). These are consistent with the issues identified in Table 5 . The deviations observed reduce over the longer periods. More fine tuning of the calibrated model, at high resolution, can match these deviations but in the context of monthly calibration for assessing the causes of the performance gap, the current accuracy is deemed sufficient. Overall MAE and RMSE for the hourly temperatures in Fig. 7 are less than 1 °C and less than 1.5 °C respectively.\n\nResults\n5.1 Cross-sectoral performance issues 5.1.1 Design stage energy projections: The use of regulatory compliance calculations as the design stage predicted performance may underestimate the actual energy use significantly and lead to a perceived gap ( Fig. 10 : the school, the hospital and the apartment block). To avoid this perceived gap , realistic estimation of energy use at the design stage should be mandatory, calculated as per CIBSE TM54 guidelines or other equivalent protocols. This was carried out in the office building where, a contractually mandated performance target to beat the operational benchmarks was the driver for the design team to undertake realistic calculations. 5.1.2 Performance targets and contractual accountability Due to a strict operational performance target the overall energy use in the office is not just lower than other building types ( Fig. 10 ), but also much lower than the benchmarks within its building category. Performance contracting, integrated within a Soft Landings framework, guaranteed the involvement of the contractor and the designers after the handover to fine tune the building operations and fix issues related to design, construction and commissioning. Increased accountability also leads to robust construction quality checks, thereby mitigating issues such as significantly high U-values seen in the school or cold bridges in the apartment block. One of the challenges in performance contracting is the contractual period, which might determine the sustainability measures used. Also, if key sustainability measures that are beneficial in the longer term are not safeguarded from the start, some may be value engineered out within the construction process. Another challenge is to objectively define the targets and the metric to use, i.e. ensuring that the metrics are in alignment with the actual intent. For example, targeting net carbon emissions may result in a different approach than when the focus is on energy use only. Also, in certain building types, such as hospitals, current benchmarks have very broad categories. As seen in the case study, within each category the energy demands can vary significantly as per the specialised services provided. In these cases, energy analysis and benchmarking need to look beyond the entire building and consider departments or other sub-spaces as the unit of analysis. 5.1.3 Uncertainties in building use Operational uncertainties also affect the design prediction. Occupant behaviour is uncertain and has a significant effect in cases when occupants have high degree of control, such as in apartments. Small events can affect a flat’s energy use significantly, such as a sharp drop seen in energy use during holiday time in the case study flat. This is also a reason for the wide variation in the energy use of the 98 flats ( Fig. 5 ) within the apartment block. In most large non-domestic buildings, the services are controlled centrally by building managers, limiting the occupant effect to manual overriding of zone thermostats and operation of windows. To address them, sensitivity and scenario analysis can be used to take informed design decisions and operational safeguards regarding the most important factors. 5.1.4 Transitionally/seasonally occupied buildings and changing user patterns Contrary to design assumptions, nowadays schools have higher space-time utilisation. Beyond the regular school hours, the case study school had partial occupancy for evening/holiday schools and out-of-hours extracurricular activities. However, the building services were not tuned for low occupancy, out-of-hours running. A centralised system design (one control and sensor for multiple zones) led to multiple spaces (including the unoccupied ones) being conditioned during the transitional occupancy times. The ability to hydraulically isolate the unoccupied areas and use decentralized controls is beneficial in these scenarios. Flexible space use, including hot desking in offices, is another practice used to manage transitional occupancy. In the office building, hot-desking was implemented in conjunction with hydraulic isolation. It was assumed that during low occupancy times all the users could work in one part of the building, keeping the rest of the building shut. However, due to the departmental nature of the occupant organisation, it was not achieved in practice. Regular users occupied their usual desks within the part of building where their department was located. 5.1.5 Use of new and innovative low-carbon technologies The technologies used across the case studies were partly effective. In the office, the innovative strategy of using free heat from server rooms was not successful due to technical issues. In the school, driven by the local council’s intention to use and promote low carbon technologies, a biomass boiler was installed. However, due to the enhanced logistics needed to manage the fuel, the biomass boiler was not operational post-handover. In the hospital too, the new CHP system, agreed at the campus level at design stage, has not been installed due to budgetary constraints. Therefore, while there was an intent, lack of follow-up and checks meant that the intended benefits were not achieved. 5.1.6 Protocols for managing building operations Some of the performance issues in the case studies were due to sub-optimal operations and irregular maintenance. In the office, delays in resolving issues with sensors and automatic roof vents meant that some of the vents were either left open or remained closed. In the apartments, management of the Mechanical Ventilation with Heat Recovery (MVHR) system and replacement of filters was the responsibility of individual occupants. However, the occupants were either not aware of it or did not understand the need/requirement of regularly changing them. An effective building operation and management strategy envisaged in design and incorporated at handover would help manage these issues.\n\nResults\n5.1.2 Performance targets and contractual accountability Due to a strict operational performance target the overall energy use in the office is not just lower than other building types ( Fig. 10 ), but also much lower than the benchmarks within its building category. Performance contracting, integrated within a Soft Landings framework, guaranteed the involvement of the contractor and the designers after the handover to fine tune the building operations and fix issues related to design, construction and commissioning. Increased accountability also leads to robust construction quality checks, thereby mitigating issues such as significantly high U-values seen in the school or cold bridges in the apartment block. One of the challenges in performance contracting is the contractual period, which might determine the sustainability measures used. Also, if key sustainability measures that are beneficial in the longer term are not safeguarded from the start, some may be value engineered out within the construction process. Another challenge is to objectively define the targets and the metric to use, i.e. ensuring that the metrics are in alignment with the actual intent. For example, targeting net carbon emissions may result in a different approach than when the focus is on energy use only. Also, in certain building types, such as hospitals, current benchmarks have very broad categories. As seen in the case study, within each category the energy demands can vary significantly as per the specialised services provided. In these cases, energy analysis and benchmarking need to look beyond the entire building and consider departments or other sub-spaces as the unit of analysis.\n\nMethods\n5.4 Application of the current approach This process, aimed at early stages of post occupancy can be easily integrated within the existing project procurement routes that focus on operational performance outcomes such as Soft Landings [74] . For example, the office building covered in this paper was procured within a Soft Landings Framework. Most of the processes during design and construction in the Soft Landings run alongside normal procurement practices without much duplication and extra work. The only elements that require additional effort are aftercare activities needed during the initial years of operation, where the approach presented in this paper could be integrated. Depending on the complexity of the project, the cost of these activities can be estimated at around 0.1%–0.25% of total contract value [17,51] . The extra effort and resources required for integrating the Soft Landings framework or other similar frameworks is minimal and can usually get paid back swiftly because of the reduced building operating costs.\n\nConclusion\n6 Conclusions This detailed analysis of the performance gap across multiple buildings provides insights into the performance issues applicable across the UK building sector. Identifying and verifying performance issues using evidence-based model calibration is a novel and robust approach to increase the likelihood that all key issues are found. The calibrated model, when validated statistically for energy use and also for dependent parameters such as space temperatures, ensures that it could be reasonably used for assessing deviations from the design intents. Using this simulation-based approach enables a systematic identification and classification of the root causes of the performance gap, which would not have been possible otherwise. Root causes identified across the case-studies were due to three factors, (i) a perceived gap due to use of inappropriate design-stage calculation methods, (ii) technical issues with the building, its systems and their operations, and (iii) operational changes that the building has gone through in order to meet its functional requirements. While the first can be dealt by improving industry practices and the third is a change brought by necessity, the gap due to technical issues require attention and correction to ensure that the building functions most optimally. The technical issues identified across the case studies were either due to design errors, improper construction and installation, poor commissioning or due to issues with the low-carbon technologies. It was observed that long term involvement and responsibility for the performance given to the design and construction teams are effective in lowering the performance gaps. Including this approach through performance contracting ensures that after handover the technical issues are addressed, and building is well managed. Additionally, policy measures and safeguards are essential to ensure energy efficiency measures and low carbon systems specified at design stage will be effectively used in practice. The focus on energy efficiency alone as the performance objective in buildings built with low energy use intentions may lead to unintended IEQ concerns (such as poor IAQ and overheating). Issues observed across the case studies have shown the need to address IEQ simultaneously with energy through better design, advanced operational controls and most importantly incorporate regular IEQ measurements. Including IEQ within the performance contracting framework for energy will help address the trade-offs that happen during operational stage and the unintended health consequences to the occupants.\n"
  }
}