{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nHuman-aware HAVC operations have been shown to be effective in improving energy efficiency, which is constrained by the HVAC system configuration and operational logic. These constraints can result in a lack of operational flexibility, which in turn reduces the adaptation capacity for energy efficiency. Therefore, in this study, we investigated the energy efficiency implications of novel adaptive capacities for HVAC including the use of proposed active diffusers, which add to the dynamics of the HAVC systems by adjusting the behavior of diffusers using two modalities of (1) binary actuation of air flow (turning flow on and off), and (2) adjusting the flow direction to target individual needs in an environment. Computational fluid dynamics was used to model and simulate the behavior of a “real-world” thermal zone to evaluate five scenarios of adaptive operations using distributed feedback from the environment, as well as active diffusers. Three scenarios used binary actuation at the thermal zone (collection of rooms) level, and two examined the adaptive operations at the diffusers level. Moreover, we examined the integration of distributed feedback at occupant locations into the control loop using averaged temperatures (in the first three scenarios) and individual-level feedback (in scenarios with diffuser level actuation). The coupling of distributed feedback and independent directional flow at the diffuser level considerably improved thermal comfort while reducing energy demands by ~25%—reflecting a considerable impact on improved energy efficiency. These findings demonstrate the potentials that artificial intelligence frameworks could bring about by enabling autonomous adaptive operations.\n\nMethods\n3 Adaptive operation assessment methodology 3.1 Control strategy The premise of this study centers on evaluating adaptive control frameworks in indoor environments, and thus, the methodology is based on simulated scenarios of operations in a surrogate model of a thermal zone and the associated energy efficiency implications. We have proposed a new paradigm of control strategy for added adaptation capacity through the concept of active diffusers – i.e., robotic diffusers with non-intrusive sensing for locating occupants (e.g., by using infrared thermal array sensors [ 12 ]) and additional degrees of freedom for adaptive air flow adjustments (both throughput and direction of air flow) to target the location of need (occupants' surrounding). The concept of active diffusers draws on the notion of personal air conditioning that has received attention in research and through initiatives such as ARPA-E’s DELTA Program [ 63 ], which seeks to achieve energy efficiency by using Localized Thermal Management Systems (LTMSs). The LTMS concept has been defined as modifying the physical space around the human body rather than the entire building to service energy. Fig. 1 illustrates the concept of using active diffusers and distributed feedback in the vicinity of the users. The adaptation, in this study, has been represented from different perspectives: (1) distributed feedback from individual user locations (measuring comfort-proxy in the vicinity of occupants), (2) binary control (shutting a diffuser on-off) of diffusers in sub-spaces, and (3) binary and directional control at the location of diffusers. These strategies could be realized given the prevalence of IoT-enabled technologies. For example, distributed measurement of temperature could be achieved through portable sensing technologies that are paired with mobile devices such as smartphones [ 64 ] or IoT-specialized portable temperature sensing systems (e.g., Ref. [ 65 ]), as shown in Fig. 1 . These measurements could be also communicated to smart thermostats (e.g., ecobee) in the new paradigm of smart building systems. Alternatively, sensors that enable the inference of thermal comfort, such as wearables that measure skin temperature, could be used. Other technologies, such as adaptive sub-zoning by using smart vents with on/off control (e.g., Keen smart vents) in residential buildings, are also receiving attention in recent years [ 61 ]. Accordingly, the control strategies, in this study, will be affected by two main parameters of sensor location and the adaptation capability of diffusers. The scenarios that we have explored were compared against the legacy control strategy as the baseline: • Scenario 1 (Baseline) – Binary control at the air supply unit (i.e., VAV box) by feedback from a central thermostat. This control strategy switches the air supply to the entire thermal zone on and off depending on the temperature measurement at the thermostat location. Air is distributed uniformly from the diffusers. • Scenario 2 – Binary control at the air supply unit ((i.e., VAV box) by feedback from a thermostat that is connected to distributed sensors. The air supply to the entire thermal zone is switched on and off depending on the averaged distributed temperature measurements at the occupants' locations. This strategy reflects the notion of control based on personal thermal comfort preferences [ 6 ]. Averaging temperature will reduce the bias of only accounting for the temperature variation at the location of the central thermostat. Air is distributed uniformly from the diffusers. • Scenario 3 – Scenario 2, augmented with directional control of the supplied air at the diffusers. Similarly, the feedback from the distributed sensors (average temperature) near the occupants is used to control the operation of the VAV box. This scenario investigates the energy efficiency impact of directional flow for user-centered conditioning [ 63 ] and distributed feedback. • Scenario 4 – Binary control at individual diffuser level by independent feedback from distributed sensors at occupants' locations. Air is distributed uniformly from the diffusers, but the air to individual diffusers could be shut off once the condition in one sub-space reaches a satisfactory condition. • Scenario 5 – Binary and directional control of the air supply at individual diffuser levels by independent feedback from distributed sensors at occupants' locations. This is the most flexible actuation approach that enables the HVAC system to target the location of demand. Given that the dynamics of air and the associated temperature distribution is critical in evaluating these scenarios, we have used CFD to simulate and predict the air dynamics with high-fidelity calculations as a case study. The simulations were based on a real thermal zone with an imbalanced behavior – i.e., the temperature distributions in sub-spaces of the zone could be different with discomfort for occupants in sub-spaces. Fig. 2 shows the layout and characteristics of this thermal zone, which includes three rooms, served by a VAV box, two of which have windows facing south to the outside environment. Each room has a diffuser and an exhaust and can be isolated from the other rooms by doors. The fixed thermostat is in Room A (near the door adjacent to Room C), as shown in Fig. 2 . Scenarios 3–5 simulate the actuation at the diffusers. In a real-world implementation of such a system, the control loop would also include actuation and flow adjustment at the VAV box. We assumed a constant flow rate through each diffuser with constant temperature for different durations according to the demand. Therefore, the complete control loop for the VAV box behavior is not included in the scope. All three rooms are considered occupied although Rooms B and C are accessed through Room A. Fig. 3 (a)-(b) show the schematics of the air distribution method used for uniform and directional air distributions, respectively. The diffuser behavior was modeled in CFD simulations through boundary conditions and user-defined functions. 3.2 CFD simulation details The CFD simulations were performed using the commercial software ANSYS Fluent (18.0) [ 66 ] and its user-defined function capabilities. We have modeled the time-dependent behavior of air flow using the governing equations for mass, momentum, and energy. The Boussinesq approximation was used to model natural convection, which treats density as a constant value except for the force term in the momentum equation. The realizable k-ε model [ 67 ] was employed for turbulence modeling and the discrete ordinate model with solar ray tracing was used to solve for the incident solar radiation. The segregated pressure-based Navier-Stokes (PBNS) solver was used to numerically solve the incompressible system of equations, and pressure-velocity coupling was solved using the semi-implicit method for pressure-linked equation (SIMPLE) algorithm. Furthermore, the least squares cell based (LSCB) and the pressure staggering option (PRESTO!) schemes were employed for spatially discretizing gradients and pressure, respectively. The momentum, energy, turbulent kinetic energy and dissipation rates, and discrete ordinate were discretized using second-order upwind methods. A first-order implicit method was employed for time marching with a constant time step size of 0.05 s, for which the Courant Friedrichs-Levy (CFL) number was between 0.5 and 1. As illustrated in Fig. 2 , the computational domain was extended 1 m beyond the exterior (southern) wall to represent the outdoor environment and model the effect of solar radiation on the exterior wall. Windows in rooms B and C were 1.5 m and 2.2 m wide, respectively, and 1 m high. The occupants were modeled as parallelepipeds with a height of 1.5 m (considering a seated position) and a width of 0.35 m on each side. The human thermal load was 75 W heat release from each individual in Rooms B and C, and 150 W for Room A, representing two occupants [ 68 ]. Diffusers and exhausts have dimensions of 0.3 m by 0.3 m. In all scenarios, air at 13 °C (~55 °F) was supplied through the diffusers at a rate of 0.0567 m 3 /s (or 120 cfm). For uniform diffusion, the conditioned air was uniformly supplied in all directions with an angle of 30° from the ceiling. For active diffusers, the flow was directed by a vector from the diffuser towards the occupant location (75 cm from the floor). Exhausts had a return duct gauge pressure of −24.88 Pa. The boundary conditions for the outdoor boundaries were set to an ambient pressure of 1 atm and temperature of 27 °C to consider a summer day conditions. The solar radiation was modeled on the walls and through the windows. The solar intensity was calculated using the direct solar irradiance data provided by NREL [ 69 ]. The solar irradiance, for the location of the simulated thermal zone, ranged between 4.5 and 5.5 kWh/m 2 . The longest summer day of 14 h with a constant solar intensity of 350 W/m 2 on the south-facing windows were used. The shades at the windows were assumed to transmit only 80% of the incident solar radiation into the rooms. Given the building's materials, dolomite was considered for the exterior wall. All the interior walls were modeled adiabatic assuming negligible conduction through the interior walls with no-slip condition for fluid-wall interactions. The characteristics of the boundary conditions are summarized in Table 1 . 3.3 Control strategy modeling We implemented user-defined functions (UDFs) to simulate different control logics. Each scenario was evaluated over 60 min for energy efficiency that was measured based on the energy use for achieving comfort. All the doors were assumed closed, allowing no interaction between the rooms – a reflection of actual operation in the testbed. The thermal comfort was achieved by adjusting the ambient temperature until it reached a setpoint in the vicinity of the thermostat. In commercial settings, a temperature deadband (i.e., upper and lower setpoints) is set to keep the temperature within a comfortable range. Similarly, in our analysis, the temperature was controlled by using a temperature deadband (following the logic of thermostats) of 21.6–23.3 °C (71–74 °F). 3.4 Grid sensitivity and CFD validation A grid resolution sensitivity assessment was conducted using the grid convergence index (GCI) to determine the discretization error for grid-independent solutions [ 70 ]. Room A was simulated using four meshes with varying numbers of cells, i.e., 38 k (mesh 4), 98 k (mesh 3), 164 k (mesh 2) and 663 k (mesh 1), and the average room temperature was used to compute the GCI. Fig. 4 shows the temperature changes for each mesh when the diffuser turns off at approximately 275 s. Using the numerical methodology described in Ref. [ 70 ], the GCI was below 0.1% for each pair of consecutive meshes, which indicates an extremely small discretization error. Therefore, a moderate mesh size (mesh 3) was adopted to model each room, and further cell refinement was applied in the vicinity of the occupants, diffusers, and exhausts; the entire domain utilized 300 k cells. The experiments by Loomans [ 71 ] for supply airflow in a climate chamber, representing an office room was modeled and simulated to further validate the efficacy of the proposed CFD modeling. Fig. 5 shows the 3D model that replicates the experiments with an air-supply below a desk (0.047 m 3 /s at 19.8 °C), two computers (61.5 W each), a personal light source (10.9 W), ceiling lights (18.1 W per light), and an exhaust. Walls, floor, and ceiling are maintained at constant temperatures (22.2–23.2 °C). The occupant has a surface area of 1.6 m 2 and releases 59.8 W of heat. The only subtle difference is our parallelepiped occupant modeling. Loomans [ 71 ] collected temperature and velocity data at various locations within the room, and select data are presented here. The temperature measurements (using T thermocouples with an accuracy of ±0.1 °C) were compared with CFD in Fig. 6 (a) at z = 1.93 m at three x- locations. The velocity measurements (using a hot sphere anemometer, reliable for velocities greater than 0.1 m/s with an accuracy of ±0.025 m/s) were compared with CFD in Fig. 6 (b) at z = 2.3 m. There is a lack of experimental velocity data below 1 m where the air motion was very small. Overall, there is very good agreement between the experiments and CFD predictions, validating our approach to model the HVAC system of an office. It is worth noting that Stamou and Katsiris [ 72 ] also verified their CFD models with the data of Loomans and demonstrated similar agreement.\n\nResults and Discussion\n4 Results and discussion The simulation scenarios, including the sensing and actuation conditions are in Table 2 . 4.1 Scenario 1: uniform air distribution controlled by thermostat in Room A (baseline) Figure 7 (a) shows the temporal variation of average room temperatures controlled by the thermostat in Room A and Fig. 7 (c) presents the temperature contours at neck height (1.25 m) and at t = 60 min. The temperature across all the rooms was initially 25 °C when conditioning started from an HVAC off state. Therefore, the initial drop in temperature and its rate of change were higher compared to the next cycles. The temperature decreased steadily with a lower rate in Rooms B and C due to heat gain through exterior windows and walls. The air conditioning initially turned off at 7 min-21 s when the thermostat in Room A reached the cutoff temperature of 21.6 °C even though temperatures in Rooms B and C were far above the thermal comfort range. Note that the temperatures in Rooms B and C rise above the initial conditions after the initial drop. The temperatures in Rooms B and C continue to rise to uncomfortable states with additional conditioning cycles demonstrating that the HVAC cannot meet the required cooling load due to the control logic of receiving feedback in Room A resulting in a bias in the control loop. The off-cycle duration is relatively long compared to the on-cycle duration because of the small heat gain in Room A. This observation reflects the actual daily operations in the zone, in which acceptable temperatures in Rooms B and C require a setpoint of 20 °C. The average temperature of Room A is fairly close to the thermostat temperature because the room is completely isolated from the exterior environment and the doors to Room A are closed. The average temperatures in Rooms B and C are almost the same, however, a difference in the temperature near the occupants (averaged around neck and ankle) can be seen in Fig. 7 (b), where the surrounding temperature of occupant B, who is located farther from the window, is cooler. Cooler regions can be noticed in each room under the diffusers. The average time of the air supply (i.e., on time) per cycle for all diffusers was approximately 5 min and 30 s. 4.2 Scenario 2: uniform air distribution controlled by average temperature in the vicinity of occupants To eliminate the bias of measuring temperature in only one sub-space, the combined average temperatures of the occupant surroundings in each room was used for context-aware control. As noted, this distributed feedback could be obtained through portable thermostats (similar to ecobee) or mobile wearable devices. Figure 8 (a) shows the temporal variation of average room temperatures. The solid lines indicate the average temperature close to the occupants, which was used as the control feedback. This approach improved the thermal condition in Rooms B and C, but resulted in a drop in temperature in Room A considering that higher cooling loads are needed in Rooms B and C. This is the pattern that is observed in reality where occupants keep adjusting the temperature setpoint on the thermostat for comfort. Since thermal comfort ranges, in Rooms B and C, were effective in driving the control signal, the initial cooling duration (from HVAC off state and initial temperature of 25 °C) is longer for Scenario 2 (~10 min) compared to Scenario 1. The temperatures, in Rooms B and C, ranged from 22.5 °C to 25 °C within the cycles, which are closer to thermal comfort ranges compared to Scenario 1, where temperatures reach 25 °C after two cycles. However, the temperatures increase slightly in Rooms B and C as the cycles continue, but drop below 20 °C in Room A, which may cause discomfort especially for a room without sunlight. Figure 8 (b) shows the difference in temperatures at occupants’ neck height after 1 h when the cooling cycle ends. The temperatures in Rooms B and C are close to 23 ○ C, which shows that these rooms could not be cooled below this limit. The average time of air supply (HVAC on) per cycle was 7 min 22 s, higher than Scenario 1, reflecting a higher need for cooling load and thus higher energy consumption. Nonetheless, this increase in energy consumption does not assure the simultaneous conditioning of all rooms to thermal comfort. This is an indicator of the lack of flexibility in control of the HVAC system. In other words, accounting for personal comfort in a centrally controlled HVAC system, resulted in increased energy use with no guarantee of satisfactory indoor conditions for all occupants. 4.3 Scenario 3: directional air distribution controlled by average temperature in the vicinity of occupants This scenario examines how directional air flow could contribute to achieving energy efficiency. In the envisioned system, active diffusers communicate with the distributed sensors for information on occupants' locations and surrounding temperatures. The locations of the distributed sensors are used to determine the direction for the air supply. Figure 9 shows the temperature variations. We observed an increased number of cycles and decreased duration of cycles (six cycles compared to four for Scenario 2). Through directional flow, HVAC only provides conditioning for the occupants' surroundings instead of the entire space, and thus, the duration of cycles decrease. Moreover, temperatures close to occupants are lower compared to the previous scenarios ( Fig. 9 (b)), demonstrating the potential of directional flow in providing personal thermal comfort even in a warm environment. It is also seen that demand targeting can still provide conditioning for the entire space that is important for temporary occupants. The initial cooling time of 6 minutes–24 s is nearly 34% lower compared to 9 minutes-43 s in Scenario 2 with a shorter average cooling time per cycle of 3 minutes–11 s (a total of 23 minutes–43 s) – showing energy saving potentials of directional flow through active diffusers. Considering energy use correlation with the volume of supplied air, the reduced durations (71.1 min compared to 96.3 min in Scenario 2) leads to reduced energy use. However, occupants’ thermal needs were not sufficiently satisfied. While occupants in Rooms A and C are experiencing cool regions, occupant in Room B is not completely affected by conditioned air. This may be due to farther distance between the diffuser and occupant in Room B and the impact of the air circulation. In addition to temperature, an important factor for thermal comfort is the air speed close to occupants and it is discussed in Section 4.6 . 4.4 Scenario 4: uniform air distribution controlled at individual diffuser level by independent temperature feedback from distributed sensors The previous cases showed the lack of flexibility (i.e., adaptation capacity) in providing comfortable temperature ranges for occupants. This rigidity stems from binary control of air supply on a centralized unit. All diffusers simultaneously cycle on and off regardless of the need in sub-spaces. However, these rooms are subjected to different thermal loads, hence, require different thermal conditioning. To achieve independent sub-space control of air supply, Scenario 4 simulates binary air flow control at the diffuser level using legacy diffusers for uniform air supply – i.e., turning diffusers off in each room based on feedback from distributed sensors. Figure 10 (b) shows the capability of this approach in satisfying expected thermal comfort ranges (21.6 °C–23.3 °C) in each room. However, to achieve this objective, diffusers in Rooms B and C remain on for the entire time. Rooms B and C were maintained at 22.3 °C and 22.1 °C with occupant temperatures reaching 21.75 °C and 21.95 °C, respectively. Given the cut-off bound of 21.6 °C, the diffusers in these rooms did not cycle off. The constant temperatures in Rooms B and C indicate an equilibrium between the heat gained from radiation and heat extracted by air conditioning - showing the need for additional conditioned air. In a full control loop, which engages the VAV box, cutting off air to one diffuser could direct the air discharge to other diffusers for an increased cooling load to rooms B and C. The temperature contours show similarity across the zone with occupant temperatures within the thermal comfort range (21.6 °C–23.3 °C). The conditioned air directed towards the wall ( Fig. 10 (c)), could be directed towards the occupant to extract the excess heat received from solar radiation in Rooms B and C and provide comfort without excessive energy use as described in Scenario 5. 4.5 Scenario 5: directional air distribution controlled at individual diffuser level by independent temperature feedback from distributed sensors Compared to Scenario 4, achieving higher levels of flexibility is feasible by augmenting the diffusers with the directional flow. Scenario 3 demonstrated that directional air flow improves thermal satisfaction while consuming less energy. Combing these two approaches, in this scenario, we evaluated directional air flow with independent control in each sub-space. The direction of flow remains fixed for the entire simulation as occupants are stationary. As Fig. 11 (a) presents, Room A requires longer off cycles and shorter cooling time compared to Rooms B and C. Room C requires the longest initial cooling time as the distributed sensor is subjected to solar heat flux. The average cooling time per cycle for Room C with a larger window (~9 min) was more than Room B (~8 min). Figure 11 (a) and (b) show that the average room temperature in Room A is higher than the occupant temperature at any given time, which implies the personalized conditioning of the air surrounding the occupant in Room A. In Room B, the cooling time per cycle decreases as time progresses indicating a highly transient behavior. Figure 11 (c) presents the temperature contour at neck height (y = 1.25 m) after 1 h. The average temperature of room A is higher than Rooms B and C because the diffuser is at the end of the off cycle (approximately off for 30 min). Blue regions in rooms B and C represent cooler air, directed towards occupants, showing the increased efficiency of cooling. The initial cooling time in Room A decreased from 7 min to 4.5 min comparted to Scenario 4, where conditioned air is lost near the walls due to the uniform supply of air. The three-dimensional view for uniform (Scenario 4) and directional (Scenario 5) flows are shown in Fig. 12 at t = 60 min. In each view, streamlines are superimposed with temperature contours to investigate the velocity-temperature coupling. There is a vertical plane shown in each room located at the center of each diffuser to provide an additional visualization of the airflow patterns and corresponding temperatures. Note that the diffuser in Room A is off for both cases at this instance. Therefore, the observed streamlines in Room A are due to natural convection. The temperature contours present the detailed thermal profile in each case: • Low-temperature regions in Fig. 12 (a) – i.e., darker areas on the planes near the walls of Rooms B and C – confirm that part of the conditioned air is consumed to adjust the wall temperature due to uniform diffusion. The streamlines in Room C show that air moves downward along the wall due to buoyancy. Streamlines in Room B show a portion of air moving towards the window and door. Although the distribution of air in all directions provides overall better circulation, it does not guarantee thermal comfort. • Figure 12 (b) clearly shows air directed towards the occupants in Rooms B and C. The diffuser in Room A is off as the setpoint was satisfied; hence, no directional flow is observed. The streamlines of the air jet leaving the diffusers elucidate the low-temperature zones (blue region) on the middle planes of Rooms B and C. The cooler air leaving the diffuser does not follow a linear path, moves in the downward direction, most likely due to buoyancy. Additionally, as it is not subjected to solar radiation, the floor in Room A (in both cases) is at a lower temperature than the other rooms. As expected, a vertical temperature gradient is seen in the plane of Room A as the layer of warm air becomes more prominent as time progresses. 4.6 Thermal comfort implications Thermal comfort is affected by factors such as ambient temperature, relative humidity, radiant temperature, and air speed. We assessed the performance of different scenarios according to thermal comfort requirements by ASHRAE [ 73 ]. This is important given that directional flow could increase air speed in the vicinity of occupants. The ASHRAE acceptable air speed is determined according to a number of factors including access to control, thermal conditions, and human-related variables such as clothing insulation and metabolic rate. For occupants with control of air flow, there is no recommendation upper air speed limit. We assumed no occupant control, and therefore, the maximum acceptable air speed for typical office activities and clothing level in summer is: (1) t o > 25 . 5 ° C → V a = 0 . 8 m/s 23 ° C < t o < 25 . 5 ° C → V a = 50 . 49 − 4 . 4047 t o + 0 . 096425 t o 2 m/s t o < 23 ° C → V a = 0 . 2 m/s in which, t o is the operative temperature and V a is the average air speed around an occupant. Operative temperature could be calculated from average ambient temperature ( t a ) and radiant temperature around an occupant [ 74 ]. For cases that occupants are not under direct solar radiation (as is the case in this study), the difference between average ambient temperature and radiant temperature is negligible [ 75 ], rendering the t o to be considered equal to t a . Table 3 shows temporal average temperature and speed around occupants for the last cycle before and after thermal conditioning, as well as the acceptable maximum air speed. Four points around the neck and four points around the ankle were averaged to determine the average temperature and speed for an occupant. Based on the temperatures and velocities, the following can be gleaned: • In Scenario 1, occupants in Room A experienced thermal comfort during the on-off cycles unlike occupants in Rooms B and C with temperatures higher than the initial indoor condition of 25 °C. • In Scenarios 2 and 3, occupants in Rooms B and C experienced lower temperatures compared to Scenario 1. However, in room A, the temperature reaches near 20 °C below the acceptable range. • All occupants are within comfort range for Scenarios 4 and 5 with better performance for Scenario 5. As expected, the speed at occupant location is higher for directional flow. In Scenarios 3 and 5, the air speed around the occupants surpass the acceptable maximum, specifically for Room C. Equation (1) shows that thermal comfort is driven by operative temperature and the air speed around the occupants. Therefore, as a potential adaptive capacity, active diffusers could adjust the directional flow to opt for higher temperatures with higher air speed near occupants for thermal comfort with lower energy use. Alternatively, the angle of directional flow with respect to the ceiling could be constrained to avoid direct air flow towards occupants. These are some of the potential modifications that will be part of future research directions. 4.7 Energy consumption The primary goal of using directional flow is energy conservation while maintaining comfort. Table 4 presents the total duration of supplying conditioned air during the 60-min simulated operations. To compare the energy consumption of different operational scenarios, we have used the total volume of conditioned air, supplied to the thermal zone, during the 1-h simulation as the indicator of the energy consumption in Table 5 . It has been shown that the air flow to thermal zones is linearly correlated with the energy consumption of HVAC systems [ 56 ]. The supply air temperature is also an important factor in driving energy consumption; however, since this temperature was constant across all scenarios, we only used air flow for comparisons. The total volume of air was calculated by multiplying the air supply durations in Table 4 by the air flow rate at each diffuser. Although the total cooling time for Scenarios 4 and 5 is more than Scenarios 1–3, thermal comfort was only achieved for Scenarios 4 and 5. We used the following formula to measure how effective each scenario was in keeping the temperature close to the preferred temperature (i.e., setpoint): (2) Δ c = ∑ | T i − T r | Δ c is the discrepancy between occupants' temperature and the setpoint of 22.3 °C ( T r ) , and T i is the average occupant's temperature through an on-off cycle (we used the average of lowest and highest temperatures around occupants during one cycle). The room-level and zone-level values for Δ c have been presented in Table 5 . • In Scenario 1, the legacy control logic does not provide comfort in Rooms B and C, thus, the lower energy demand is not representative of the real-world operation. The outcome was similar to having a thermal conditioning system only in Room A as the Δ c values in Rooms B and C indicate. Therefore, in the following assessments, we have considered the second scenario as the baseline. • By integration of distributed feedback, Scenarios 2 and 3 yielded better Δ c across all rooms although the overall Δ c is similar to Scenario 1. In other words, these scenarios help improve the fairness across the thermal zone. However, Scenario 3 (which uses the envisioned directional flow) has resulted in reduced energy demand. • Through binary control augmentation at the diffuser level, we could see considerable improvements in thermal comfort experience. Considerable higher energy demand in Scenario 4 is associated with the insufficiency of the cooling load for the high thermal demand in Rooms B and C that resulted in an hour-long on cycle (see Fig. 10 ). On the other hand, Scenario 5 shows similar cooling demand compared to the baseline (Scenario 2) with much improved thermal comfort experience. This is a demonstration of the benefits from the integration of the proposed active diffusers. The integration of VAV box control could further reduce the energy demand due to the distribution of air discharge. • The last row of Table 5 shows the cooling demand corrected/normalized for comfort discrepancy. In these calculations, we have scaled the cooling demands by Δ c k / Δ c 2 , where Δ c k is Δ c from scenario k – e.g., Δ c 4 / Δ c 2 is 0.9/5.15. This is interpreted as energy efficiency – the effective use of energy for thermal satisfaction. As the values show, Scenarios 4 and 5 have resulted in considerable improvement in effective use of energy for comfort. The addition of directional flow shows further improvement over binary control in active diffusers. 4.8 Discussion The proposed concept of active diffusers with adaptation capabilities was shown to result in flexible performances in thermal zones for increased energy efficiency (effective energy use for thermal comfort). However, reaching a significant conclusion on the overall efficacy and energy saving potentials (i.e., formalization of adaptation capacities) calls for a comprehensive study that accounts for different thermal zone configurations, occupancy patterns, thermal comfort ranges of occupants, climate conditions, and control parameters such as ramping the conditioning loads. For example, occupancy patterns of individual rooms play a significant role in energy efficiency. The scenarios that use binary control at the VAV box level, are far less flexible when the thermal zone is partially occupied. In those scenarios, the continued supply of air in unoccupied zones could result in a considerable increase in energy consumption compared to cases with independent diffusers. Considering the computational cost of combinatorial analyses, the formalization studies require computational tools with higher efficiency such as Fast Fluid Dynamics and leveraging GPU computing. Another limitation of our study was the disconnection between control at the diffuser level and the VAV box level. Binary control at one diffuser (i.e., turning off the flow) will change the flow for other diffusers, which should be managed at the VAV box level control. Further studies into the flow distribution between different diffusers could provide a better insight into the efficiency of highly adaptative diffusers. Further investigation on the impact of the space and building system configurations (e.g., multi-occupancy and open-space offices) is also necessary. In open space scenarios, zoning and multi-VAV configuration could support targeting sub-areas, covered by individual diffusers. Equipping the diffusers for detecting activities and the number of occupants [ 3 , 12 ], the control algorithms could account for multi-occupancy scenarios using alternative strategies, such as targeting a group of occupants, alternating between different occupant locations, or switching between directional and uniform diffusion. The energy efficiency implications of such scenarios under the uncertainty of occupancy patterns could lead to quantifying the whole building adaptation capacity and load flexibility [ 76 ].\n\nConclusion\n5 Conclusion To investigate the flexibility potentials of HVAC systems by introducing new adaptive capacities, we investigated the impact of alternative control strategies by accounting for (1) distributed feedback from the indoor environment, and (2) adaptation in the control loop by introducing a new perspective for active diffusers. Active diffusers could change their actions (i.e., turning air supply on or off and adjusting the direction of the air flow) according to the dynamics of occupants and environments. To this end, we adopted a case study approach by creating a CFD simulation of a real-world thermal zone with imbalanced behavior and evaluated five scenarios of operational strategies. At a high level, these scenarios included legacy control, control by measuring feedback at the locations of individual occupants, and control by flexibility augmentation at the diffuser level. The results of simulations were interpreted in terms of effective energy use for thermal comfort provision. The integration of distributed feedback showed to improve the fairness in thermal comfort across the thermal zone although individual occupants’ comfort requirements might not be satisfied. However, the integration of diffuser-level adaptive (binary and directional) actuation showed improvements in thermal comfort satisfaction while reducing energy demand – by ~ 25% compared to the sole use of binary actuation. This study showed the potentials of new dimensions in the adaptive operation of HVAC systems. Given these potentials, the future of this research will focus on developing control frameworks that use artificial intelligence for inference of occupancy and thermal preferences, as well as intelligent control for the indoor condition and energy optimization. Therefore, formalizing the adaptative capacities of these new dimensions for diverse contextual conditions, experimental evaluation of the proposed new adaptive capacities, and investigating intelligent and context-aware algorithmic frameworks for autonomous operation of diffusers are among the future directions of this research.\n"
  }
}