{
  "full-text-retrieval-response": {
    "originalText": "Abstract\nDespite the endorsement of green building regulations and the incorporation of energy-efficient technologies, commercial buildings often fail to achieve the desired energy conservation goals, instead consume as much as 3 times of the predicted energy consumptions, representing a significant building energy performance gap. This study aims to develop a pathway and stakeholder-engaged methodological framework to close the building energy performance gap (EPG) through an in-depth case study of a state-of-the-art green office building. The selected case study is a 14-storey office building with spaces predominantly occupied by public and private companies. The required data were collected from building design documents, energy monitoring reports, building energy simulation models, building management system, stakeholder meeting minutes and records and discussions with the building’s key stakeholders. The collected data were analyzed by using content analysis and statistical analysis methods. The results and findings demonstrated the importance of analysis and comparison of energy consumption at building service systems’ component level rather than comparing the overall energy consumption to determine the level of EPG and unfold the details. Based on the results and findings, it is discovered that even when the overall EPG was close to zero, energy consumptions were significantly higher than the predictions for some components and significantly lower for others. The identified causes of EPG include inefficient control strategies of components, human manual overriding of automatic control operations, inaccurate prediction of after-hour demand and operations, as well as inaccurate modeling of cold and hot weather conditions in winter and summer respectively. An EPG-closing framework, which brings all key energy stakeholders (environmentally sustainable design team, main contractor, facility manager, mechanical service contractor, electrical service contractor, BMS service contractor and independent commissioning agent) together to work collectively to close the EPG was proposed. It is crucial to ensure that there are 1) motivations for involvement and participation of all stakeholders, 2) consistent naming of building service components in the prediction model and BMS system, 3) regular update of prediction models and 4) seamless knowledge transfer between stakeholders to effectively implement the framework. The outcome of this research provides the practitioners with knowledge and confidence to close EPG in their projects. The methods and processes developed and applied in this study provides useful reference to future studies.\n\nMethods\n2 Methodology 2.1 Description of case study Fig. 1 shows the 14 storey office building in Geelong, Victoria, Australia, which was selected for the case study. This building represents a typical state of the art green office building in Australia with spaces predominantly occupied by public and private companies. The remaining areas include a retail center, car park, loading dock and end of trip facilities for occupants. The gross floor area of the building is 24,416 m 2 with base building floor area of 10,327 m 2 and Net Lettable Area (NLA) of 14,809 m 2 . According to the report “Baseline Energy Consumption and Greenhouse Gas Emissions in Commercial Buildings in Australia” [40] , approximately 3% office building has gross floor area of higher than 20000 m 2 , 57% office building has base building area higher than10,000 m 2 and 5% office building has NLA higher than 10,000 m 2 . The selected building has an occupant density of 16 m 2 per person which is exactly same as the average occupant density of Australian Government Office building [41] . This building was designed to achieve the 5.5 Star NABERS (National Australian Building Energy Rating System) Energy for office– base building rating. The predicted energy use intensity of the building is 273 MJ/m 2 NLA per year which is significantly lower than the average office building energy intensity of 532 MJ/m 2 NLA per year in Australia [40] . This is understandable because the case study building was designed to be an energy efficiency building, whereas approximately 50% of the existing office building stock are energy inefficient [42] . The construction of this building commenced in March 2016 and completed in December 2017. Since the start of the operational stage in January 2018, different energy-related stakeholders had been involved in a collaborative manner to achieve targeted building energy efficiency. This approach was very different from the traditional approach where the involvement of Environmentally Sustainable Design (ESD) team is limited to the design stage, and the service contractors are only involved in construction and commissioning stages. Therefore, the selected case building in this study could lead to a comprehensive understanding of the research issues and maximize the learnings. This case study focused on the first year of the post-occupancy period from July 2018 to June 2019. It should be noted that the scope of this case study includes the operation and energy consumption of the base building service systems. It excludes the lighting and plug-in-load energy consumption of tenants in their rented spaces. 2.2 Data collection and analysis In this case study, the required data were collected from the following five sources: building drawings, specifications and documents, building simulation model and building management system (BMS), stakeholder meeting minutes and external environmental and weather reports. The authors had full access to the building management systems, design documents and stakeholder-meeting minutes. In addition, wherever needed, interviews were also carried with relevant stakeholders to clarify issues or obtain details. 2.2.1 Documents The documents in a case may include progress reports, press releases, media publications, minutes of meetings, design documents, correspondence and other written materials that can serve to corroborate information from other sources. In this study, the following documents were collected and analyzed: 1) Australian National Construction Code Section J Sustainability Assessment report. 2) NABERS Energy base building modeling report 3) Green Star Design & As-built energy assessment report. 4) Building user information guide 5) Energy and water monitoring strategy 6) NABERS base building energy & water metering and monitoring progress report 7) Building services operation and maintenance manual 8) Building commissioning report 9) Minutes of energy-related stakeholders meetings The NABERS Energy base building modeling report includes detail information about the design intent of this building and the assumptions used in the building energy model. The building services operation and maintenance manual state how the building services should be operated and optimized in this building. The energy and water monitoring strategy provided an understanding of the building management system (BMS) that was installed to monitor and record operational data. The stakeholder meeting minutes provided us with the understanding of the EPG issues that were discussed in those meetings during building operational stage including sources and causes of EPG, the measures that were implemented, and the stakeholders who implemented the measures. In total, 6 such meetings were held between July 2018 and June 2019. 2.2.2 Building simulation model The dynamic energy simulation model of the case study building was developed by the ESD design team using building simulation software IES VE. The model was updated using as-built documents once the construction is completed. For example, during the design stage, air infiltration rate of 0.25 ACH was considered for building envelope. Once the building was constructed, an airtightness test was carried out which showed an average leakage rate of 5.40 m 3 /h/m2 @ 50 Pa for new facades and 7.51 m 3 /h/m2 @ 50 Pa for older facades in the ground floor and level 1. Then the energy model was revised using these as-built values of infiltration. The total conditioned and non-conditioned floor areas of the building are 15,191 m 2 and 9,225 m 2 , respectively. The outcomes of the as-built simulation modeling provided the benchmark to track actual energy consumption at the component level (air handling units, HVAC pumps, chillers, cooling towers, lighting, Plug-in loads, lifts, etc.) and identify any sources of the EPG. Apart from energy consumption, the model was also used to compare the predicted and actual operational characteristics (schedules, air flow rates, air temperature, pump flow rates etc.) of building service engineering systems which were critical to identifying the equipment and systems that were not operating as intended and pinpoint the causes of EPG. Moreover, the building simulation model provided us with an understanding of the input parameters used in the model which was crucial to analyze the influence of input parameters on EPG. 2.2.3 Building management system A state of the art BMS was installed in this building to monitor actual energy consumption and operation of building services. Any building service equipment with power rating of 100 kW or more was monitored using separate sub-meters. In total, 90 sub-meters were installed in this building to monitor and record the energy consumed by different building service equipments of the base building. This excludes the sub-meters installed for tenant lighting and power as the scope of this research was limited to base building energy performance analysis as mentioned before. All sub-meters were connected to the BMS via a high-level interface. In addition to that, sensors were installed to monitor and record the flow characteristics (flow rates, temperature, status, speed, frequency etc.) at 3 min interval. The authors of this paper had been granted with full access to the BMS system to monitor and download the operational characteristics and energy consumption data. 2.2.4 Data analysis In this study, both quantitative and qualitative data analysis approaches have been applied to analyze the collected data. The quantitative analysis approach was used to quantify the level of EPG. In this study, monthly EPG was calculated using equation (1) . (1) E P G % = E A - E P E A × 100 Here, E A and E P are the actual and predicted energy consumptions. Eq. (1) was used to calculate both total and component level EPG. According to this equation, positive EPG represents over-consumption and negative EPG represents underconsumption. To calculate the contribution of individual building service component towards the total EPG, Eq. (2) was used: (2) Contribution t o t o t a l E P G % = C A - C P T A - T B × T o t a l E P G ( % ) Here, C A and C P are the actual and predicted monthly energy consumptions by the building services component. T A and T P are the total actual and predicted monthly energy consumption by the whole building. In total, by using the above mentioned methods and processes, this study analyzed nine different components, namely chillers, air handling units (AHU), HVAC pumps, condenser water loop, Direct Expansion Heat Exchanger (DX) and fans, general power, lighting, tenant condenser water pump, and lifts. A qualitative content analysis approach was followed to analyze the collected case study documents (Section 2.2.1). It is an approach to analyze documents and texts that seeks to quantify content in terms of predetermined categories [43] . In this study, the main objective of qualitative content analysis was to understand how the key stakeholders collaborated to close the EPG and develop a framework to close the EPG. The initial categories that were employed to analyze the documents include 1) Design intent of building services components, 2) Key stakeholders, 3) Identification process of EPG sources, 4) Actions undertaken by stakeholders to close EPG, 5) Outcome of those actions, 6) Process of knowledge transfer between stakeholders, and 7) Motivations of the stakeholders to participate in the process.\n\nMethods\n2.2 Data collection and analysis In this case study, the required data were collected from the following five sources: building drawings, specifications and documents, building simulation model and building management system (BMS), stakeholder meeting minutes and external environmental and weather reports. The authors had full access to the building management systems, design documents and stakeholder-meeting minutes. In addition, wherever needed, interviews were also carried with relevant stakeholders to clarify issues or obtain details. 2.2.1 Documents The documents in a case may include progress reports, press releases, media publications, minutes of meetings, design documents, correspondence and other written materials that can serve to corroborate information from other sources. In this study, the following documents were collected and analyzed: 1) Australian National Construction Code Section J Sustainability Assessment report. 2) NABERS Energy base building modeling report 3) Green Star Design & As-built energy assessment report. 4) Building user information guide 5) Energy and water monitoring strategy 6) NABERS base building energy & water metering and monitoring progress report 7) Building services operation and maintenance manual 8) Building commissioning report 9) Minutes of energy-related stakeholders meetings The NABERS Energy base building modeling report includes detail information about the design intent of this building and the assumptions used in the building energy model. The building services operation and maintenance manual state how the building services should be operated and optimized in this building. The energy and water monitoring strategy provided an understanding of the building management system (BMS) that was installed to monitor and record operational data. The stakeholder meeting minutes provided us with the understanding of the EPG issues that were discussed in those meetings during building operational stage including sources and causes of EPG, the measures that were implemented, and the stakeholders who implemented the measures. In total, 6 such meetings were held between July 2018 and June 2019. 2.2.2 Building simulation model The dynamic energy simulation model of the case study building was developed by the ESD design team using building simulation software IES VE. The model was updated using as-built documents once the construction is completed. For example, during the design stage, air infiltration rate of 0.25 ACH was considered for building envelope. Once the building was constructed, an airtightness test was carried out which showed an average leakage rate of 5.40 m 3 /h/m2 @ 50 Pa for new facades and 7.51 m 3 /h/m2 @ 50 Pa for older facades in the ground floor and level 1. Then the energy model was revised using these as-built values of infiltration. The total conditioned and non-conditioned floor areas of the building are 15,191 m 2 and 9,225 m 2 , respectively. The outcomes of the as-built simulation modeling provided the benchmark to track actual energy consumption at the component level (air handling units, HVAC pumps, chillers, cooling towers, lighting, Plug-in loads, lifts, etc.) and identify any sources of the EPG. Apart from energy consumption, the model was also used to compare the predicted and actual operational characteristics (schedules, air flow rates, air temperature, pump flow rates etc.) of building service engineering systems which were critical to identifying the equipment and systems that were not operating as intended and pinpoint the causes of EPG. Moreover, the building simulation model provided us with an understanding of the input parameters used in the model which was crucial to analyze the influence of input parameters on EPG. 2.2.3 Building management system A state of the art BMS was installed in this building to monitor actual energy consumption and operation of building services. Any building service equipment with power rating of 100 kW or more was monitored using separate sub-meters. In total, 90 sub-meters were installed in this building to monitor and record the energy consumed by different building service equipments of the base building. This excludes the sub-meters installed for tenant lighting and power as the scope of this research was limited to base building energy performance analysis as mentioned before. All sub-meters were connected to the BMS via a high-level interface. In addition to that, sensors were installed to monitor and record the flow characteristics (flow rates, temperature, status, speed, frequency etc.) at 3 min interval. The authors of this paper had been granted with full access to the BMS system to monitor and download the operational characteristics and energy consumption data. 2.2.4 Data analysis In this study, both quantitative and qualitative data analysis approaches have been applied to analyze the collected data. The quantitative analysis approach was used to quantify the level of EPG. In this study, monthly EPG was calculated using equation (1) . (1) E P G % = E A - E P E A × 100 Here, E A and E P are the actual and predicted energy consumptions. Eq. (1) was used to calculate both total and component level EPG. According to this equation, positive EPG represents over-consumption and negative EPG represents underconsumption. To calculate the contribution of individual building service component towards the total EPG, Eq. (2) was used: (2) Contribution t o t o t a l E P G % = C A - C P T A - T B × T o t a l E P G ( % ) Here, C A and C P are the actual and predicted monthly energy consumptions by the building services component. T A and T P are the total actual and predicted monthly energy consumption by the whole building. In total, by using the above mentioned methods and processes, this study analyzed nine different components, namely chillers, air handling units (AHU), HVAC pumps, condenser water loop, Direct Expansion Heat Exchanger (DX) and fans, general power, lighting, tenant condenser water pump, and lifts. A qualitative content analysis approach was followed to analyze the collected case study documents (Section 2.2.1). It is an approach to analyze documents and texts that seeks to quantify content in terms of predetermined categories [43] . In this study, the main objective of qualitative content analysis was to understand how the key stakeholders collaborated to close the EPG and develop a framework to close the EPG. The initial categories that were employed to analyze the documents include 1) Design intent of building services components, 2) Key stakeholders, 3) Identification process of EPG sources, 4) Actions undertaken by stakeholders to close EPG, 5) Outcome of those actions, 6) Process of knowledge transfer between stakeholders, and 7) Motivations of the stakeholders to participate in the process.\n\nResults\n3 Results and discussions 3.1 Causes of building energy performance gap During the studied 12 months period (July 2018 to June 2019) the building consumed 632.54 MWh electricity which is 11% higher than the prediction of 568.23 MWh. However, the monthly EPG (calculated using Eqn 1 ) varied significantly as shown in Fig. 2 . Although energy consumption data from January 2018 were available, the analysis of the performance gap was presented from July 2018 to June 2019 to eliminate the uncertainties associated with the occupancy level. This is because the building was not fully occupied between January and July 2018, which significantly influenced the actual energy consumption. As shown in Fig. 2 , the actual energy consumption was about 30% higher than the prediction for two months in winter (July and August 2018); and the gap dropped significantly thereafter for three months in autumn (between September to December 2018), but increased again to 25% in peak summer in the month of January 2019. However, since February 2019 the EPG started to drop again and reached −7% in June 2019. To understand the impact of any significant weather event and condition on the building energy consumptions, monthly actual and predicted heating (HDD) and cooling (CDD) degree-days of Geelong area are presented in Table 1 . The HDD and CDD are the difference between the mean daily temperature and base comfort temperatures. The comfort level values used were 18 °C for heating and 24 °C for cooling following the standard set by the Bureau of Meteorology Australia [44] . The table shows that the actual HDD and CDD were very close to the predictions. During that one year period, the total actual HDD were 61 units lower than the predicted HDD which means outdoor weather had a negligible impact on heating energy consumption. However, the total actual CDD were 18 units higher than predicted HDD. There was a significant difference between actual and predicted CDD in February and March 2019. In February 2019, the actual CDD was 14 units lower than the predicted CDD which means actual cooling consumption was lower than predictions. However, Fig. 2 shows 19% energy performance gap in February 2019 which may have come from other sources. In March 2019, actual CDD was 22 units higher than the predicted CDD which may have contributed to the performance gap of 10% in that month as shown in Fig. 2 . Fig. 3 shows the predicted and actual percentage distribution of energy consumptions by different building services. The figure shows that energy consumed by HVAC pumps, Tenant chilled water pumps (TCWP), lighting, Air handling units (AHU) and condenser loop is higher than predictions. On the other hand consumptions by chiller, fans and lifts are lower than predictions. To understand the reasons of the variations in energy performance gap, a detailed component level analysis was carried out using Eq. (2) and the results are presented in Fig. 4 . Fig. 4 shows that from July to September 2018, the energy consumed by Air Handling Units (AHUs) contributed most to the EPG followed by House Lighting and Tenant Condenser Water Pump (TCWP). In October 2018, House Lighting, TCWP and HVAC pumps were the leading contributors. Although the overall EPG was negligible in November and December, the lights, TCWP, HVAC pumps and condenser water loop were still consuming higher energy than the predictions. During this period, the over-consumption was balanced by the lower (than the predicted) energy consumption by AHUs, DX and fans, lifts and chillers. From January to March 2019, the significantly higher energy consumption by condenser water loop (cooling tower and condenser pumps), HVAC pumps, House Lighting and TCWP were the major contributors of EPG. In June 2019, actual energy consumption was 7% lower than the predictions although actual energy consumption by AHU’s and lighting were significantly higher than the predictions. It should be noted that some systems (AHUs, condenser water system) were consuming more energy than the predictions in some months and lower energy than the predictions in other months. Moreover, some systems (i.e. House lights, TCWP, HVAC pumps) were consistently consuming more energy than the predictions while the other systems consistently consumed lower energy than the predictions (i.e. Lifts). To understand the causes of these inconsistent discrepancies, a detailed component level analysis has been carried out and the results are presented in the following sections. 3.1.1 Chillers There are two chillers in this building to produce chilled water to meet the cooling demand. Fig. 5 shows that during the colder months (May to September), energy consumed by the chillers were significantly lower compared to the other months which is understandable because of the colder outdoor environment during the winter. However, it was interesting to see that the predicted chiller energy consumption during peak winter months (June to August) were 7 to 10 times higher than the actual consumptions which highlight the need to revise the model assumptions and input parameters used to simulate this period. In December and January actual energy consumptions were 4 and 9% higher than the predictions which contributed to overall EPG in those months. However, in other months, the chiller has negatively contributed to EPG because of lower energy consumptions than predicted. 3.1.2 Air handling units (AHU) In the studied building, there are six AHUs in total (four perimeter air handling units (South, West, North, North-East) and two central units (Central North and Central South)) to supply conditioned air into the zones. There is also a separate AHU to supply fresh outdoor air when needed. The energy performance gaps in the operation of AHUs were significantly higher during July and August 2018 and dropped sharply in September and October 2018 as shown in Fig. 6 . The performance gaps were negative from November 2018 to January 2019 before a sharp increase closer to the colder months (May and June 2019). To understand the causes of these EPGs in AHU operations, the contribution of each AHU components (supply air fans, return air fans and heat exchangers) as a percentage of total EPG of the AHU system was calculated and has been presented in Fig. 7 . The figure shows that the heat exchangers (HEX-R01 and HEX-R02) were the leading contributor to the EPG in July and August 2018 followed by the supply air fans of the south, west and central south AHUs. In this building, the HEX is used for two purposes: 1) economy HVAC operation when the outdoor air is favorable and 2) supply fresh air if there is a build up of CO 2 level inside the building. In the economy mode, the HEX is operated when the outside air temperature is 1) lower than 15 °C, 2) 5 °C lower than the HEX return air temperature, and 3) 2 °C lower than the AHU supply air temperature. The HEX also runs if the CO 2 level inside the building is higher than 640 ppm irrespective of outdoor temperature. The analysis of HEX time series data revealed that in July and August 2018, the heat exchangers were running unnecessarily during the weekend and after hours, which contributed to higher energy consumption. In September 2018, the HEX control system was adjusted to prevent running during weekends and after hours, which may have partly reduced the energy consumption. However, since September 2018, the outdoor temperature was not favorable to run the economy cycle most of the time, and the energy consumed by HEX units was mostly due to the build-up of CO 2 level inside the building. This phenomenon contributed significantly to energy consumption reduction of HEX units. In May and June 2019, when the outdoor temperature was favorable to run the economy cycle, energy consumed by HEX units increased significantly and so did the performance gap. Hence, further investigation is required to optimize the operation of HEX units. Moreover, in July and August 2018, the controls of all variable air volume (VAV) dampers were overridden to be open 100% in the second floor of the building where the tenants complained about being too cold. These ad-hoc changes resulted in higher static pressure setpoints for the AHU supply air fans, which contributed to an increase in supply air fan speed and fan energy consumption. In addition, the start time of the AHU was moved from 7.30am to 6am to make sure the indoor environment is comfortable for the occupants when they arrive in the office. This action also contributed to higher AHU energy consumptions in those months. Although in October 2018, the AHU’s start time was changed back to 7.30am no action was taken to understand the root causes of thermal discomfort in the second floor. Hence, the comfort issue appeared again in 2019 winter period and resulted in higher energy consumptions of supply and return air fans. Previous studies also reported that ad-hoc fixes that were implemented without addressing the root causes are one of the key contributors of EPG [23] . 3.1.3 HVAC pumps HVAC pumps include three chilled water pumps (CHWP), two primary hot water pumps (PHHWP) and two secondary hot water pumps (SHHWP). Fig. 8 shows that energy consumed by HVAC pumps were consistently higher than the predictions since July 2018. Table 2 shows that in winter months (July – Aug) CHWP consumptions were significantly lower than the predictions. But HHWP consumptions were over 4 times higher than the predictions which resulted in the overall HVAC pumps energy consumptions of 34% higher than the predictions in those months. Since September 2018, energy consumed by CHWP continued to increase and was consuming around 3 times of the predictions. The energy performance gap reached to a staggering 588% in January 2019. The HHWPs were also consuming around 3 times of predictions until December 2018 when the actual consumption was marginally lower than the prediction. The performance gap in HVAC pumps was arising from inefficient control of the pumps, inaccurate predictions of the energy model and higher cooling demand. Analysis of CHWP operational data revealed that the Field Differential Pressure (DP) reset for CHWP was not enabled in the BMS system. As a result, the DP setpoint was always constant and was not changing with the Field DP pressure. Hence the pump speed was not regulated as intended. The pump was always running at a higher speed which may have resulted in higher energy consumption. A review of the BMS system and the communication with the BMS contractor revealed that the operation of the chilled water pump was manually overridden in the last week of December 2018 due to some operational problems which caused the CHWPs to run continuously without being controlled by the chilled water plant differential pressure. The overriding of the pump control system was supposed to be temporary, but the BMS contractor forgot about this, which contributed to the significantly higher EPG in January to March 2019. This phenomenon shows the importance of human interventions. The performance gap reduced significantly in April 2019 compared to previous months once the automatic pump control was re-instated but even at that point it was still over 300%. Although in June 2019, the gap reduced significantly to 11%, Table 2 shows that CHWP were consuming 63% lower energy than prediction (due to low cooling demand in winter) and HHWP was consuming 3.5 times of prediction. If there was a higher cooling demand in summer months, the AHUs and chillers should also consume higher energy than the predicted. However, energy consumed by those systems was close to the predictions during the summer months whereas the energy consumed by the HVAC pumps was significantly higher. This phenomenon highlights the need to revisit the energy simulation model. A review of the simulation model used for this case study building revealed that in the model, specific pump power is 100 W/(L/s) for CHWP R-01 and CHWP R-02. However, the supplier specifications of these pumps mention 11 KW and 24 L/s. This means the specific pump power is 458 W/(L/s) which is significantly higher than the value used in the model. 3.1.4 Condenser water loop Condenser water loop consists of three condenser water pumps (CWP) and two cooling towers (CT). The actual energy consumption by the condenser water loop system was about 80% lower than predicted during July and August 2018 and about 30% lower in September as shown in Fig. 9 . However, between October 2018 to May 2019, the actual energy consumptions were much higher than the predicted. A detailed comparison of energy consumption by the CT fans and CWPs have been presented in Table 3 and discussed below: 1) The actual energy consumptions of CWPs were significantly lower (1/10th to 1/5th) than predictions in July and August 2018. However, the actual energy consumptions of CT fans were around 13 to 17 times of prediction at that time which was not logical. Lower energy consumptions by CWPs mean that there was lower condenser water demand by chillers. Hence, there was less demand on CT to produce condenser water which should result in lower CT fan energy consumption than predicted. Moreover, the actual energy consumptions of CT fans were 13–24 times of prediction during November 2018 – January 2019. The BMS system shows that the cooling tower supplies condenser water for the chillers and tenant’s packaged air-conditioner unit. However, the simulation model only included the chiller condenser water requirement and as a result, under-predicted the cooling tower fan energy consumption. 2) The predicted condenser loop energy consumptions in colder periods (July and August 2018) were 5–8 times higher than the actual consumptions, which are similar to the trend of chiller and HVAC pumps actual energy consumption. This phenomenon reinforces the need to revise the simulation model and understand the reasons for higher cooling load predictions during colder months. 3) From October 2018, the condenser water loop energy consumptions were significantly higher than the predictions. Notably, in January 2019, the performance gap climbed to a staggering 300%. As discussed in the previous section, the operation of the chilled water pump was manually overridden in the last week of December due to some operational problems. This changes also impacted the operation of CWPs and cooling tower fans, and the system was operating continuously. As a result, the performance gap increased significantly in January 2019. However, this phenomenon does not explain the reasons for consistently higher consumptions from October to December. Given the fact that there is no EPG in the chillers and AHUs actual energy consumption, the condenser water loop actual energy consumption should also be close to the predictions. A review of the time series data did not reveal any anomaly in the operation of these pumps. A review of the simulation model revealed that in the energy model, specific pump power was 167.5 W/(L/s) for CWPs. However, the supplier specification of these pumps mentions 11 KW and 45 L/s which means the specific pump power is 244.4 W/(L/s). These differences in input pump power might have contributed to the underprediction of the energy consumption by CWP. 3.1.5 Direct Expansion heat Exchanger (DX) and ventilation fans The energy consumed by Direct Expansion Heat Exchanger (DX) and ventilation fans were 20–52% higher than the predictions from July to September 2018. However, actual consumptions were around 60% lower than the predictions during the rest of the monitoring period as shown in Fig. 10 . The analysis of building tuning register records and stakeholder meeting minutes revealed the following reasons for the higher consumption: 1. DX and ventilation fans were running unnecessarily during weekends and were consuming 50–60% of the weekday energy consumptions. 2. Some ventilation fans in the car parking areas, loading docks and end of trip (EoT) facility rooms were running continuously all day and night instead of being controlled by CO/NOx or motion sensor control. Moreover, the fan in the EoT room was not following the planned schedule. In September 2018, the mechanical contractor addressed the problems with sensor control, and the BMS contractor adjusted the schedule. These rectifying actions reduced the DX and Fans energy consumptions by 66% in October 2018. Since then, the energy consumed by this component was consistently 60% lower than the prediction as shown in Fig. 10 . This improvement shows the importance of continuously monitoring and on-time fine-tuning and rectifying of equipment and devices in buildings. However, it should be noted that the prediction of fan energy consumption was exactly same in each month with no seasonal variations. This was because the calculations were done manually considering average running hours and fan specifications without the use of any dynamic simulation software. This may have resulted in the overprediction of fan power consumption. 3.1.6 General power General power includes the energy consumed by plug-in loads in the base building. Energy consumed in general power was consistently very close to the predictions as shown in Fig. 11 and did not make any significant contribution towards EPG. 3.1.7 House lighting House lighting energy consumption includes the energy consumed by lights in the base building. Energy consumed by lights was consistently much higher than the predictions as shown in Fig. 12 . Review of time series lighting energy consumption data shows that significant amount of energy was consumed during weekday after hours and weekends. The after-hours energy consumption was primarily due to security guards walking through the building and activating the motion sensor lights. Once turned on, the lights remained on for 30 min. Lobby lighting was also on almost permanently overnight due to movement. To reduce lighting energy consumptions, the following actions were undertaken in November 2018: 1) The control mechanism of the lights was checked to ensure that all lights (except the limited number of 24/7 security lights) are operated via time-clock and motion sensors. 2) The run-on time of lights in the stairs was reduced all the time. 3) The run-on time of lights was reduced to 90 s in all areas between the hours of 10 pm and 4am to reduce the impact of security guard patrol. 4) The number of main foyer lights that are switched on between the hours of 10 pm and 4am was reduced to 25% of all lights. 5) The minimum run-on time for car park space lights was reduced from 25 min to 3 min all the time. After the implementation of the above-mentioned measures, the lighting EPG dropped from 265% in July 2018 to 167% in June 2019 as shown in Fig. 12 which is still very high. The performance gap may have also resulted from the inaccuracies in prediction. In this project, lighting energy consumption was predicted manually by considering light specifications, number of lights, control device factor and average hours of operation. No dynamic daylighting model was used to simulate the impact of daylight and lighting control strategies. There is also a need to check the wattage of actually installed bulbs compared to the recommended one. 3.1.8 Tenant condenser water pump The Tenant Condenser Water Pumps (TCWP) system consists of two primary pumps, two secondary pumps and two heat exchangers. Energy consumed by Tenant Condenser Water Pumps (TCWP) was consistently higher than prediction as shown in Fig. 13 . The performance gap was around 130–140% during July and August but dropped significantly in September to November (around 80%) before rising again to 120–140% in December and January. Review of the BMS and tuning register revealed that on 21st August the control strategy of TCWP was modified to ensure the primary pumps (TCWP-01 and 02) only run when heat rejection is required which resulted in the reduction in energy consumption in the following months from 140% to 80%. However, in December 2018, the gap again increased from 80% to 120% due to increased demand in summer. Energy consumption level during after-hours and weekends were very similar to the weekday business hours' energy consumption due to the constant calls for condenser water from the CRAC unit installed in the data center and some PAC (packaged air conditioner) units installed in the meeting rooms of the tenants. Level 3 of this building includes an office of the Victoria State Police Department where people work around the clock and need 24/7 heating and cooling. This information was not known during the energy modeling at design stage and hence was not considered. This may have also resulted in consistently higher energy consumption by the TCWP pumps. There is a need to revisit the model to accommodate those after-hour usage in the predictions. Since April 2019, the EPG has dropped sharply because of lower cooling demand from the tenant during winter months. When compared with the winter months of 2018 (July and August), the impact of primary pump control strategy that was undertaken on 21st August is clearly visible on the EPG. 3.1.9 Lift Energy consumed by the lift was consistently lower than the prediction as shown in Fig. 14 . The predictions were made based on the National Australian Built Environment Rating System (NABERS) guideline which recommends Lift energy consumption of 8 kWh/m 2 of Net Lettable Area. It could be a very conservative approach, and its application in this type of office building needs to be reviewed.\n\nResults\n3.1 Causes of building energy performance gap During the studied 12 months period (July 2018 to June 2019) the building consumed 632.54 MWh electricity which is 11% higher than the prediction of 568.23 MWh. However, the monthly EPG (calculated using Eqn 1 ) varied significantly as shown in Fig. 2 . Although energy consumption data from January 2018 were available, the analysis of the performance gap was presented from July 2018 to June 2019 to eliminate the uncertainties associated with the occupancy level. This is because the building was not fully occupied between January and July 2018, which significantly influenced the actual energy consumption. As shown in Fig. 2 , the actual energy consumption was about 30% higher than the prediction for two months in winter (July and August 2018); and the gap dropped significantly thereafter for three months in autumn (between September to December 2018), but increased again to 25% in peak summer in the month of January 2019. However, since February 2019 the EPG started to drop again and reached −7% in June 2019. To understand the impact of any significant weather event and condition on the building energy consumptions, monthly actual and predicted heating (HDD) and cooling (CDD) degree-days of Geelong area are presented in Table 1 . The HDD and CDD are the difference between the mean daily temperature and base comfort temperatures. The comfort level values used were 18 °C for heating and 24 °C for cooling following the standard set by the Bureau of Meteorology Australia [44] . The table shows that the actual HDD and CDD were very close to the predictions. During that one year period, the total actual HDD were 61 units lower than the predicted HDD which means outdoor weather had a negligible impact on heating energy consumption. However, the total actual CDD were 18 units higher than predicted HDD. There was a significant difference between actual and predicted CDD in February and March 2019. In February 2019, the actual CDD was 14 units lower than the predicted CDD which means actual cooling consumption was lower than predictions. However, Fig. 2 shows 19% energy performance gap in February 2019 which may have come from other sources. In March 2019, actual CDD was 22 units higher than the predicted CDD which may have contributed to the performance gap of 10% in that month as shown in Fig. 2 . Fig. 3 shows the predicted and actual percentage distribution of energy consumptions by different building services. The figure shows that energy consumed by HVAC pumps, Tenant chilled water pumps (TCWP), lighting, Air handling units (AHU) and condenser loop is higher than predictions. On the other hand consumptions by chiller, fans and lifts are lower than predictions. To understand the reasons of the variations in energy performance gap, a detailed component level analysis was carried out using Eq. (2) and the results are presented in Fig. 4 . Fig. 4 shows that from July to September 2018, the energy consumed by Air Handling Units (AHUs) contributed most to the EPG followed by House Lighting and Tenant Condenser Water Pump (TCWP). In October 2018, House Lighting, TCWP and HVAC pumps were the leading contributors. Although the overall EPG was negligible in November and December, the lights, TCWP, HVAC pumps and condenser water loop were still consuming higher energy than the predictions. During this period, the over-consumption was balanced by the lower (than the predicted) energy consumption by AHUs, DX and fans, lifts and chillers. From January to March 2019, the significantly higher energy consumption by condenser water loop (cooling tower and condenser pumps), HVAC pumps, House Lighting and TCWP were the major contributors of EPG. In June 2019, actual energy consumption was 7% lower than the predictions although actual energy consumption by AHU’s and lighting were significantly higher than the predictions. It should be noted that some systems (AHUs, condenser water system) were consuming more energy than the predictions in some months and lower energy than the predictions in other months. Moreover, some systems (i.e. House lights, TCWP, HVAC pumps) were consistently consuming more energy than the predictions while the other systems consistently consumed lower energy than the predictions (i.e. Lifts). To understand the causes of these inconsistent discrepancies, a detailed component level analysis has been carried out and the results are presented in the following sections. 3.1.1 Chillers There are two chillers in this building to produce chilled water to meet the cooling demand. Fig. 5 shows that during the colder months (May to September), energy consumed by the chillers were significantly lower compared to the other months which is understandable because of the colder outdoor environment during the winter. However, it was interesting to see that the predicted chiller energy consumption during peak winter months (June to August) were 7 to 10 times higher than the actual consumptions which highlight the need to revise the model assumptions and input parameters used to simulate this period. In December and January actual energy consumptions were 4 and 9% higher than the predictions which contributed to overall EPG in those months. However, in other months, the chiller has negatively contributed to EPG because of lower energy consumptions than predicted. 3.1.2 Air handling units (AHU) In the studied building, there are six AHUs in total (four perimeter air handling units (South, West, North, North-East) and two central units (Central North and Central South)) to supply conditioned air into the zones. There is also a separate AHU to supply fresh outdoor air when needed. The energy performance gaps in the operation of AHUs were significantly higher during July and August 2018 and dropped sharply in September and October 2018 as shown in Fig. 6 . The performance gaps were negative from November 2018 to January 2019 before a sharp increase closer to the colder months (May and June 2019). To understand the causes of these EPGs in AHU operations, the contribution of each AHU components (supply air fans, return air fans and heat exchangers) as a percentage of total EPG of the AHU system was calculated and has been presented in Fig. 7 . The figure shows that the heat exchangers (HEX-R01 and HEX-R02) were the leading contributor to the EPG in July and August 2018 followed by the supply air fans of the south, west and central south AHUs. In this building, the HEX is used for two purposes: 1) economy HVAC operation when the outdoor air is favorable and 2) supply fresh air if there is a build up of CO 2 level inside the building. In the economy mode, the HEX is operated when the outside air temperature is 1) lower than 15 °C, 2) 5 °C lower than the HEX return air temperature, and 3) 2 °C lower than the AHU supply air temperature. The HEX also runs if the CO 2 level inside the building is higher than 640 ppm irrespective of outdoor temperature. The analysis of HEX time series data revealed that in July and August 2018, the heat exchangers were running unnecessarily during the weekend and after hours, which contributed to higher energy consumption. In September 2018, the HEX control system was adjusted to prevent running during weekends and after hours, which may have partly reduced the energy consumption. However, since September 2018, the outdoor temperature was not favorable to run the economy cycle most of the time, and the energy consumed by HEX units was mostly due to the build-up of CO 2 level inside the building. This phenomenon contributed significantly to energy consumption reduction of HEX units. In May and June 2019, when the outdoor temperature was favorable to run the economy cycle, energy consumed by HEX units increased significantly and so did the performance gap. Hence, further investigation is required to optimize the operation of HEX units. Moreover, in July and August 2018, the controls of all variable air volume (VAV) dampers were overridden to be open 100% in the second floor of the building where the tenants complained about being too cold. These ad-hoc changes resulted in higher static pressure setpoints for the AHU supply air fans, which contributed to an increase in supply air fan speed and fan energy consumption. In addition, the start time of the AHU was moved from 7.30am to 6am to make sure the indoor environment is comfortable for the occupants when they arrive in the office. This action also contributed to higher AHU energy consumptions in those months. Although in October 2018, the AHU’s start time was changed back to 7.30am no action was taken to understand the root causes of thermal discomfort in the second floor. Hence, the comfort issue appeared again in 2019 winter period and resulted in higher energy consumptions of supply and return air fans. Previous studies also reported that ad-hoc fixes that were implemented without addressing the root causes are one of the key contributors of EPG [23] . 3.1.3 HVAC pumps HVAC pumps include three chilled water pumps (CHWP), two primary hot water pumps (PHHWP) and two secondary hot water pumps (SHHWP). Fig. 8 shows that energy consumed by HVAC pumps were consistently higher than the predictions since July 2018. Table 2 shows that in winter months (July – Aug) CHWP consumptions were significantly lower than the predictions. But HHWP consumptions were over 4 times higher than the predictions which resulted in the overall HVAC pumps energy consumptions of 34% higher than the predictions in those months. Since September 2018, energy consumed by CHWP continued to increase and was consuming around 3 times of the predictions. The energy performance gap reached to a staggering 588% in January 2019. The HHWPs were also consuming around 3 times of predictions until December 2018 when the actual consumption was marginally lower than the prediction. The performance gap in HVAC pumps was arising from inefficient control of the pumps, inaccurate predictions of the energy model and higher cooling demand. Analysis of CHWP operational data revealed that the Field Differential Pressure (DP) reset for CHWP was not enabled in the BMS system. As a result, the DP setpoint was always constant and was not changing with the Field DP pressure. Hence the pump speed was not regulated as intended. The pump was always running at a higher speed which may have resulted in higher energy consumption. A review of the BMS system and the communication with the BMS contractor revealed that the operation of the chilled water pump was manually overridden in the last week of December 2018 due to some operational problems which caused the CHWPs to run continuously without being controlled by the chilled water plant differential pressure. The overriding of the pump control system was supposed to be temporary, but the BMS contractor forgot about this, which contributed to the significantly higher EPG in January to March 2019. This phenomenon shows the importance of human interventions. The performance gap reduced significantly in April 2019 compared to previous months once the automatic pump control was re-instated but even at that point it was still over 300%. Although in June 2019, the gap reduced significantly to 11%, Table 2 shows that CHWP were consuming 63% lower energy than prediction (due to low cooling demand in winter) and HHWP was consuming 3.5 times of prediction. If there was a higher cooling demand in summer months, the AHUs and chillers should also consume higher energy than the predicted. However, energy consumed by those systems was close to the predictions during the summer months whereas the energy consumed by the HVAC pumps was significantly higher. This phenomenon highlights the need to revisit the energy simulation model. A review of the simulation model used for this case study building revealed that in the model, specific pump power is 100 W/(L/s) for CHWP R-01 and CHWP R-02. However, the supplier specifications of these pumps mention 11 KW and 24 L/s. This means the specific pump power is 458 W/(L/s) which is significantly higher than the value used in the model. 3.1.4 Condenser water loop Condenser water loop consists of three condenser water pumps (CWP) and two cooling towers (CT). The actual energy consumption by the condenser water loop system was about 80% lower than predicted during July and August 2018 and about 30% lower in September as shown in Fig. 9 . However, between October 2018 to May 2019, the actual energy consumptions were much higher than the predicted. A detailed comparison of energy consumption by the CT fans and CWPs have been presented in Table 3 and discussed below: 1) The actual energy consumptions of CWPs were significantly lower (1/10th to 1/5th) than predictions in July and August 2018. However, the actual energy consumptions of CT fans were around 13 to 17 times of prediction at that time which was not logical. Lower energy consumptions by CWPs mean that there was lower condenser water demand by chillers. Hence, there was less demand on CT to produce condenser water which should result in lower CT fan energy consumption than predicted. Moreover, the actual energy consumptions of CT fans were 13–24 times of prediction during November 2018 – January 2019. The BMS system shows that the cooling tower supplies condenser water for the chillers and tenant’s packaged air-conditioner unit. However, the simulation model only included the chiller condenser water requirement and as a result, under-predicted the cooling tower fan energy consumption. 2) The predicted condenser loop energy consumptions in colder periods (July and August 2018) were 5–8 times higher than the actual consumptions, which are similar to the trend of chiller and HVAC pumps actual energy consumption. This phenomenon reinforces the need to revise the simulation model and understand the reasons for higher cooling load predictions during colder months. 3) From October 2018, the condenser water loop energy consumptions were significantly higher than the predictions. Notably, in January 2019, the performance gap climbed to a staggering 300%. As discussed in the previous section, the operation of the chilled water pump was manually overridden in the last week of December due to some operational problems. This changes also impacted the operation of CWPs and cooling tower fans, and the system was operating continuously. As a result, the performance gap increased significantly in January 2019. However, this phenomenon does not explain the reasons for consistently higher consumptions from October to December. Given the fact that there is no EPG in the chillers and AHUs actual energy consumption, the condenser water loop actual energy consumption should also be close to the predictions. A review of the time series data did not reveal any anomaly in the operation of these pumps. A review of the simulation model revealed that in the energy model, specific pump power was 167.5 W/(L/s) for CWPs. However, the supplier specification of these pumps mentions 11 KW and 45 L/s which means the specific pump power is 244.4 W/(L/s). These differences in input pump power might have contributed to the underprediction of the energy consumption by CWP. 3.1.5 Direct Expansion heat Exchanger (DX) and ventilation fans The energy consumed by Direct Expansion Heat Exchanger (DX) and ventilation fans were 20–52% higher than the predictions from July to September 2018. However, actual consumptions were around 60% lower than the predictions during the rest of the monitoring period as shown in Fig. 10 . The analysis of building tuning register records and stakeholder meeting minutes revealed the following reasons for the higher consumption: 1. DX and ventilation fans were running unnecessarily during weekends and were consuming 50–60% of the weekday energy consumptions. 2. Some ventilation fans in the car parking areas, loading docks and end of trip (EoT) facility rooms were running continuously all day and night instead of being controlled by CO/NOx or motion sensor control. Moreover, the fan in the EoT room was not following the planned schedule. In September 2018, the mechanical contractor addressed the problems with sensor control, and the BMS contractor adjusted the schedule. These rectifying actions reduced the DX and Fans energy consumptions by 66% in October 2018. Since then, the energy consumed by this component was consistently 60% lower than the prediction as shown in Fig. 10 . This improvement shows the importance of continuously monitoring and on-time fine-tuning and rectifying of equipment and devices in buildings. However, it should be noted that the prediction of fan energy consumption was exactly same in each month with no seasonal variations. This was because the calculations were done manually considering average running hours and fan specifications without the use of any dynamic simulation software. This may have resulted in the overprediction of fan power consumption. 3.1.6 General power General power includes the energy consumed by plug-in loads in the base building. Energy consumed in general power was consistently very close to the predictions as shown in Fig. 11 and did not make any significant contribution towards EPG. 3.1.7 House lighting House lighting energy consumption includes the energy consumed by lights in the base building. Energy consumed by lights was consistently much higher than the predictions as shown in Fig. 12 . Review of time series lighting energy consumption data shows that significant amount of energy was consumed during weekday after hours and weekends. The after-hours energy consumption was primarily due to security guards walking through the building and activating the motion sensor lights. Once turned on, the lights remained on for 30 min. Lobby lighting was also on almost permanently overnight due to movement. To reduce lighting energy consumptions, the following actions were undertaken in November 2018: 1) The control mechanism of the lights was checked to ensure that all lights (except the limited number of 24/7 security lights) are operated via time-clock and motion sensors. 2) The run-on time of lights in the stairs was reduced all the time. 3) The run-on time of lights was reduced to 90 s in all areas between the hours of 10 pm and 4am to reduce the impact of security guard patrol. 4) The number of main foyer lights that are switched on between the hours of 10 pm and 4am was reduced to 25% of all lights. 5) The minimum run-on time for car park space lights was reduced from 25 min to 3 min all the time. After the implementation of the above-mentioned measures, the lighting EPG dropped from 265% in July 2018 to 167% in June 2019 as shown in Fig. 12 which is still very high. The performance gap may have also resulted from the inaccuracies in prediction. In this project, lighting energy consumption was predicted manually by considering light specifications, number of lights, control device factor and average hours of operation. No dynamic daylighting model was used to simulate the impact of daylight and lighting control strategies. There is also a need to check the wattage of actually installed bulbs compared to the recommended one. 3.1.8 Tenant condenser water pump The Tenant Condenser Water Pumps (TCWP) system consists of two primary pumps, two secondary pumps and two heat exchangers. Energy consumed by Tenant Condenser Water Pumps (TCWP) was consistently higher than prediction as shown in Fig. 13 . The performance gap was around 130–140% during July and August but dropped significantly in September to November (around 80%) before rising again to 120–140% in December and January. Review of the BMS and tuning register revealed that on 21st August the control strategy of TCWP was modified to ensure the primary pumps (TCWP-01 and 02) only run when heat rejection is required which resulted in the reduction in energy consumption in the following months from 140% to 80%. However, in December 2018, the gap again increased from 80% to 120% due to increased demand in summer. Energy consumption level during after-hours and weekends were very similar to the weekday business hours' energy consumption due to the constant calls for condenser water from the CRAC unit installed in the data center and some PAC (packaged air conditioner) units installed in the meeting rooms of the tenants. Level 3 of this building includes an office of the Victoria State Police Department where people work around the clock and need 24/7 heating and cooling. This information was not known during the energy modeling at design stage and hence was not considered. This may have also resulted in consistently higher energy consumption by the TCWP pumps. There is a need to revisit the model to accommodate those after-hour usage in the predictions. Since April 2019, the EPG has dropped sharply because of lower cooling demand from the tenant during winter months. When compared with the winter months of 2018 (July and August), the impact of primary pump control strategy that was undertaken on 21st August is clearly visible on the EPG. 3.1.9 Lift Energy consumed by the lift was consistently lower than the prediction as shown in Fig. 14 . The predictions were made based on the National Australian Built Environment Rating System (NABERS) guideline which recommends Lift energy consumption of 8 kWh/m 2 of Net Lettable Area. It could be a very conservative approach, and its application in this type of office building needs to be reviewed.\n\nMethods\n4 Framework to close the building energy performance gap (EPG) Analysis of the building stakeholders’ meeting minutes showed that since July 2018, Building Monitoring and Tuning meetings were held every two months including all energy-related stakeholders, where they discussed the sources and causes of EPG and possible solutions to close the gap to achieve the desired sustainability target. The stakeholders included Environmentally Sustainable Design (ESD) team, Main contractor (MC), Facilities manager (FM), Mechanical service contractor (MSC), Electrical service contractor (ESC), BMS service contractor (BMSSC) and Independent Commissioning Agent (ICA). The authors attended two of those meetings and collaborated with the stakeholder team in identifying and analyzing the sources of the performance gap (presented in the previous section). This section aims to develop a framework to close the gap based on the lessons learned in this case study. First of all, the ESD team recorded the actual energy consumption of the building at the service component level (as presented in section 3.1) and compared with predictions of the energy model. In cases where the data is not available from the BMS or the recorded data is not correct, the facilities manager recorded the energy readings manually from the energy sub-meters and passed it to the ESD team for comparison. Based on this comparison, the ESD team identified areas of misuse or sources of EPG and documented these in the metering and monitoring report. The report was circulated to each stakeholder before the regular monitoring and tuning meeting for discussion. Apart from the report, the meeting agenda also included discussions on thermal comfort and operational issues identified by the facilities manager. The main contractor chaired all meetings. During the meeting, the relevant service contractors explained any possible reasons for the performance gap or thermal discomfort issues in their domain of operation and were also tasked with conducting a detail investigation. The outcome of the investigation and possible solutions were presented in the following tuning meeting for further discussion. In some cases, the solutions were implemented immediately following the investigations. In other cases, the solutions were discussed in the following tuning meetings, particularly if it involved changes in the owner’s brief. The ICA reviewed all major changes in building services and documented it in the change management register for future reference. Table 4 shows a summary of the EPG magnitude and causes in different building services along with the actions undertaken by different stakeholders to close the EPG. The discussions in the following four sections highlight four key issues that have been identified from this collaborative approach which should be addressed to improve the effectiveness of collaboration. 4.1 Consistent naming of building components in the energy model and BMS Review of metering and monitoring report from the ESD team, building simulation model and energy metering architecture in BMS revealed the following differences ( Table 5 ) in the calculation of predictions and actual energy consumptions by different building services components. A review of the metering and monitoring strategy report revealed that the ESD team formulated the calculation of energy consumption from both the simulation model and the BMS without any input from the BMS service contractor. Also, the names of the building service components are very different in the energy model and BMS which may have also contributed to the difference in energy consumption calculation. Hence, there is a need for a consistent naming convention for all the parameters such as building services components, flow characteristics and indoor environments in building simulation model and in the installed BMS to allow accurate comparison and calculation of EPG. It should be noted that all analysis in section 3 includes corrected comparison of predictions and the actual consumptions. 4.2 Revisiting and updating the prediction model Causes of EPG do not always lie in the operation of building services equipment. Inaccurate predictions caused by erroneous input parameters and assumptions also significantly contribute to EPG [25] . The approach followed by the stakeholders in this case study did not include any step to review the simulation model when needed. Moreover, the person who developed the energy simulation and calculation model was not part of the ESD team that was undertaking the tuning process. As a result, the ESD team had little idea about the assumptions and input parameters used in the energy model and whether there was a need to update those parameters based on actual operating conditions. The revision of the energy model is particularly important if some equipment consistently consume higher energy than predictions even after several tuning attempts to minimize energy consumption. For example, in this case study, the house lighting, HVAC pumps, condenser water pumps, tenant condenser water pumps consistently consumed energy higher than predictions as discussed in 3.1. The performance gap in those components might have resulted from erroneous input parameters (as discussed in sections 3.1.3 and 3.1.4) and the prediction methods (section 3.1.7). Hence, there is a need to revisit the prediction model at regular interval and the modeler should be included in the ESD team that undertakes the tuning process. 4.3 Drivers and incentives for stakeholders to undertake post-occupancy building monitoring and tunning The funding for the construction of case study building was approved on the condition that the building should achieve 5.5-star NABERS sustainability target, which drove the owner to include it as a condition in the contract with the main contractor. Therefore, the main contractor was contractually obliged to the owner to achieve the desired sustainability target and contracted the ESD team to design the building following the owner’s brief. To ensure that the building’s energy is performing as intended (achieve 5.5 star NABERS), the main contractor also signed a separate 18 months contract with the ESD team to monitor building energy performance during the post-occupancy period and provide suggestions to close any EPG. Apart from the ESD team, other service contractors (mechanical, electrical, BMS, ICA) were not contracted separately to take part in post-occupancy monitoring and tuning activities to identify causes of EPG following the suggestions from the ESD team. The service contractors were involved in the process as a part of their 12 months post-occupancy building tuning service. There was no incentive for them to be involved in the monitoring and tunning process after 12 months. As a result, the number of participants (and participation) of the building monitoring and tuning meeting dropped significantly once the one year period passed in December 2018. The building is currently sitting between 5 and 5.5 stars NABERS energy rating and is required to undergo further tuning process to achieve 5.5 stars, which would be difficult to achieve without the participation of service contractors. There is a need for a mechanism to incentivize all service contractors if they can minimize the EPG in their area of operation. 4.4 Seamless knowledge transfer between stakeholders On several occasions, the members of the ESD team and other service contractors were changed which resulted in broken knowledge transfer between the energy-related stakeholders. The change of employee/s also delayed the performance gap mitigation process (i.e. decision making and implementation of measures) as the new employee/s needed time to understand the project context and contents. Hence there is a need to introduce a mechanism that will ensure seamless knowledge transfer between the stakeholders. Based on the above discussions, the following strategic framework ( Fig. 15 ) has been developed. Sitting on the outset are the drivers and incentives to motivate involvement and participation of all key stakeholders. For example, there is a need to have a driver for owners and main contractors to lead regular post-occupancy building monitoring and tuning activities to close the EPG. Moreover, to motivate the involvement and participation of the ESD team and service contractors, the main contractors/ owners need to introduce a mechanism to motivate and incentivize participants. Seamless knowledge transfer between stakeholders and consistent naming of building service components in the simulation model and BMS are essential to close the EPG through stakeholder collaboration. The 4 quarters of the innermost circle represent 4 steps of the proposed framework: 1) identification of EPG sources and causes, 2) Engagement of relevant service stakeholders, 3) Investigation of causes of EPG, and 4) Solutions development and implementation to close EPG. The framework also shows the stakeholders associated with each step along with their responsibilities. In step 1, the ESD team and facilities manager is responsible for monitoring building energy consumption, comparing it with predictions and preparing the reports including sources and causes of any EPG for stakeholder meetings. The ESD team should also revise and update the energy prediction model if needed. In step 2, the main contractors/owners assign relevant service contractors with tasks to investigate the causes of EPG identified in the monitoring report. In step 3, the service contractors then conduct detail investigations to pinpoint the causes of EPG and propose possible solutions. In step 4, the best strategies to close the EPG are selected after consultation with all key stakeholders and implemented by the relevant service stakeholders.\n\nConclusion\n6 Conclusions An in-depth case study of a recently completed green building was undertaken to understand the sources and causes of the EPG and a framework developed to close the gap. The selected case study building was a 14 storey typical office building with spaces occupied by public and private companies, retail centers and car parking spaces. The building was designed to achieve 5.5 star NABERS Energy for office– base building rating. The results showed that during the studied 12 months period (July 2018 to June 2019) the building consumed overall 11% more electricity than predicted by the energy modeling. However, the monthly EPG varied significantly from +34% to −7%. The component level analysis and comparision also yielded with very different results with different components. The unique post-occupancy stakeholder-collaboration approach that has been undertaken in this building has contributed to the significant reduction of EPG. A component level analysis is a crucial step to identify the sources of EPG compared to total energy consumption comparison. Even if the overall EPG is close to zero, there may be a significant positive and negative EPGs at the component levels that negate one another. without component level analysis, some components may continue to run inefficiently. A similar conclusion was also reported in a previous study [28] . The identified causes of EPG include inefficient control strategies of components, manual overriding of automatic control strategies, after-hours demand and errors in prediction. Time and time again, the designed automated control system is manually overridden to fix any operational issues and also to improve personal thermal comfort rather than addressing the root causes of discomfort. Often the service contractors forget to switch the system back to the designed control mode after fixing the operational problem. In other words, human factor plays an important role in creating and closing the EPG. A framework, which brings all key energy stakeholders (ESD team, main contractors, facilities manager, service contractors, independent commissioning agent and owners) together to collectively close the EPG has been proposed based on the case study results and findings. The “whole-of-stakeholder” framework presents a systematic process to identify the EPG sources/causes, engage relevant stakeholders, investigate the causes of EPG, and provide solutions to close EPG. It is crucial to ensure that there are 1) motivations for involvement and participation of all stakeholders, 2) consistent naming of building service components in the prediction model and BMS, 3) regular update of prediction models and 4) seamless knowledge transfer between stakeholders to effectively implement the proposed framework. There is a need to have a driver for the owner to introduce post-occupancy building energy monitoring and tuning activities. A mechanism to incentivize the design team, service contractors and facilities managers are also equally important to close the EPG. The consistent naming convention for all parameters such as building services components, flow characteristics and indoor environments in building simulation model and in the installed BMS is important to allow accurate comparison of the acutal energy consumption in operation stage and predictive calculation of EPG at design stage. Such consistent naming will also help to automatically analyze building operational data using a data mining technique [45] . Furthermore, the building energy simulation model should be revisited and updated regularly to take into account the actual conditions of building occupancy and usage as well as occupant energy behavior, and eliminate any uncertainties associated with modeling assumptions and input parameters. This will also provide the designers with key design information that will help them to develop a more accurate model in future projects. The outcome of this study provides new insight to understand the sources and causes of the EPG and practical measures to close these gaps. The methods and processes developed and applied in this study provide useful reference for similar analysis in the future.\n"
  }
}