{"full-text-retrieval-response": {
    "scopus-eid": "2-s2.0-85085123032",
    "originalText": "serial JL 271969 291210 291731 31 Renewable and Sustainable Energy Reviews RENEWABLESUSTAINABLEENERGYREVIEWS 2020-05-07 2020-05-07 2020-05-07 2020-05-07 2020-05-15T22:56:01 1-s2.0-S1364032120301787 S1364-0321(20)30178-7 S1364032120301787 10.1016/j.rser.2020.109885 S300 S300.1 FULL-TEXT 1-s2.0-S1364032120X00074 2020-07-07T20:21:06.588425Z 0 0 20200701 20200731 2020 2020-05-07T03:20:58.367381Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table e-component body mmlmath acknowledge affil appendices articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor grantsponsorid highlightsabst nomenclature primabst ref 1364-0321 13640321 true 127 127 C Volume 127 9 109885 109885 109885 202007 July 2020 2020-07-01 2020-07-31 2020 Original Research paper article fla © 2020 Elsevier Ltd. All rights reserved. ANOVELOPERATIONAPPROACHFORENERGYEFFICIENCYIMPROVEMENTHVACSYSTEMINOFFICESPACESTHROUGHREALTIMEBIGDATAANALYTICS LI W Nomenclature 1 Introduction 2 Materials and methods 2.1 Research framework 2.2 Monitoring phase 2.3 Diagnostic phase 2.3.1 Basic analysis 2.3.2 Advanced analysis 2.4 Intervention phase 2.4.1 Basic control strategy 2.4.2 Advanced control strategy 3 Results and discussion 3.1 Basic analysis and control 3.1.1 Basic analysis 3.1.2 Basic control strategy 3.2 Advanced analysis and control 3.2.1 Advanced analysis 3.2.2 Advanced control strategy 3.3 Discussion 4 Conclusions CRediT authorship contribution statement Acknowledgements Appendix A Supplementary data References NATIONALDEVELOPMENTANDREFORMCOMMISSION 2016 COMPREHENSIVEWORKPLANFORCONSERVINGENERGYREDUCINGEMISSIONSFORTHIRTEENTHFIVEYEARPLAN OUF 2016 530 539 M 2017 ELECTRICALMECHANICALSERVICESDEPARTMENTGOVERNMENTHONGKONGSPECIALADMINISTRATIVEREGION GUL 2015 155 165 M KATIPAMULA 2012 S SMALLANDMEDIUMSIZEDCOMMERCIALBUILDINGMONITORINGCONTROLSNEEDSASCOPINGSTUDYPACIFICNORTHWESTNATIONALLABPNNL ENERGYINFORMATIONADMINISTRATION 2016 HOWMANYSMARTMETERSINSTALLEDINUNITEDSTATES MILLER 2018 1365 1377 C CHOU 2016 751 770 J LUO 2017 715 725 X AN 2018 214 227 J MA 2017 90 102 Z OZAWA 2016 200 210 A YANG 2017 27 37 J CHOU 2014 400 411 J CHOU 2017 711 722 J HORRIGAN 2018 1499 1509 M LI 2014 401 415 Y FAN 2014 1 10 C AFRAM 2017 96 113 A GHOFRANI 2017 106 118 A KUROHA 2018 351 362 R GHAHRAMANI 2016 930 942 A HOYT 2015 89 96 T LABEODAN 2016 75 83 T WANG 2018 495 507 W WANG 2013 1382 1390 L YAMTRAIPAT 2006 765 770 N GHAHRAMANI 2014 536 548 A KIM 2017 64 76 W MOON 2011 338 346 J MANJARRES 2017 409 417 D MOON 2016 1135 1144 J YANG 2014 113 122 Z NAGARATHINAM 2017 476 486 S NIKDEL 2018 15 25 L HONG 2015 671 707 T LI 2018 365 385 W DEMAURO 2016 122 135 A ENVIRONMENTBUREAUINHONGKONG DU 2014 157 166 Z SCHEIN 2006 1485 1492 J BORGSTEIN 2018 476 485 E GURALNIK 1999 33 42 V PROCEEDINGSFIFTHACMSIGKDDINTERNATIONALCONFERENCEKNOWLEDGEDISCOVERYDATAMINING EVENTDETECTIONTIMESERIESDATA SZCZUREK 2016 229 234 A 2016THIRDINTERNATIONALCONFERENCE DETECTIONOCCUPANCYEVENTSINDOORAIRMONITORINGDATAMATHEMATICSCOMPUTERSINSCIENCESININDUSTRYMCSI PEREIRA 2018 365 377 P ZEILEIS 2010 1696 1706 A KILLICK 2014 1 19 R KILLICK 2010 R CHANGEPOINTANALYSISCHANGEPOINTMODELS KILLICK 2012 1590 1598 R KILLICK 2016 R PACKAGECHANGEPOINTRPACKAGEVERSION042011 CALI 2015 39 49 D AI 2016 116 127 Z ZURAIMI 2017 517 528 M YANG 2016 344 349 J SZCZUREK 2016 265 271 A CHEN 2018 260 270 Z CANDANEDO 2016 28 39 L LUOMA 2001 35 48 M ROSCH 2014 129 137 C SZCZUREK 2018 1564 1575 A GUO 2013 908 915 M HORI 2013 285 292 H CARON 2015 A PROCEEDINGSHEALTHYBUILDINGSEUROPE2015CONFERENCE GASSENSORNETWORKSRELEVANTTOOLSFORREALTIMEINDOORAIRQUALITYINDICATORSINLOWENERGYBUILDINGS JUNG 2015 190 195 C LIX2020X109885 LIX2020X109885XW 2022-05-07T00:00:00.000Z 2022-05-07T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2020 Elsevier Ltd. All rights reserved. 2020-05-03T04:52:18.091Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/eoas NRF National Research Foundation of Korea http://data.elsevier.com/vocabulary/SciValFunders/501100003725 http://sws.geonames.org/1835841 item S1364-0321(20)30178-7 S1364032120301787 1-s2.0-S1364032120301787 10.1016/j.rser.2020.109885 271969 2020-07-07T20:21:06.588425Z 2020-07-01 2020-07-31 1-s2.0-S1364032120301787-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/MAIN/application/pdf/6de5cd70ab8496d8c5325e44b82407d0/main.pdf main.pdf pdf true 2308326 MAIN 15 1-s2.0-S1364032120301787-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/PREVIEW/image/png/0f6fbf34ae944d1150840fdb830da112/main_1.png main_1.png png 55501 849 656 IMAGE-WEB-PDF 1 1-s2.0-S1364032120301787-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr1/DOWNSAMPLED/image/jpeg/bca60f61aa9fb4f927b38e47c393e3ef/gr1.jpg gr1 gr1.jpg jpg 64335 384 535 IMAGE-DOWNSAMPLED 1-s2.0-S1364032120301787-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr1/THUMBNAIL/image/gif/0b8430563158a4b58e212103cff052e4/gr1.sml gr1 gr1.sml sml 14680 157 219 IMAGE-THUMBNAIL 1-s2.0-S1364032120301787-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr3/DOWNSAMPLED/image/jpeg/b777b19ba86c0fae86676238304078a9/gr3.jpg gr3 gr3.jpg jpg 50261 323 535 IMAGE-DOWNSAMPLED 1-s2.0-S1364032120301787-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr3/THUMBNAIL/image/gif/3e1ac2a38d2e5f8df0c8a47f5b006d5f/gr3.sml gr3 gr3.sml sml 13269 132 219 IMAGE-THUMBNAIL 1-s2.0-S1364032120301787-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr2/DOWNSAMPLED/image/jpeg/c95eb4d5764963a6c0e6e28519a67562/gr2.jpg gr2 gr2.jpg jpg 82272 334 535 IMAGE-DOWNSAMPLED 1-s2.0-S1364032120301787-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr2/THUMBNAIL/image/gif/26dcef320e523dbcce930d309e97df54/gr2.sml gr2 gr2.sml sml 18411 137 219 IMAGE-THUMBNAIL 1-s2.0-S1364032120301787-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr5/DOWNSAMPLED/image/jpeg/319523ba0b1c17e06d5263f6a5b253ce/gr5.jpg gr5 gr5.jpg jpg 141043 895 689 IMAGE-DOWNSAMPLED 1-s2.0-S1364032120301787-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr5/THUMBNAIL/image/gif/05be10c44c6735cb391afdb0ecf32b44/gr5.sml gr5 gr5.sml sml 12170 164 126 IMAGE-THUMBNAIL 1-s2.0-S1364032120301787-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr4/DOWNSAMPLED/image/jpeg/82010e88ef65d388c2c6c9e9e5e5f0a3/gr4.jpg gr4 gr4.jpg jpg 208745 922 535 IMAGE-DOWNSAMPLED 1-s2.0-S1364032120301787-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr4/THUMBNAIL/image/gif/6b680709d02c108fcccf14bfa2eb526b/gr4.sml gr4 gr4.sml sml 14100 164 95 IMAGE-THUMBNAIL 1-s2.0-S1364032120301787-gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr6/DOWNSAMPLED/image/jpeg/b9315d8204590d9da515f4fb23250bc7/gr6.jpg gr6 gr6.jpg jpg 132655 812 689 IMAGE-DOWNSAMPLED 1-s2.0-S1364032120301787-gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr6/THUMBNAIL/image/gif/a51139aa980ba136d62b63232d42b50b/gr6.sml gr6 gr6.sml sml 12681 164 139 IMAGE-THUMBNAIL 1-s2.0-S1364032120301787-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr1/HIGHRES/image/jpeg/97c06b7a1e2fb6f16551d63617fb0000/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 520020 1700 2370 IMAGE-HIGH-RES 1-s2.0-S1364032120301787-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr3/HIGHRES/image/jpeg/6015a3f442011ad3e2d13db230e97cb7/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 243912 1431 2371 IMAGE-HIGH-RES 1-s2.0-S1364032120301787-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr2/HIGHRES/image/jpeg/1a959068a8b5c64d43baf606e0192826/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 681543 1481 2371 IMAGE-HIGH-RES 1-s2.0-S1364032120301787-gr5_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr5/HIGHRES/image/jpeg/a99f87588ff6ebda5c7cc7d6a3ddb1d0/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 984339 3960 3050 IMAGE-HIGH-RES 1-s2.0-S1364032120301787-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr4/HIGHRES/image/jpeg/af8d9831aa563ecb171dd87b1ed74fc9/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 1984769 4086 2371 IMAGE-HIGH-RES 1-s2.0-S1364032120301787-gr6_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/gr6/HIGHRES/image/jpeg/7d9858b41956c09a07aaac3fbdad4460/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 809791 3596 3050 IMAGE-HIGH-RES 1-s2.0-S1364032120301787-mmc1.doc https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1364032120301787/mmc1/MAIN/application/msword/d36331fa392d3b3e2643d9518b8e7016/mmc1.doc mmc1 mmc1.doc doc 403968 APPLICATION 1-s2.0-S1364032120301787-am.pdf am am.pdf pdf 504244 AAM-PDF https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10RMC68X4G6/MAIN/application/pdf/f5a9632937877a761da0897bb1bc01f4/am.pdf RSER 109885 109885 S1364-0321(20)30178-7 10.1016/j.rser.2020.109885 Elsevier Ltd Fig. 1 Application of the CPA model for distinguishing the different set-point temperatures in the large office space (for the case of August 15, 2017). Fig. 1 Fig. 2 The time-series indoor temperature and CO2 concentration in the large office space (for the case of Sep. 25, 2017). • Operation duration of the HVAC system (ODH): This index can be calculated by considering the variation of indoor temperature as a proxy indicator (refer to the orange-colored solid line in Fig. 2). The indoor temperature started to decrease for more than 30 min since 9:00 a.m., and it has been kept below 22.5 °C until 10:00 a.m. Then, it started to increase for more than 30 min since 10:00 a.m.; but it has been kept below 22.5 °C until 13:00 p.m. After that, it started to decrease for more than 30 min since 13:00 p.m., and it has been kept below 22.5 °C until 18:00 p.m. Finally, it started to increase since 18:00 p.m. In short, the HVAC system could be regarded as being operated from 9:00 a.m. through 18:00 p.m. (refer to the black-colored solid arrow line in Fig. 2); and thus, the ODH can be calculated as 9.0 h. • Duration of meeting (DM): As a proxy indicator, this index can be calculated by investigating the variations of CO2 concentration. As shown in Fig. 2 (blue-colored shared area), it could be assumed to have meetings in three time periods: (i) from 9:00 a.m. to 12:00 p.m. (3 h); (ii) from 14:00 p.m. to 16:00 p.m. (2 h); and (iii) from 17:30 p.m. to 18:00 p.m. (0.5 h). Thus, the DM can be calculated as 5.5 h. • Effective utilization ratio of the HVAC system (EURH): This index can be determined by considering the ODH and DM (refer to Equation (2)). The less the EURH would be, the more energy would be wasted (i.e. larger potential of the energy efficiency improvement of the HVAC system). If the EURH would be at 100%, the HVAC system would be regarded to be operated only during the meeting periods, indicating that it would be most effectively operated without any waste. As a result, the EURH can be calculated at 61.11% (= 5.5 h/9.0 h) by considering two values (i.e. ODH and DM). • Accumulated effective utilization ratio of the HVAC system (AEURH): This index can be calculated from a macro perspective (refer to Equation (3)). By accumulating the values of the ODH and DM, the accumulated operation duration of the HVAC system (AODH) and the accumulated duration of meeting (ADM) can be obtained, respectively. With these values, the AEURH can be calculated (e.g., 40.29% (= 213.25 h/529.25 h)), indicating a large potential of the energy efficiency improvement of the HVAC system in the large office space (e.g., 59.71%). (2) E U R H = D M O D H Fig. 2 Fig. 3 Distribution of the indoor temperature by four classes in two office spaces. Fig. 3 Fig. 4 Frequency of the estimated set-point temperature in two office spaces. Fig. 4 Fig. 5 A logical flowchart for estimating the set-point temperature of the HVAC system. Fig. 5 Fig. 6 A logical flowchart for the automatic on/off control of the HVAC system in real time. Fig. 6 Table 1 Previous studies on the energy efficiency improvement by adjusting the set-point temperature of the HVAC system. Table 1 Author Area Building Time period Objects Tools Method Main findings Ghahramani et al. (2016) [22] The United States Office One year The influence of building size, construction category, climate, occupancy schedule, set point, and dead band EnergyPlus, MATLAB software Building energy simulations, N-way ANOVA analyses • This paper introduced a systematic approach to study the effects of influential factors on building HVAC energy consumption by using building energy simulations. Hoyt et al. (2015) [23] The United States Office From November 2010 to August 2012 The influence of cooling set-point, heating set-point, and minimum volume flow rates of variable air volume on energy-saving of the HVAC system EnergyPlus version 7.2 and the software JEPlus Simulation and empirical corroboration • It is estimated that with the increased cooling set-point, the average cooling energy and total HVAC energy could be saved by 29% and 27% respectively. • Wider set-point range can save energy consumption and satisfy comfort demand by personal controls. Wang et al. (2013) [26] The United States Office January 02, 2010 to 02/28/2011 and January 09, 2011 to 02/28/2012 Temperature set-points, cooling coil stages, damper operation, and optimal start Portfolio Manager, EnergyIQ, EnergyPlus Monitoring-based commissioning • An actual energy saving of 10% was realized through the process of ongoing commissioning. Yamtraipat et al. (2006) [27] Thailand Office N/A Adjust room temperature set-point N/A Field investigation • The overall electricity consumption saving would be 804.60 GWh/year, which would reduce the CO2 by 579.31 × 103 tons/year. Ghahramani et al. (2014) [28] The United States Office From April 1 to June 20 and from October 1 to October 25 in 2013 The influential factors are indoor temperature, set-point temperature, airflow, outdoor temperature, and subjective thermal comfort vote N/A The human interaction for thermal comfort, fuzzy pattern recognition algorithm, Spearman's and Kendall's rank correlation coefficient, regression analysis, and optimization • The proposed method saved the energy consumption and maintained the thermal comfort at the same time. Kim et al. (2017) [29] The United States Office, commercial building and factory One week in different seasons Anomaly detection for set-points and schedules of rooftop units (RTUs) N/A Low pass filter, Z-transform, peak detection algorithm, and Bayesian classifier • The proposed method was based on an optimization problem with a single objective function (i.e. set-point temperature). • The set-point detection and HVAC cycling algorithms were developed based on the peak detection technique, and they could detect the set-points and short cycling of RTUs accurately. Moon and Han (2011) [30] The United States Residential January 3 and 28, June 27 and July 8 The influence of setback period; set-point temperature; setback temperature on energy-saving of the HVAC system eQUEST Computer simulation • There was large energy-saving potential in both cold and hot-humid climate zones by different thermostat strategies. Table 2 Previous studies on the energy efficiency improvement by deploying the occupancy-based control of the HVAC system. Table 2 Author Area Building Time period Objects Time scale Tools Method Main findings Labeodan et al. (2016) [24] Netherlands Office Three weeks Energy saving for lighting system N/A Passive infrared motion sensors Experimental study • Energy was saved by means of occupancy-driven lighting control. Wang et al. (2018) [25] Hong Kong Multi-zone office weekday, weekend, and holiday CO2 concentration and energy consumption 1 min TRNSYS, WiFi devices, and camera Simulation • Occupancy pattern was analyzed to determine a proper outdoor air circulation level, resulting in energy savings while sacrificing the indoor environmental quality, which performs better than the traditional one. Manjarres et al. (2017) [31] Spain Office 63 days in summer and 46 days in winter Save energy by optimal schedule operation of the HVAC ON/OFF and mechanical ventilation 1 h Python The random forest (RF) regression techniques • The HVAC ON/OFF and mechanical ventilation (MV) operation schedule could be predictively controlled based on 24-h ahead prediction of indoor temperature by RF regression techniques. Moon and Kim (2016) [32] South Korea Hotel From June 1st to September 30th in 2014 Reduce the cooling energy consumption and improve thermal comfort 1 min TRNSYS and MATLAB software ANN and simulation • The cooling energy consumption required to maintain the indoor temperature within a comfortable level was estimated by ANN model, which considered a normal set-point temperature during unoccupied period. Yang and Becerik-Gerber (2014) [33] The United States Office From January to April in 2013 Save energy by operating HVAC according to occupancy profile, and by rearranging occupants to different zones 3 min OpenStudio ARMA, NN, Markov chain, logit regression, bootstrapping-derivative method, k-means clustering, and simulation • The occupancy-profile-based HVAC schedules could save 9% of energy. • Room reassignment was achieved by “P rule”, “S rule” and “C rule” in clustering process. • Further 8% energy was saved by coupling occupancy-profile-based control schedule with room reassignment. Nagarathinam et al. (2017) [34] Indian Open-plan office From 1 October in 2015 to 31 January in 2016 Thermal comfort and energy consumption 1 and 15 min N/A Temperature and humidity prediction • Considering the spatial variation of mean radiant temperature and occupancy, a model based predictive control was developed to regulate the dynamic temperature set-point via the PID controller. EnergyPlus and MLE+ Simulation MATLAB Optimization Nikdel et al. (2018) [35] The United States Office N/A The efficiency of occupancy-based HVAC controls in energy cost, fossil fuels consumption and gas emissions N/A EnergyPlus Computer simulation • The occupancy-based control performed effectively in energy cost, fossil fuels consumption and gas emissions, and the performance improvement varied across different climate zones and HVAC systems. Table 3 “Advanced analysis” for the effective utilization of the HVAC system in the large office space. Table 3 Starting time of the HVAC system (manually controlled) Downtime of the HVAC system (manually controlled) ODHa (h) Meeting Time DMb (h) EURHc (%) Jul.31st,8:30 Jul.31st,19:45 11.25 Jul.31st,8:30–9:45 5.75 51.11 Jul.31st,11:30–13:45 Jul.31st,14:15–16:30 Aug.1st,8:30 Aug.2nd,14:15 21.75 Aug.1st,8:30–10:30 8.25 37.93 Aug.1st,11:45–12:45 Aug.1st,14:15–16:45 Aug.2nd,7:15–10:30 Aug.3rd,9:30 Aug.9th,14:15 72.75 Aug.3rd,9:30–11:15 22.5 30.93 Aug.3rd,13:30–15:15 Aug.4th,7:45–10:45 Aug.7th,7:30–11:45 Aug.8th,7:45–12:00 Aug.8th,14:30–16:15 Aug.8th,16:30–17:15 Aug.9th,7:45–11:45 Aug.9th,12:15–13:15 Aug.10th,8:45 Aug.14th,19:45 43 Aug.10th,8:45–12:30 20.75 48.26 Aug.11th,7:30–10:30 Aug.11th,14:00–15:15 Aug.11th,16:30–18:00 Aug.11th,20:00–21:00 Aug.14th,7:15–13:15 Aug.14th,14:00–15:30 Aug.14th,16:00–17:45 Aug.15th,9:15 Aug.29th,19:15 170 Aug.15th,9:15–10:45 66.5 39.12 Aug.15th,13:45–15:00 Aug.15th,15:45–16:30 Aug.15th,18:15–20:30 Aug.16th,8:00–11:00 Aug.16th,14:00–15:15 Aug.17th,8:00–12:15 Aug.17th,14:15–15:00 Aug.17th,15:15–16:00 Aug.17th,17:45–18:45 Aug.18th,8:00–12:00 Aug.18th,13:30–17:00 Aug.21st,8:00–12:45 Aug.21st,14:00–16:45 Aug.21st,17:00–18:00 Aug.22nd,8:00–10:45 Aug.22nd,11:00–12:45 Aug.22nd,14:15–16:30 Aug.22nd,16:45–18:30 Aug.24th,8:45–11:15 Aug.24th,13:45–17:15 Aug.25th,9:00–13:00 Aug.25th,14:00–15:30 Aug.25th,16:00–17:15 Aug.25th,18:00–19:00 Aug.28th,8:00–11:30 Aug.28th,14:15–17:30 Aug.29th,7:30–9:30 Aug.29th,14:30–17:15 Starting time of the HVAC system (manually controlled) Downtime of the HVAC system (manually controlled) ODH a (h) Meeting Time DM b (h) EURH c (%) Aug.30th,12:00 Aug.30th,19:15 7.25 Aug.30th,12:00–13:45 3.75 51.72 Aug.30th,14:15–15:00 Aug.30th,16:30–17:45 Sep.1st,9:30 Sep.1st,11:45 2.25 Sep.1st,9:30–10:45 1.25 55.56 Sep.4th,9:00 Sep.7th,23:00d 62 Sep.4th,9:00–10:15 22.75 36.69 Sep.4th,12:30–13:45 Sep.4th,15:00–16:00 Sep.4th,16:45–17:45 Sep.5th,7:45–11:15 Sep.5th,11:30–12:15 Sep.5th,14:00–15:15 Sep.5th,16:45–17:30 Sep.6th,7:45–10:15 Sep.6th,11:00–12:00 Sep.6th,14:15–15:45 Sep.7th,8:00–10:45 Sep.7th,14:15–16:00 Sep.7th,17:00–19:30 Sep.8th,9:15 Sep.8th,21:45 12.5 Sep.8th,9:15–12:00 6 48.00 Sep.8th,14:15–17:30 Sep.11th,12:45 Sep.11th,15:45 3 Sep.11th,12:45–14:00 1.25 41.67 Sep.12th,15:15 Sep.12th,21:15 6 Sep.12th,15:15–18:30 3.25 54.17 Sep.13th,9:45 Sep.13th,10:45 1 Sep.13th,9:45–10:45 1 100.00 Sep.18th,7:00 Sep.19th,19:00 28 Sep.18th,8:15–10:00 7.5 26.79 Sep.18th,11:30–12:15 Sep.18th,15:30–16:45 Sep.19th,8:15–11:00 Sep.19th,11:15–12:15 Sep.20th,11:00 Sep.21st,14:15 19.25 Sep.20th,11:00–12:00 8.5 44.16 Sep.20th,14:45–16:15 Sep.20th,16:30–17:30 Sep.20th,18:00–20:00 Sep.21st,8:45–11:45 Sep.21st,15:30 Sep.21st,21:00 5.5 Sep.21st,15:30–18:00 2.5 45.45 Sep.22nd,9:30 Sep.22nd,13:00 3.5 Sep.22nd,9:30–10:45 1.25 35.71 Sep.22nd,15:30 Sep.22nd,20:30 5 Sep.22nd,15:30–18:15 2.75 55.00 Sep.25th,9:00 Sep.25th,20:15 9 Sep.25th,9:00–12:00 5.5 61.11 Sep.25th,14:00–16:00 Sep.25th,17:30–18:00 Sep.26th,9:15 Sep.26th,20:00 10.75 Sep.26th,9:15–13:00 6.75 62.79 Sep.26th,14:00–16:15 Sep.26th,17:00–17:45 Sep.27th,9:15 Sep.27th,19:45 10.5 Sep.27th,9:15–12:30 5 47.62 Sep.27th,14:00–15:45 Sep.28th,10:00 Sep.28th,12:15 2.25 Sep.28th,10:00–11:30 1.5 66.67 Sep.28th,16:15 Sep.29th,23:00d 22.75 Sep.28th,16:30–17:45 9 39.56 Sep.29th,8:00–11:00 Sep.29th,11:15–12:30 Sep.29th,12:45–13:45 Sep.29th,14:30–15:45 Sep.29th,16:30–17:45 AODH e (h) 529.25 ADM f (h) 213.25 AEURH g (%) 40.29 Notes: a ODH stands for the operation duration of the HVAC system; b DM stands for the duration of meeting; c EURH stands for the effective utilization ratio of the HVAC system; d Part of data were missed. It was not easy to infer when the HVAC system would be turned off manually; thus, 23:00 p.m. (which is automatic shutdown time) was listed here; e AODH stands for the accumulated operation duration of the HVAC system; f ADM stands for the accumulated duration of meeting; and g AEURH stands for the accumulated effective utilization ratio of the HVAC system. A novel operation approach for the energy efficiency improvement of the HVAC system in office spaces through real-time big data analytics Wenzhuo Li Investigation Data curation Writing - original draft a Choongwan Koo Supervision Conceptualization Funding acquisition Writing - review & editing b ∗ Taehoon Hong Conceptualization Project administration Funding acquisition c Jeongyoon Oh Conceptualization Resources Validation b Seung Hyun Cha Conceptualization Formal analysis d Shengwei Wang Conceptualization Methodology a a Department of Building Services Engineering, The Hong Kong Polytechnic University, Hung Hom, Kowloon, Hong Kong Department of Building Services Engineering The Hong Kong Polytechnic University Hung Hom Kowloon Hong Kong Department of Building Services Engineering, The Hong Kong Polytechnic University, Hung Hom, Kowloon, Hong Kong b Division of Architecture & Urban Design, Incheon National University, Incheon, Republic of Korea Division of Architecture & Urban Design Incheon National University Incheon Republic of Korea Division of Architecture & Urban Design, Incheon National University, Incheon, Republic of Korea c Department of Architecture and Architectural Engineering, Yonsei University, Seoul, 03722, Republic of Korea Department of Architecture and Architectural Engineering Yonsei University Seoul 03722 Republic of Korea Department of Architecture and Architectural Engineering, Yonsei University, Seoul, 03722, Republic of Korea d Department of Interior Architecture Design, Hanyang University, Seoul, 04763, Republic of Korea Department of Interior Architecture Design Hanyang University Seoul 04763 Republic of Korea Department of Interior Architecture Design, Hanyang University, Seoul, 04763, Republic of Korea ∗ Corresponding author. Since a traditional centralized control system (e.g., building energy management system) with a fixed schedule and manual control is not appropriate to irregularly occupied rooms, it is expected to have a large amount of energy saving potential in operating the HVAC system. To overcome this challenge, this study aimed to develop a novel operation approach for the energy efficiency improvement of the HVAC system in office spaces. The real-time indoor environmental indicators were collected and analyzed to evaluate the current operation status of the HVAC system as well as to propose a novel control strategy in two ways. The significant findings can be illustrated as follows. First, it could be stated that occupants would tend to establish a lower set-point temperature for a cooler indoor environment. To solve this issue, a basic control strategy was proposed to detect the anomaly detection of the HVAC system and to automatically adjust the indoor temperature within a preferred range. Second, it could be evaluated that the HVAC system would be kept operating since occupants would forget to turn off the HVAC system after the meetings. To solve this issue, an advanced control strategy was proposed to operate the automatic on/off control of the HVAC system by considering the indoor temperature and CO2 concentration in real time. The proposed strategies can contribute to a large amount of energy savings in operating the HVAC system of irregularly occupied spaces. Keywords Real-time big data analytics Energy efficiency Set-point temperature Change point analysis Occupancy-based control CO2 concentration Nomenclature ADM accumulated duration of meeting AEURH accumulated effective utilization ratio of the HVAC system AODH accumulated operation duration of the HVAC system BEMS building energy management system CPA change point analysis DM duration of meeting EURH effective utilization ratio of the HVAC system HVAC system heating, ventilating and air-conditioning system IEQ indoor environmental quality ODH Operation duration of the HVAC system VOCs volatile organic compounds 1 Introduction As a response to global warming, the Chinese government set the 2030 goal to decrease the CO2 emissions per gross domestic product by 60–65% from 2005 and the energy consumption per gross domestic product by 15% from 2005 [1]. It is reported that 20–40% of the national energy consumption come from the building sector, and especially for Hong Kong, the proportion is over 60% in which a commercial sector accounts for more than half [2,3]. The heating, ventilating and air-conditioning (HVAC) system is widely operated in buildings to keep a comfortable indoor environment, and its energy consumption is estimated to take up the largest proportion (i.e. 25%) of the total energy usages [3]. Thus, there is a large amount of energy saving potential in operating the HVAC system of office buildings. The HVAC system is generally controlled by the centralized building energy management system (BEMS) [4], which regulates the operation schedule (e.g., on/off condition), the set-point temperature and volume, regardless of the different characteristics of office spaces. However, it is required to control the HVAC system depending on the different types of spaces (e.g., irregular occupied offices). Reportedly, it is estimated to achieve the energy savings by over 20% by carefully establishing the set-points and the operation schedules of the HVAC system [5]. Therefore, this study aimed to improve the energy efficiency of the HVAC system in office spaces by deploying the optimal operation strategies. The low-cost sensors and cloud servers have become more accessible due to the rapid growth in the Internet-of-Things (IoT) industry [6,7]. Accordingly, the real-time data opens new opportunities with the valuable information hidden behind, and it can be effectively used with the advanced computing algorithms and technologies. In this context, there are a growing number of studies on the energy efficiency improvement in buildings through real-time big data analytics, such as pattern recognition [8–13], anomaly detection [14–17], model predictive control [18–21]. Tables 1 and 2 summarize previous studies on the real-time energy efficiency improvement by adjusting the set-point temperature of the HVAC system and by deploying the occupancy-based control of the HVAC system. First, the set-point temperature of the of HVAC system is generally used to maintain the indoor temperature within a preferred range. As shown in Table 1, many previous studies have proved that the significant energy-saving potential could be achieved by appropriately establishing the set-point temperature of the HVAC system. Ghahramani et al. [22] analyzed the impact of the set-point temperature, dead band, and occupancy schedule on energy-saving potential via energy simulation. Compared to the annual set-point temperature (i.e. 22.5 °C), the daily set-point temperature (i.e. 19.5–25.5 °C) can save energy by 6.78%–37.03% depending on different climates and building size. Hoyt et al. [23] suggested to increase the cooling set-point temperature from 22.2 °C to 25 °C so that the energy savings can be achieved by 29%. Both of simulations and field studies supported that adequate set-point temperature was beneficial in terms of energy savings. Second, the discrepancies between the designed and actual energy usage can mainly occur due to the occupants' behaviors. Significant energy saving potential could be achieved if building services would effectively respond to occupancy condition. As shown in Table 2, many previous studies have made efforts in developing the occupancy-based control strategies. Labeodan et al. [24] installed the wireless sensors and actuators to facilitate the occupancy-based lighting control, in which passive infrared motion sensors and chair sensors were used to determine the occupants' presence or absence. Wang et al. [25] established the occupancy-based ventilation strategy for multi-zone spaces via Wi-Fi network. Compared to the traditional method with a fixed outdoor air ratio, the proposed strategy determined the proper outdoor air ratio depending on the detected and predicted occupancy level. Although several studies have been conducted for the energy efficiency improvement by investigating the set-point temperature and occupancy-based control in real time, there were two kinds of challenges to be overcome. On one hand, previous studies tried to achieve the energy savings by developing the thermostat of the HVAC system, based on the assumption that the actual indoor temperature would reach the designated set-point temperature. However, it could be acceptable only if the HVAC system is operated in normal condition. That is, considering the accidental failures of the HVAC system (e.g. biases of temperature sensor inside, control signal errors, etc.), the designated set-point temperature of the HVAC system would not be met under the stable condition. Therefore, it is needed to accurately estimate the set-point temperature with a concept of dead band instead of utilizing the value shown in a control panel. On the other hand, previous studies tried to achieve the energy savings with the occupancy-based control strategies by using passive infrared sensors, cameras, Wi-Fi signals, and so on. However, these methods could cause the high costs and privacy issues. Therefore, alternative ways that are cheaper and unconcerned of privacy issues should be considered to develop the occupancy-based control strategies for the HVAC system. To address the aforementioned challenges, a novel operation approach was developed to improve the energy efficiency of the HVAC system in office spaces through real-time big data analytics. First, the set-point temperature of the HVAC system could be estimated by calculating the mean value of indoor temperature. One of the change point analysis (CPA) models was chosen to identify changes in the mean value of indoor temperature and to evaluate the current status of the set-point temperature in operating the HVAC system. The proposed model can detect the potential equipment failure in the HVAC system by estimating the set-point temperature in real time, and it can provide feedbacks to adjust the set-point temperature within a preferred range. On the other hand, the indoor environmental indicators were adopted to evaluate whether the HVAC system would be effectively operated and whether the office spaces would be occupied. Accordingly, it is expected to effectively operate the HVAC system by applying the real-time occupancy-based control strategy. 2 Materials and methods 2.1 Research framework The previous studies, as a dynamic management approach in buildings, were conducted by the author [36,37] to achieve the improvement of the indoor environmental quality (IEQ). As shown in Supplementary Material (SM), Fig. S1, the dynamic management approach was adopted to achieve the energy efficiency improvement in office spaces by estimating the set-point temperature and by improving the effective utilization of the HVAC system in real time. This study established the research framework into three phases. (i) Monitoring phase (refer to section 2.2 ): The IoT-based sensors were installed to detect the indoor environmental quality in real time, in which temperature and CO2 concentration were considered. (ii) Diagnostic phase (refer to section 2.3 ): Based on the collected dataset, two types of diagnoses were conducted. First, the set-point temperature of the HVAC system was estimated to evaluate whether it has been maintained within a preferred range (for energy saving and thermal comfort). Second, the effective utilization of the HVAC system was evaluated by investigating whether the HVAC system was turned off after the meeting schedule, in which temperature and CO2 concentration were considered. (iii) Intervention phase (refer to section 2.4 ): Based on the diagnostic results, two types of intervention strategies were suggested. First, the set-point temperature of the HVAC system could be estimated to detect the possible equipment failure and to provide proper suggestions for energy saving and thermal comfort. Second, as an operation strategy, the shutdown of the HVAC system was suggested to avoid the unnecessary operation of the HVAC system when office spaces were not occupied; and thus, the effective utilization of the HVAC system could be achieved. 2.2 Monitoring phase The living-lab approach was adopted to collect the indoor environmental quality in office spaces, in which the qualified environmental sensors were used. As a spatial-temporal scope, this study targeted two office spaces (which were mainly used for a cooperative work in an irregular manner) in “A\" office located in Hong Kong, and collected the real-time dataset in a summer season (from Jul. 31, 2017 to Sep. 30, 2017). . A centralized HVAC system was installed in “A\" office, and it could be adjusted by occupants via a control panel. Accordingly, the set-point temperature and on/off condition of the HVAC system could be controlled in two ways. On one hand, a fixed operation schedule could be applied to the office spaces via the BEMS with the on/off condition of the HVAC system, indicating that it automatically turns on at 7:00am and turns off at 23:00pm. On the other hand, the HVAC system could be turned on/off by occupants and the relevant set-point temperature could be adjusted by their preference. The environmental sensors (AWAIR) can collect the environmental indicators, such as temperature, humidity, CO2 concentration in real time. The sensor collects the environmental data in 1-min interval; however, the data are automatically calculated to the 15-min averaged value in a cloud server. The previous study conducted by De Mauro et al. [38] defined a “Big Data” as a dataset characterized by high volume, high velocity and high variety. With the definition, the dataset collected in this study can be defined as a “Big Data”. The five kinds of indicators in two office spaces were investigated in a nearly real-time resolution (i.e. every 1 min). That is, it exactly corresponds to “High Volume”, “High Velocity”, and “High Variety”. It should be noted that temperature and CO2 concentration were mainly investigated to develop a novel operation approach for the energy efficiency improvement of the HVAC system in office spaces. Supplementary Material (SM), SM Table S1 shows the details of the specifications of the environmental sensor. 2.3 Diagnostic phase Since the HVAC system is generally installed to maintain a comfortable indoor environment in “A\" office, the real-time environmental indicators were used to investigate the operation condition of the HVAC system and the potential of the energy efficiency improvement of the HVAC system. Considering the complexity of analysis methods (e.g. the number of indicators, the way how it is considered, etc.), this study diagnosed the current status of the energy efficiency of the HVAC system in two ways: (i) “basic analysis” - the set-point temperature of the HVAC system in office spaces by considering the indoor temperature; and (ii) “advanced analysis” - the effective utilization of the HVAC system in office spaces by considering the indoor temperature and CO2 concentration. 2.3.1 Basic analysis The occupants could adjust the set-point temperature of the HVAC system via the control panel. Regulations or standards in different climates were established for occupants to determine the set-point temperature of the HVAC system [27]. According to the “Guidance Notes for the Management of Indoor Air Quality in Offices and Public Places” [39] enacted by Hong Kong, the excellent class of indoor temperature is defined within a range of 20–25.5 °C, aiming to create a thermal comfort level of the indoor environment. Meanwhile, the “Energy Saving Charter 2017\" [40] launched by Environment Bureau in Hong Kong rather focuses on the energy-saving issue, appealing to maintain an averaged indoor temperature within a range of 24–26 °C in a summer season (i.e. from June to September). By thoroughly considering the aforementioned regulation standards, four classes of indoor temperature (i.e. Class 1-Class 4, divided by 20 °C, 24 °C, and 25.5 °C) were set in this study (refer to SM Table S2). Four ranges with different characteristics can be used to determine the set-point temperature of the HVAC system. • Class 1 (higher than 25.5 °C): This class could contribute to the energy saving in accordance with the regulation standard [40], but the thermal comfort requirement could not be met with the regulation standard [39]. That is, the energy saving could be achieved by turning off the HVAC system in summer; however, the temperature could not be satisfied with a thermal comfort level. • Class 2 (24–25.5 °C): This class could meet the regulation standards set by the government in Hong Kong [39,40] in terms of both of energy saving and thermal comfort issues. The set-point temperature of the HVAC system should be adjusted within a range of 24–25.5 °C as a preferred standard to simultaneously achieve two goals. • Class 3 (20–24 °C): This class could meet the thermal comfort requirement set by the government in Hong Kong [39]; however, the more energy would be consumed to keep the indoor temperature within a range of 20–24 °C (Class 3) compared to that of 24–25.5 °C (Class 2). This class (Class 3) is especially necessary and meaningful for such occupants as children, elderly, and patients, who are very sensitive to the indoor temperature. • Class 4 (lower than 20 °C): This class could meet neither the energy saving nor the thermal comfort issues. If the indoor temperature was set within a range of this class, occupants would feel cold, and potential problems (e.g. condensation [37]) could happen. In other words, more energy could be consumed without obtaining occupant’ satisfaction. Thus, the set-point temperature below 20 °C should be avoided. Meanwhile, it is not available to record all the values from the control panels of the existing HVAC system. Also, the values displayed on the control panels could deviate from the actual value controlled by the HVAC system (i.e. performance gap) due to the equipment failure inside the HVAC system [41–43]. Also, the historical values of the set-point temperature of the HVAC system were not recorded. Thus, an alternative way was adopted to estimate the set-point temperature by using the real-time temperature data measured by the environmental sensors. In general, a dead band could occur by the relevant properties of equipment. For example, the relationship between the set-point temperature and the dead band in a cooling mode can be explained as follows: (i) if the indoor temperature reaches or exceeds the maximum temperature (which can be established at the set-point temperature plus a half of dead band), the HVAC system starts operating in a cooling mode and (ii) if the indoor temperature reaches or is below the minimum temperature (which can be established at the set-point temperature minus a half of dead band), the HVAC system stops operating. In this way, the HVAC system would be operated to maintain the indoor temperature within the dead band (refer to the blue dotted area in Fig. 1 ); and thus, the indoor temperature could be fluctuated around the set-point temperature. In this background, this study adopted an indirect way to calculate the averaged indoor temperature and regarded it as the set-point temperature of the HVAC system. Meanwhile, the CPA can be adopted to dividing time periods by considering the set-point temperatures of the HVAC system. The CPA is a univariate statistical analysis technique to detect the change in the statistical properties of a sequence of data [44]. The CPA has been applied in many fields, such as fault detection [16], occupancy estimation [45,46], and the financial exchange rate analysis [47]. The mean temperature was regarded as the set-point temperature of the HVAC system in the CPA model. The change point detection process can be illustrated as follows. The dataset on the indoor temperatures was collected in 15-min interval by the environmental sensors, and the default operation schedules of the HVAC systems in two office spaces were automatically controlled from 7:00 through 23:00. Thus, the 64 datasets of the indoor temperatures between 7:00 to 23:00 were used as inputs in the CPA model. Let the time-series data of the indoor temperatures and the data for each sampling time (15-min interval) denoted by T and Ti, respectively (where i = 1, 2, …, 64). According to Equation (1), T was separated into different segments by considering the different change points (θ1, θ2, …, θj) [45]. The adjacent segments can be featured with various statistical properties (i.e., the mean value of the indoor temperatures for 15-min interval). Among various CPA algorithms, this study adopted the “changepoint” R package developed by Killick and Eckley [48–51]. The function (i.e. “cpt.mean ()\") to identify the changes in mean values was chosen, in which the parameters were selected with the Schwartz information criterion (SIC) as a penalty and the power of the pruned exact linear time (PELT) as a method. (1) T = { T 1 ( i , w 1 ) + e 1 ( i ) , 1 ≤ i < θ 1 T 2 ( i , w 2 ) + e 2 ( i ) , θ 1 < i < θ 2 … … T j ( i , w j ) + e j ( i ) , θ j − 1 < i ≤ 64 where, Tk (i,wk) is the function to describe the statistical property of the kth segment; i is the sampling time; wk is the parameter vector; and ek(i) is the error term of the kth segment, k = 1, 2, …, j. Fig. 1 shows an example of the CPA model in the large office space on Aug. 15, 2017. The indoor temperatures collected in 15-min interval between 7:00 to 23:00 were numbered in order from 1 to 64, and they were used as the inputs of the function “cpt.mean ()\" in the “changepoint” R package. After running the “R\" programming language, the 11th data (i.e. temperature at 9:30) was identified as the change point; and thus, the dataset between 7:00 to 23:00 were divided into two segments: (i) 7:00–9:15 (the first segment) and (ii) 9:30–23:00 (the second segment). The mean value in the period of 7:00–9:15 (the first segment) and 9:30–23:00 (the second segment) were 27.13 °C and 20.00 °C, respectively. Since the set-point temperature of the HVAC system could be adjusted with the increment of 0.5 °C via its control panel, the calculated mean temperature should be rounded to the first decimal place with a value of 0 or 5 (e.g., from the calculated mean temperature of 27.13 °C to the rounded value of 27.0 °C). As explained earlier, there are four classes on the indoor temperature by considering the regulation standards set by the government in Hong Kong. Assuming that if the indoor temperature lies in Class 1 (i.e. higher than 25.5 °C), the HVAC system could be inferred to be turned off. If the indoor temperature lies in Class 3 (i.e. 20–24 °C), the level of thermal comfort could be satisfied, and the potential of energy savings could be more increased. In the example shown in Fig. 1, it could be inferred: (i) the HVAC system was not operated between 7:00–9:15 (the first segment); and (ii) the energy saving could be achieved if the set-point temperature between 9:30–23:00 (the second segment) would be increased to Class 2 (i.e. 24–25.5 °C). For the whole dataset from 31 Jul. through 30 Sep. in 2017, it can be found in SM Tables S3–S4 (for small and large office spaces, respectively). 2.3.2 Advanced analysis Occupants can have an effect on the indoor environment in both ways: (i) passive way (e.g. heat generation, moisture generation, CO2 emission, and pollutant emission); and (ii) active way (e.g. controlling electronic equipment) [52]. To remove these artificial impacts and to maintain the indoor environmental indicators within a comfortable range, it is a reliable and essential way to operate the HVAC system in hot and humid regions, such as Hong Kong [53]. However, considering the gap between the amount of influence from occupants and the capacity of the HVAC system, it is not easy to identify the exact cause of the change in the indicators. The main features of the temperature and CO2 concentration in a cooling mode of the HVAC system can be explained as follows [54–58], and others (i.e., humidity, VOCs and micro dust) can be found in SM Table S6 [59–65]. • Temperature: Compared to the capacity of the HVAC system in a cooling mode, the increase in the indoor temperature by occupants' activities would be a negligible amount. Thus, the variation of the indoor temperature can be used as a proxy indicator to evaluate whether the HVAC system would be being operated. For example, if the indoor temperature would decrease for more than 30 min or be kept below 25.5 °C, it is assumed that the HVAC system would be operated; otherwise, it would be turned off.. • CO 2 concentration: When an office space is being occupied, the CO2 concentration would generally increase due to the metabolic process [54–56]. Even if the mechanical ventilation of the HVAC system is being operated so to bring a certain amount of fresh air, the CO2 emissions from occupants could evidently contribute to the increase in the CO2 concentration [57,58]. Thus, as a proxy indicator, the CO2 concentration can be adopted to evaluate whether the office spaces are being occupied. For example, if the CO2 concentration would increase for more than 30 min, an occupant would be regarded to have come into an office space (i.e. starting a meeting); otherwise, it would be regarded to have left an office space (i.e. finishing a meeting). By considering the real-time data of indoor temperature and CO2 concentration simultaneously, it is possible to judge whether the HVAC system would be effectively operated. If the HVAC system would be operated during a meeting, it would be meaningful to keep a comfortable environment. Otherwise, the HVAC system should be turned off so as to achieve the potential of the energy efficiency improvement of the HVAC system. Fig. 2 shows the time-series indoor temperature and CO2 concentration in the large office space on Sep. 25, 2017, illustrating the aforementioned evaluation process.where, EURH is the effective utilization ratio of the HVAC system (%); ODH is the operation duration of the HVAC system (hour); and DM is the duration of meeting (hour). (3) A E U R H = A D M A O D H where, AEURH is the accumulated effective utilization ratio of the HVAC system (%); AODH is the accumulated operation duration of the HVAC system (hour); and ADM is the accumulated duration of meeting (hour). 2.4 Intervention phase 2.4.1 Basic control strategy As explained in Section 2.3.1, the function “cpt.mean ()\" in the “changepoint” R package was adopted to estimate the set-point temperature of the HVAC system. On one hand, in case of reaching a lower set-point temperature, the indoor temperature would first decrease to the minimum limit of the corresponding set-point temperature (Tmin), and then it would fluctuate within a certain range between “Tmin” and “Tmin plus dead band”. That is, the basic concept for the real-time estimation of the lower set-point temperature of the HVAC system is to identify “Tmin” and a certain temperature that lies between “Tmin” and “Tmin plus dead band”. On the other hand, in case of reaching a higher set-point temperature, the indoor temperature would first increase to the maximum limit of the corresponding set-point temperature (Tmax), and then it would fluctuate within a certain range between “Tmax” and “Tmax minus dead band”. That is, the basic concept for the real-time estimation of the higher set-point temperature of the HVAC system is to identify “Tmax” and a certain temperature that lies between “Tmax” and “Tmax minus dead band\". In short, a control strategy with the estimated set-point temperature of the HVAC system in real time can be developed for: (i) detecting the potential failures in the HVAC system and (ii) providing feedbacks on the adjustment of the set-point temperature within the preferred range (i.e. Class 2, 24–25.5 °C) if necessary. 2.4.2 Advanced control strategy For the office spaces with irregular occupancy schedule, it would be so difficult to pre-set the operation schedule of the HVAC system; and thus, the predictive control would not be applicable for the HVAC system in office spaces. In addition, the meeting attendees would seldom turn off the HVAC system after meeting; and thus, it would be unreliable to turn on/off the HVAC system in a manual way. In this regard, the real-time occupancy-based control strategy for the HVAC system in office spaces would be a promising way. According to Equations (2) and (3), the AEURH and EURH are in proportion to the ADM and DM; but in inversely proportion to the AODH and ODH. Since the ADM and DM would be difficult to be predicted and controlled, the AODH and ODH were determined as target parameters. That is, the HVAC system should be properly operated only during the meeting periods, and it should be turned off when there is no occupant. In this way, the AEURH and EURH could be optimized to the value of 100% (i.e. completely effective utilization of the HVAC system). In short, the occupancy-based control strategy would be a reactive control one, which could respond to the absence of occupants in real time by investigating the CO2 concentration. Further, this approach could consider the occupants’ preference and behaviors, because it would be promised for the HVAC system to be operated during the meeting periods. 3 Results and discussion This study used the real-time indoor environmental indicators to analyze the potential of the energy efficiency improvement of the HVAC system in office spaces. The detailed analyses were conducted, and the relevant control strategies were developed in two ways. 3.1 Basic analysis and control 3.1.1 Basic analysis Fig. 3 shows the distribution of the indoor temperature in two office spaces in accordance with four classes set by the regulation standards in Hong Kong [39,40]. As explained in SM Table S2, four classes have different characteristics in terms of energy saving and thermal comfort, this study analyzed the distribution of the indoor temperature by class. • Class 1 (higher than 25.5 °C): The proportions were determined at 30.46% and 33.50% for the small and large office spaces. During the meetings, it is required to take the thermal comfort into account; and thus, an automatic control strategy should be adopted to turn on the HVAC system in a timely manner. • Class 2 (24–25.5 °C): The smallest proportions were determined at 17.08% and 6.87% for the small and large office spaces, indicating that it would be possible to simultaneously achieve both of energy saving and thermal comfort. • Class 3 (20–24 °C): The largest proportions were determined at 47.10% and 41.34% for the small and large office spaces, in which there would be huge potential for energy saving if the indoor temperature could be adjusted within the range of Class 2 (i.e. 24-25.5 °C), especially to the upper limit of Class 2 (i.e. 25.5 °C). In addition, thermal comfort would still be satisfied in this class. • Class 4 (lower than 20 °C): The proportions were determined at 5.36% and 18.29% for the small and large office spaces, indicating that the set-point temperature would be set at a very low level (especially for the large office space). This class should be entirely avoided because of uncomfortable cold feeling, energy waste, and dew condensation. Based on these analyses, it can be said that the indoor temperature needs to be properly maintained within the prescribed range so that both of energy saving and thermal comfort could be simultaneously managed. To do so, it is necessary to firstly understand the current status of the set-point temperature of the HVAC system. As shown in SM Tables S3–S4, the set-point temperature of the HVAC system was estimated within a range of 19.5–27.5 °C for the small office space and 17.5–29.0 °C for the large office space. Also, Fig. 4 shows the frequency of the estimated set-point temperature of the HVAC system in two office spaces, in which the median value of the set-point temperature was calculated to clearly evaluate the skewness of the distribution. They were determined at 22.0 °C and 21.0 °C (which belonged to Class 3; 20–24 °C) for the small and large office spaces, indicating that occupants would tend to designate the lower set-point temperatures for a cooler indoor environment, and they would neglect the energy-saving aspect in two rooms. Therefore, it is required to achieve the energy savings by deploying a real-time automatic control process, which could estimate the set-point temperature of the HVAC system and adjust it to Class 2 (24–25.5 °C, especially to the upper limit of 25.5 °C) in a timely manner. 3.1.2 Basic control strategy Fig. 5 shows a logical flowchart for estimating the set-point temperature of the HVAC system in real time, which can be applied to (i) anomaly detection of the HVAC system and (ii) suggestion of the adjustment of the set-point temperature to the preferred range (e.g. Class 2 of 24–25.5 °C). A basic control strategy can be deployed in the following five steps. • (i) Judgement of whether the set-point temperature decreases: If the data declines from the initial sampling time (T(0)) through the first sampling time (T(1)), it results that the set-point temperature of the HVAC system could be regarded to decrease to a lower value for the last 15 min, and the step (ii-1) will be followed to estimate the set-point temperature in real time. Otherwise, the set-point temperature of the HVAC system could be regarded to increase to a higher value, and the step (ii-2) will be followed. • (ii-1/ii-2) Calculation of the mean value of the indoor temperature: Depending on the judgement in step (i), the way how the set-point temperature is estimated could be determined. The basic concept of step (ii-1) is to identify “Tmin” and to calculate the mean value of temperatures that lie between “Tmin” and “Tmin plus dead band”. First, T(1) is initially set as “Tmin”. As the sampling time increases, “Tmin” will be replaced repeatedly by the temperatures lower than “Tmin” (i.e. “Tmin candidates”). As shown in Fig. 1, the dead band of the HVAC system was determined at 2 °C; and thus, the temperature between “Tmin” and “Tmin + 2 °C″ will be considered to calculate the mean value (“Tm”). In the process, “i\" is the cycle counter to count the sampling times; “j\" is the cycle counter to count the number of stabilized data between “Tmin” and “Tmin + 2 °C\"; and “k\" is the cycle counter to count the number of “Tmin candidate”. “Tmin” could be determined in a cyclic process, in which the equality between i and k is used to evaluate whether to proceed to the next process. In other words, if the data collected in the current sampling time would be lower than “Tmin” after the stabilization period of the indoor temperature (i.e. between “Tmin” and “Tmin + 2 °C″), it would replace “Tmin” but not be treated as “Tmin candidate”. This is because the indoor temperature should decrease to “Tmin” directly after establishing the set-point temperature; and then, it would fluctuate within the dead band. As for the step (ii-2), the basic concept is to identify “Tmax” and to calculate the mean value of temperatures that lie between “Tmax” and “Tmax minus dead band”, which is very similar to step (ii-1). • (iii) Estimation of the set-point temperature: If the number of stabilized data (“j\") is no less than the value of 2, it indicates that the indoor temperature has been within the dead band (i.e., stabilized change) for at least 30 min. In this case, the mean value (“Tm”), rounded to the first decimal place with the value of 0 or 5, would be regarded as the estimated set-point temperature of the HVAC system (“TEs\"). • (iv) Anomaly detection of the HVAC system: The estimated set-point temperature (“TEs”) could be compared with the designated set-point temperature displayed on control panel (“Ts”). If the difference between “TEs” and “Ts” would be within a certain level (e.g. 0.5 °C), the HVAC system could be considered to be operated in a normal condition. Otherwise, it could be assumed to have any of equipment failures (e.g. bias of the measured data in a sensor, or signal errors) inside the HVAC system. In this case, it should be recommended to check and calibrate the working condition of the HVAC system. • (v) Suggestion of the adjustment of the set-point temperature: If the estimated set-point temperature (“TEs”) is maintained below a certain range, it could be recommended to adjust the set-point temperature within the range of 24–25.5 °C (e.g., Class 2). 3.2 Advanced analysis and control 3.2.1 Advanced analysis Table 3 and SM Table S5 show the “advanced analysis” for the effective utilization of the HVAC system in two office spaces. Considering that the HVAC system is automatically operated by the BEMS, the shutdown periods (i.e. from 23:00 p.m. to 7:00 a.m. in working days as well as the whole day in holidays) were not included in calculating the ODH (refer to the third column in Table 3 and SM Table S5). For example, the HVAC system in the large office space would start to operate at 8:30 a.m. on 1 August, and it would be kept operating despite no meeting until the automatic shutdown by the BEMS at 23:00 p.m. in the same day. Then, the HVAC system would be turned on automatically by the BEMS at 7:00 a.m. in 2 August, and it would be kept despite no meeting until the manual turn-off at 14:15 p.m. in 2 August (refer to the shaded area of Table 3). As a result, the ODH was determined at 21.75 h, which was summed up by 14.5 h (from 8:30 a.m. to 23:00 p.m.) and 7.25 h (from 7:00 a.m. to 14:15 p.m.). The results can be described in detail from the different perspectives as follows: First, on the macro level, even if the AEURH would be determined at a very small value, it could be expected to have a large potential of the energy efficiency improvement of the HVAC system in two office spaces. In other words, the ADM and AODH were determined at 99.75 and 220.25 h for the small office space and at 214.25 and 531.5 h for the large office space. The large difference between the ADM and AODH indicates that the HVAC system would not be effectively operated in the office spaces. As a result, the AEURH was determined at 45.29% for the small office space and at 40.29% for the large office space. For the small office space, the amount of energy consumed by the HVAC system would be suitably used at a level of 45.29% to provide meeting attendees with a comfortable indoor temperature, while 54.71% of the energy consumption in a cooling mode would be wasted in an unoccupied room. For the large office space, only 40.29% of the cooling energy supplied by the HVAC system would be meaningful, and 59.71% could be potentially saved. Second, on the micro level, it was determined that the two office spaces would be irregularly occupied, and the HVAC system would not be timely controlled before and after the meetings, leading to energy waste. The detailed results were explained as follows. • The meeting schedule: Compared to a regularly occupied space in a normal nine-to-five working mode, the two office spaces were determined to be irregularly occupied. Thus, it would be very difficult to define the meeting schedule and to set up the designated operation schedule of the HVAC system in advance. • The operation of the HVAC system in office spaces: Since the HVAC system in an office space could be controlled in a manual mode, it would be often excessively operated so that a large amount of cooling energy could be wasted. As shown in Table 3 and SM Table S5, in most of cases, the DM was evidently smaller than the ODH, of which ratio (i.e. EURH) was ranged between 16.00 and 58.62% for the small office space and 26.79–66.67% for the large office space. It means that the meeting attendees would forget turning off the HVAC system and make it continue to work for a long period after the meeting. As a result, the HVAC system has not been properly operated, indicating that 41.38–84.00% and 33.33–73.21% of energy consumption by the HVAC system would be wasted in the small and large office spaces despite no person in there. Therefore, considering the accumulated value (i.e. AEURH) or individual value (i.e. EURH) in two office spaces, it is possible to achieve a large potential of the energy efficiency improvement of the HVAC system. To do so, the automatic control strategy for the real-time occupancy-based shutdown control of the HVAC system can be implemented. 3.2.2 Advanced control strategy Fig. 6 shows a logical flowchart for the automatic on/off control of the HVAC system in real time, which can be applied to improve the effective utilization of the HVAC system. The main concept is to timely turn off the HVAC system after the meeting by considering the CO2 concentration. An advanced control strategy can be deployed in the following five steps. • (i) Data collection: As shown in SM Table S1 (specifications of the indoor environmental sensor), the dataset collected in 1-min interval on the CO2 concentration (“CO2 (i)\") and indoor temperature (“T (i)\") can be used to develop the advanced control strategy, in which “i\" is the cycle counter to count the sampling times. • (ii) Judgment of whether the CO 2 concentration decreases: If the CO2 concentration would decrease for 1 min, step (iii) will be conducted. Otherwise, the process will be restarted for the first step. • (iii) Judgment of whether the indoor temperature decreases or keeps at a low level: If the indoor temperature would be below 25.5 °C (i.e., the upper limit of Class 2), the indoor temperature would be kept at a low level. If the aforementioned condition would happen, step (iv) will be conducted. Otherwise, the process will be restarted for the first step. • (iv) Judgment of whether the HVAC system keeps operating after the meeting: This step could be conducted only when the conditions in steps (ii) and (iii) could be satisfied. It means that the CO2 concentration would decrease for 15 min and the indoor temperature would decrease or be kept at a low level for 15 min. That is, it can be judged that the HVAC system would keep operating after the meetings. In this case, step (v) will be conducted. Otherwise, the process will be restarted for the first step. • (v) Automatic on/off control of the HVAC system: This step would be conducted only when the conditions in step (iv) could be satisfied, indicating that occupants would forget to turn off the HVAC system and the HVAC system should be turned off automatically. 3.3 Discussion The real-time automatic control strategies proposed in this study can be utilized in connection with renewable and sustainable energy systems in buildings as follows. • Demand response: The basic control strategy can be linked to the demand response program in buildings. That is, it is possible to control the set-point temperature of the HVAC system in more accurate manner so as to avoid the peak load at a specific point in time. Through this approach, it is expected to create an opportunity to receive incentives from the government according to demand response program. • Distributed generation system: The advanced control strategy can be linked to the distributed generation system in buildings. That is, irregularly occupied space (e.g., meeting room) can be connected to distributed generation systems (e.g. building-integrated photovoltaic, fuel cell, etc.), which provides energy to a space once it is occupied. Also, the potential energy savings can be utilized to operate a fuel cell system. Meanwhile, the following issues can be treated to further improve the proposed real-time automatic control strategies in the follow-up studies. • Basic control strategy: It is needed to consider the subjective perception of occupants and the adaptability to other districts with more comprehensive classes. Also, it is required to determine the threshold level of the number of stabilized data (“j\") in step (iii) of Fig. 5 as well as the threshold level of difference between the estimated set-point temperature (“TEs”) and the designated one displayed on control panel (“Ts”) in step (iv) of Fig. 5. • Advanced control strategy: To further improve the accuracy of the automatic on/off control of the HVAC system, it is suggested to determine the threshold level of the low temperature level in step (iii) of Fig. 6 and the cycle counter value (i) in step (iv) of Fig. 6 by considering the project characteristics and the relevant properties and by calibrating the control strategy with the ground truth. 4 Conclusions This study aimed to develop a novel operation approach for the energy efficiency improvement of the HVAC system in office spaces, in which the real-time big data analytics were adopted. The living-lab approach was used to conduct the field measurement for two office spaces (i.e. the large and small office spaces) in “A\" office located in Hong Kong from 31 Jul. through 30 Sep. in 2017. The real-time indoor environmental indicators were used to analyze the current operation status of the HVAC system and to propose the automatic control strategies in the following two ways. (i) Basic control strategy: The set-point temperature of the HVAC system was estimated by the CPA model that could identify the mean value of the indoor temperature in real time. Then, the median value of the estimated set-point temperature was calculated to clearly evaluate the skewness of the distribution, resulting at 22.0 °C and 21.0 °C for the small and large office spaces, respectively. It could be stated that occupants would tend to set up the lower set-point temperatures for a cooler indoor environment, indicating that a large amount of cooling energy could be wasted. To solve this problem, this study proposed a logical control strategy for estimating the set-point temperature of the HVAC system in real time, which can be used to conduct the anomaly detection of the HVAC system and to automatically adjust the set-point temperature within a preferred range. (ii) Advanced control strategy: The effective utilization level of the HVAC system was evaluated by comparing the meeting schedule and the operation of the HVAC system in office spaces. On a macro level, the accumulated effective utilization ratio of the HVAC system (AEURH) was determined at 45.29% for the small office space and at 40.29% for the large office space, indicating that 54.71% of the cool energy consumption for the small office space would be wasted in an unoccupied mode; and 59.71% for the large office space. That is, it could be judged that the HVAC system would be kept operating since occupants would forget to turn off the HVAC system after the meetings. To solve this problem, this study proposed a logical control strategy for the automatic on/off control of the HVAC system in real time, which can be used to timely turn off the HVAC system after the meetings by considering the variation of the temperature and CO2 concentration in real time In conclusion, this study can be a promising attempt for achieving the energy efficiency improvement of the HVAC system in irregularly occupied offices (i.e. office spaces) by utilizing real-time big data. Particularly, the occupancy in a room could be detected by the variation of the CO2 concentration in a non-intrusive manner. Furthermore, it is expected to have a large amount of energy saving potential by effectively operating the HVAC system in irregularly occupied rooms, where the traditional centralized control system (i.e. BEMS) with a fixed schedule and manual control mode would not be appropriate. CRediT authorship contribution statement Wenzhuo Li: Investigation, Data curation, Writing - original draft. Choongwan Koo: Supervision, Conceptualization, Funding acquisition, Writing - review & editing. Taehoon Hong: Conceptualization, Project administration, Funding acquisition. Jeongyoon Oh: Conceptualization, Resources, Validation. Seung Hyun Cha: Conceptualization, Formal analysis. Shengwei Wang: Conceptualization, Methodology. Declaration of competing interest The authors declare no competing financial interest. Acknowledgements This work was supported by the National Research Foundation of Korea (NRF) grant funded by the Korean government (MSIP; Ministry of Science, ICT & Future Planning) (NRF-2020R1C1C1004147). Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Appendix A Supplementary data Supplementary data to this article can be found online at https://doi.org/10.1016/j.rser.2020.109885. References [1] National Development and Reform Commission Comprehensive work plan for conserving energy and reducing emissions for the thirteenth five-year plan 2016 National Development and Reform Commission 2019 http://www.ndrc.gov.cn/zcfb/zcfbqt/201701/W020170105634585914832.pdf National Development and Reform Commission, Comprehensive Work Plan for Conserving Energy and Reducing Emissions for The Thirteenth Five-year Plan (National Development and Reform Commission), 2016. http://www.ndrc.gov.cn/zcfb/zcfbqt/201701/W020170105634585914832.pdf. 2019). [2] M. Ouf M. Issa P. Merkel Analysis of real-time electricity consumption in Canadian school buildings Energy Build 128 2016 530 539 M. Ouf, M. Issa, P. Merkel, Analysis of real-time electricity consumption in Canadian school buildings, Energy and Buildings 128 (2016) 530-539. [3] The electrical & mechanical services department of the government of the Hong Kong special administrative region 2017 Hong Kong Energy End-use Data 2017 The Electrical & Mechanical Services Department of the Government of the Hong Kong Special Administrative Region, Hong Kong Energy End-use Data 2017, 2017. [4] M.S. Gul S. Patidar Understanding the energy consumption and occupancy of a multi-purpose academic building Energy Build 87 2015 155 165 M.S. Gul, S. Patidar, Understanding the energy consumption and occupancy of a multi-purpose academic building, Energy and Buildings 87 (2015) 155-165. [5] S. Katipamula R.M. Underhill J.K. Goddard D.J. Taasevigen M. Piette J. Granderson R.E. Brown S.M. Lanzisera T. Kuruganti Small-and medium-sized commercial building monitoring and controls needs: a scoping study, Pacific Northwest National Lab.(PNNL) 2012 Richland, WA (United States) S. Katipamula, R.M. Underhill, J.K. Goddard, D.J. Taasevigen, M. Piette, J. Granderson, R.E. Brown, S.M. Lanzisera, T. Kuruganti, Small-and medium-sized commercial building monitoring and controls needs: A scoping study, Pacific Northwest National Lab.(PNNL), Richland, WA (United States), 2012. [6] Energy Information Administration How many smart meters are installed in the United States, and who has them? 2016 2018 https://www.eia.gov/tools/faqs/faq.php?id=108&t=1 Energy Information Administration, How many smart meters are installed in the United States, and who has them?, 2016. https://www.eia.gov/tools/faqs/faq.php?id=108&t=1. 2018). [7] C. Miller Z. Nagy A. Schlueter A review of unsupervised statistical learning and visual analytics techniques applied to performance analysis of non-residential buildings Renew Sustain Energy Rev 81 2018 1365 1377 C. Miller, Z. Nagy, A. Schlueter, A review of unsupervised statistical learning and visual analytics techniques applied to performance analysis of non-residential buildings, Renewable and Sustainable Energy Reviews 81 (2018) 1365-1377. [8] J.-S. Chou N.-T. Ngo Time series analytics using sliding window metaheuristic optimization-based machine learning system for identifying building energy consumption patterns Appl Energy 177 2016 751 770 J.-S. Chou, N.-T. Ngo, Time series analytics using sliding window metaheuristic optimization-based machine learning system for identifying building energy consumption patterns, Applied Energy 177 (2016) 751-770. [9] X. Luo T. Hong Y. Chen M.A. Piette Electric load shape benchmarking for small- and medium-sized commercial buildings Appl Energy 204 2017 715 725 X. Luo, T. Hong, Y. Chen, M.A. Piette, Electric load shape benchmarking for small- and medium-sized commercial buildings, Applied Energy 204 (2017) 715-725. [10] J. An D. Yan T. Hong Clustering and statistical analyses of air-conditioning intensity and use patterns in residential buildings Energy Build 174 2018 214 227 J. An, D. Yan, T. Hong, Clustering and statistical analyses of air-conditioning intensity and use patterns in residential buildings, Energy and Buildings 174 (2018) 214-227. [11] Z. Ma R. Yan N. Nord A variation focused cluster analysis strategy to identify typical daily heating load profiles of higher education buildings Energy 134 2017 90 102 Z. Ma, R. Yan, N. Nord, A variation focused cluster analysis strategy to identify typical daily heating load profiles of higher education buildings, Energy 134 (2017) 90-102. [12] A. Ozawa R. Furusato Y. Yoshida Determining the relationship between a household's lifestyle and its electricity consumption in Japan by analyzing measured electric load profiles Energy Build 119 2016 200 210 A. Ozawa, R. Furusato, Y. Yoshida, Determining the relationship between a household’s lifestyle and its electricity consumption in Japan by analyzing measured electric load profiles, Energy and Buildings 119 (2016) 200-210. [13] J. Yang C. Ning C. Deb F. Zhang D. Cheong S.E. Lee C. Sekhar K.W. Tham k-Shape clustering algorithm for building energy usage patterns analysis and forecasting model accuracy improvement Energy Build 146 2017 27 37 J. Yang, C. Ning, C. Deb, F. Zhang, D. Cheong, S.E. Lee, C. Sekhar, K.W. Tham, k-Shape clustering algorithm for building energy usage patterns analysis and forecasting model accuracy improvement, Energy and Buildings 146 (2017) 27-37. [14] J.-S. Chou A.S. Telaga Real-time detection of anomalous power consumption Renew Sustain Energy Rev 33 2014 400 411 J.-S. Chou, A.S. Telaga, Real-time detection of anomalous power consumption, Renewable and Sustainable Energy Reviews 33 (2014) 400-411. [15] J.-S. Chou A.S. Telaga W.K. Chong G.E. Gibson Early-warning application for real-time detection of energy consumption anomalies in buildings J Clean Prod 149 2017 711 722 J.-S. Chou, A.S. Telaga, W.K. Chong, G.E. Gibson, Early-warning application for real-time detection of energy consumption anomalies in buildings, Journal of Cleaner Production 149 (2017) 711-722. [16] M. Horrigan W.J.N. Turner J. O'Donnell A statistically-based fault detection approach for environmental and energy management in buildings Energy Build 158 2018 1499 1509 M. Horrigan, W.J.N. Turner, J. O’Donnell, A statistically-based fault detection approach for environmental and energy management in buildings, Energy and Buildings 158 (2018) 1499-1509. [17] Y. Li M. Liu J. Lau B. Zhang Experimental study on electrical signatures of common faults for packaged DX rooftop units Energy Build 77 2014 401 415 Y. Li, M. Liu, J. Lau, B. Zhang, Experimental study on electrical signatures of common faults for packaged DX rooftop units, Energy and Buildings 77 (2014) 401-415. [18] C. Fan F. Xiao S. Wang Development of prediction models for next-day building energy consumption and peak power demand using data mining techniques Appl Energy 127 2014 1 10 C. Fan, F. Xiao, S. Wang, Development of prediction models for next-day building energy consumption and peak power demand using data mining techniques, Applied Energy 127 (2014) 1-10. [19] A. Afram F. Janabi-Sharifi A.S. Fung K. Raahemifar Artificial neural network (ANN) based model predictive control (MPC) and optimization of the HVAC systems: a state of the art review and case study of a residential HVAC system Energy Build 141 2017 96 113 A. Afram, F. Janabi-Sharifi, A.S. Fung, K. Raahemifar, Artificial neural network (ANN) based model predictive control (MPC) and optimization of the HVAC systems: A state of the art review and case study of a residential HVAC system, Energy and Buildings 141 (2017) 96-113. [20] A. Ghofrani M.A. Jafari Distributed air conditioning control in commercial buildings based on a physical-statistical approach Energy Build 148 2017 106 118 A. Ghofrani, M.A. Jafari, Distributed air conditioning control in commercial buildings based on a physical-statistical approach, Energy and Buildings 148 (2017) 106-118. [21] R. Kuroha Y. Fujimoto W. Hirohashi Y. Amano S.-i. Tanabe Y. Hayashi Operation planning method for home air-conditioners considering characteristics of installation environment Energy Build 177 2018 351 362 R. Kuroha, Y. Fujimoto, W. Hirohashi, Y. Amano, S.-i. Tanabe, Y. Hayashi, Operation planning method for home air-conditioners considering characteristics of installation environment, Energy and Buildings 177 (2018) 351-362. [22] A. Ghahramani K. Zhang K. Dutta Z. Yang B. Becerik-Gerber Energy savings from temperature setpoints and deadband: quantifying the influence of building and system properties on savings Appl Energy 165 2016 930 942 A. Ghahramani, K. Zhang, K. Dutta, Z. Yang, B. Becerik-Gerber, Energy savings from temperature setpoints and deadband: Quantifying the influence of building and system properties on savings, Applied Energy 165 (2016) 930-942. [23] T. Hoyt E. Arens H. Zhang Extending air temperature setpoints: simulated energy savings and design considerations for new and retrofit buildings Build Environ 88 2015 89 96 T. Hoyt, E. Arens, H. Zhang, Extending air temperature setpoints: Simulated energy savings and design considerations for new and retrofit buildings, Building and Environment 88 (2015) 89-96. [24] T. Labeodan C. De Bakker A. Rosemann W. Zeiler On the application of wireless sensors and actuators network in existing buildings for occupancy detection and occupancy-driven lighting control Energy Build 127 2016 75 83 T. Labeodan, C. De Bakker, A. Rosemann, W. Zeiler, On the application of wireless sensors and actuators network in existing buildings for occupancy detection and occupancy-driven lighting control, Energy and Buildings 127 (2016) 75-83. [25] W. Wang J. Wang J. Chen G. Huang X. Guo Multi-zone outdoor air coordination through Wi-Fi probe-based occupancy sensing Energy Build 159 2018 495 507 W. Wang, J. Wang, J. Chen, G. Huang, X. Guo, Multi-zone outdoor air coordination through Wi-Fi probe-based occupancy sensing, Energy and Buildings 159 (2018) 495-507. [26] L. Wang S. Greenberg J. Fiegel A. Rubalcava S. Earni X. Pang R. Yin S. Woodworth J. Hernandez-Maldonado Monitoring-based HVAC commissioning of an existing office building for energy efficiency Appl Energy 102 2013 1382 1390 L. Wang, S. Greenberg, J. Fiegel, A. Rubalcava, S. Earni, X. Pang, R. Yin, S. Woodworth, J. Hernandez-Maldonado, Monitoring-based HVAC commissioning of an existing office building for energy efficiency, Applied Energy 102 (2013) 1382-1390. [27] N. Yamtraipat J. Khedari J. Hirunlabh J. Kunchornrat Assessment of Thailand indoor set-point impact on energy consumption and environment Energy Pol 34 7 2006 765 770 N. Yamtraipat, J. Khedari, J. Hirunlabh, J. Kunchornrat, Assessment of Thailand indoor set-point impact on energy consumption and environment, Energy Policy 34(7) (2006) 765-770. [28] A. Ghahramani F. Jazizadeh B. Becerik-Gerber A knowledge based approach for selecting energy-aware and comfort-driven HVAC temperature set points Energy Build 85 2014 536 548 A. Ghahramani, F. Jazizadeh, B. Becerik-Gerber, A knowledge based approach for selecting energy-aware and comfort-driven HVAC temperature set points, Energy and Buildings 85 (2014) 536-548. [29] W. Kim S. Katipamula R. Lutes Improving HVAC operational efficiency in small-and medium-size commercial buildings Build Environ 120 2017 64 76 W. Kim, S. Katipamula, R. Lutes, Improving HVAC operational efficiency in small-and medium-size commercial buildings, Building and Environment 120 (2017) 64-76. [30] J.W. Moon S.-H. Han Thermostat strategies impact on energy consumption in residential buildings Energy Build 43 2–3 2011 338 346 J.W. Moon, S.-H. Han, Thermostat strategies impact on energy consumption in residential buildings, Energy and Buildings 43(2-3) (2011) 338-346. [31] D. Manjarres A. Mera E. Perea A. Lejarazu S. Gil-Lopez An energy-efficient predictive control for HVAC systems applied to tertiary buildings based on regression techniques Energy Build 152 2017 409 417 D. Manjarres, A. Mera, E. Perea, A. Lejarazu, S. Gil-Lopez, An energy-efficient predictive control for HVAC systems applied to tertiary buildings based on regression techniques, Energy and Buildings 152 (2017) 409-417. [32] J.W. Moon S.K. Jung Development of a thermal control algorithm using artificial neural network models for improved thermal comfort and energy efficiency in accommodation buildings Appl Therm Eng 103 2016 1135 1144 J.W. Moon, S.K. Jung, Development of a thermal control algorithm using artificial neural network models for improved thermal comfort and energy efficiency in accommodation buildings, Applied Thermal Engineering 103 (2016) 1135-1144. [33] Z. Yang B. Becerik-Gerber The coupled effects of personalized occupancy profile based HVAC schedules and room reassignment on building energy use Energy Build 78 2014 113 122 Z. Yang, B. Becerik-Gerber, The coupled effects of personalized occupancy profile based HVAC schedules and room reassignment on building energy use, Energy and Buildings 78 (2014) 113-122. [34] S. Nagarathinam H. Doddi A. Vasan V. Sarangan P. Venkata Ramakrishna A. Sivasubramaniam Energy efficient thermal comfort in open-plan office buildings Energy Build 139 2017 476 486 S. Nagarathinam, H. Doddi, A. Vasan, V. Sarangan, P. Venkata Ramakrishna, A. Sivasubramaniam, Energy efficient thermal comfort in open-plan office buildings, Energy and Buildings 139 (2017) 476-486. [35] L. Nikdel K. Janoyan S.D. Bird S.E. Powers Multiple perspectives of the value of occupancy-based HVAC control systems Build Environ 129 2018 15 25 L. Nikdel, K. Janoyan, S.D. Bird, S.E. Powers, Multiple perspectives of the value of occupancy-based HVAC control systems, Building and Environment 129 (2018) 15-25. [36] T. Hong C. Koo J. Kim M. Lee K. Jeong A review on sustainable construction management strategies for monitoring, diagnosing, and retrofitting the building's dynamic energy performance: focused on the operation and maintenance phase Appl Energy 155 2015 671 707 T. Hong, C. Koo, J. Kim, M. Lee, K. Jeong, A review on sustainable construction management strategies for monitoring, diagnosing, and retrofitting the building’s dynamic energy performance: Focused on the operation and maintenance phase, Applied Energy 155 (2015) 671-707. [37] W. Li C. Koo S.H. Cha T. Hong J. Oh A novel real-time method for HVAC system operation to improve indoor environmental quality in meeting rooms Build Environ 144 2018 365 385 W. Li, C. Koo, S.H. Cha, T. Hong, J. Oh, A novel real-time method for HVAC system operation to improve indoor environmental quality in meeting rooms, Building and Environment 144 (2018) 365-385. [38] A. De Mauro M. Greco M. Grimaldi A formal definition of Big Data based on its essential features Libr Rev 65 3 2016 122 135 A. De Mauro, M. Greco, M. Grimaldi, A formal definition of Big Data based on its essential features, Library Review 65(3) (2016) 122-135. [39] Indoor air quality management group of the government of the Hong Kong special administrative region, guidance Notes for the management of indoor air quality in offices and public places, 2003. [40] Environment Bureau in Hong Kong Energy saving charter 2017 http://www.energysaving.gov.hk/esc2017/en/home/index.html 2017 Environment Bureau in Hong Kong (2017), Energy Saving Charter 2017. http://www.energysaving.gov.hk/esc2017/en/home/index.html. 2017). [41] Z. Du B. Fan J. Chi X. Jin Sensor fault detection and its efficiency analysis in air handling unit using the combined neural networks Energy Build 72 2014 157 166 Z. Du, B. Fan, J. Chi, X. Jin, Sensor fault detection and its efficiency analysis in air handling unit using the combined neural networks, Energy and Buildings 72 (2014) 157-166. [42] J. Schein S.T. Bushby N.S. Castro J.M. House A rule-based fault detection method for air handling units Energy Build 38 12 2006 1485 1492 J. Schein, S.T. Bushby, N.S. Castro, J.M. House, A rule-based fault detection method for air handling units, Energy and Buildings 38(12) (2006) 1485-1492. [43] E.H. Borgstein R. Lamberts J.L.M. Hensen Mapping failures in energy and environmental performance of buildings Energy Build 158 2018 476 485 E.H. Borgstein, R. Lamberts, J.L.M. Hensen, Mapping failures in energy and environmental performance of buildings, Energy and Buildings 158 (2018) 476-485. [44] V. Guralnik J. Srivastava Event detection from time series data Proceedings of the fifth ACM SIGKDD international conference on Knowledge discovery and data mining 1999 ACM 33 42 V. Guralnik, J. Srivastava, Event detection from time series data, Proceedings of the fifth ACM SIGKDD international conference on Knowledge discovery and data mining, ACM, 1999, pp. 33-42. [45] A. Szczurek M. Maciejewska Detection of occupancy events from indoor air monitoring data, Mathematics and Computers in Sciences and in Industry (MCSI) 2016 third international conference on 2016 IEEE 229 234 A. Szczurek, M. Maciejewska, Detection of occupancy events from indoor air monitoring data, Mathematics and Computers in Sciences and in Industry (MCSI), 2016 Third International Conference on, IEEE, 2016, pp. 229-234. [46] P.F. Pereira N.M.M. Ramos Detection of occupant actions in buildings through change point analysis of in-situ measurements Energy Build 173 2018 365 377 P.F. Pereira, N.M.M. Ramos, Detection of occupant actions in buildings through change point analysis of in-situ measurements, Energy and Buildings 173 (2018) 365-377. [47] A. Zeileis A. Shah I. Patnaik Testing, monitoring, and dating structural changes in exchange rate regimes Comput Stat Data Anal 54 6 2010 1696 1706 A. Zeileis, A. Shah, I. Patnaik, Testing, monitoring, and dating structural changes in exchange rate regimes, Computational Statistics & Data Analysis 54(6) (2010) 1696-1706. [48] R. Killick I. Eckley changepoint: an R package for changepoint analysis J Stat Software 58 3 2014 1 19 R. Killick, I. Eckley, changepoint: An R package for changepoint analysis, Journal of statistical software 58(3) (2014) 1-19. [49] R. Killick I. Eckley Changepoint: analysis of changepoint models 2010 Lancaster University Lancaster, UK http://CRAN.R-project.org/pacakge=changepoint R. Killick, I. Eckley, Changepoint: analysis of changepoint models, Lancaster University, Lancaster, UK. URL http://CRAN. R-project. org/pacakge= changepoint (2010). [50] R. Killick P. Fearnhead I.A. Eckley Optimal detection of changepoints with a linear computational cost J Am Stat Assoc 107 500 2012 1590 1598 R. Killick, P. Fearnhead, I.A. Eckley, Optimal detection of changepoints with a linear computational cost, Journal of the American Statistical Association 107(500) (2012) 1590-1598. [51] R. Killick K. Haynes I. Eckley P. Fearnhead J. Lee Package ‘changepoint’, R package version 0.4.-2011 2016 http://cran.rproject.org/web/packages/changepoint/index.html R. Killick, K. Haynes, I. Eckley, P. Fearnhead, J. Lee, Package ‘changepoint’, R package version 0.4.-2011.-http://cran. rproject. org/web/packages/changepoint/index. html (2016). [52] D. Calì P. Matthes K. Huchtemann R. Streblow D. Müller CO 2 based occupancy detection algorithm: experimental analysis and validation for office and residential buildings Build Environ 86 2015 39 49 D. Cali, P. Matthes, K. Huchtemann, R. Streblow, D. Muller, CO 2 based occupancy detection algorithm: Experimental analysis and validation for office and residential buildings, Building and Environment 86 (2015) 39-49. [53] Z.T. Ai C.M. Mak D.J. Cui P. Xue Ventilation of air-conditioned residential buildings: a case study in Hong Kong Energy Build 127 2016 116 127 Z.T. Ai, C.M. Mak, D.J. Cui, P. Xue, Ventilation of air-conditioned residential buildings: A case study in Hong Kong, Energy and Buildings 127 (2016) 116-127. [54] M.S. Zuraimi A. Pantazaras K.A. Chaturvedi J.J. Yang K.W. Tham S.E. Lee Predicting occupancy counts using physical and statistical Co 2 -based modeling methodologies Build Environ 123 2017 517 528 M.S. Zuraimi, A. Pantazaras, K.A. Chaturvedi, J.J. Yang, K.W. Tham, S.E. Lee, Predicting occupancy counts using physical and statistical Co 2 -based modeling methodologies, Building and Environment 123 (2017) 517-528. [55] J. Yang M. Santamouris S.E. Lee Review of occupancy sensing systems and occupancy modeling methodologies for the application in institutional buildings Energy Build 121 2016 344 349 J. Yang, M. Santamouris, S.E. Lee, Review of occupancy sensing systems and occupancy modeling methodologies for the application in institutional buildings, Energy and Buildings 121 (2016) 344-349. [56] A. Szczurek M. Maciejewska A. Wyłomańska R. Zimroz G. Żak A. Dolega Detection of occupancy profile based on carbon dioxide concentration pattern matching Measurement 93 2016 265 271 A. Szczurek, M. Maciejewska, A. Wylomanska, R. Zimroz, G. Zak, A. Dolega, Detection of occupancy profile based on carbon dioxide concentration pattern matching, Measurement 93 (2016) 265-271. [57] Z. Chen C. Jiang L. Xie Building occupancy estimation and detection: a review Energy Build 169 2018 260 270 Z. Chen, C. Jiang, L. Xie, Building occupancy estimation and detection: A review, Energy and Buildings 169 (2018) 260-270. [58] L.M. Candanedo V. Feldheim Accurate occupancy detection of an office room from light, temperature, humidity and CO 2 measurements using statistical learning models Energy Build 112 2016 28 39 L.M. Candanedo, V. Feldheim, Accurate occupancy detection of an office room from light, temperature, humidity and CO 2 measurements using statistical learning models, Energy and Buildings 112 (2016) 28-39. [59] M. Luoma S.A. Batterman Characterization of particulate emissions from occupant activities in offices Indoor Air 11 1 2001 35 48 M. Luoma, S.A. Batterman, Characterization of particulate emissions from occupant activities in offices, Indoor air 11(1) (2001) 35-48. [60] C. Rösch T. Kohajda S. Röder M.v. Bergen U. Schlink Relationship between sources and patterns of VOCs in indoor air Atmospheric Pollution Research 5 1 2014 129 137 C. Rosch, T. Kohajda, S. Roder, M.v. Bergen, U. Schlink, Relationship between sources and patterns of VOCs in indoor air, Atmospheric Pollution Research 5(1) (2014) 129-137. [61] A. Szczurek A. Dolega M. Maciejewska Profile of occupant activity impact on indoor air — method of its determination Energy Build 158 2018 1564 1575 A. Szczurek, A. Dolega, M. Maciejewska, Profile of occupant activity impact on indoor air - method of its determination, Energy and Buildings 158 (2018) 1564-1575. [62] M. Guo X. Pei F. Mo J. Liu X. Shen Formaldehyde concentration and its influencing factors in residential homes after decoration at Hangzhou, China J Environ Sci 25 5 2013 908 915 M. Guo, X. Pei, F. Mo, J. Liu, X. Shen, Formaldehyde concentration and its influencing factors in residential homes after decoration at Hangzhou, China, Journal of Environmental Sciences 25(5) (2013) 908-915. [63] H. Hori S. Ishimatsu Y. Fueta T. Ishidao Evaluation of a real-time method for monitoring volatile organic compounds in indoor air in a Japanese university Environ Health Prev Med 18 4 2013 285 292 H. Hori, S. Ishimatsu, Y. Fueta, T. Ishidao, Evaluation of a real-time method for monitoring volatile organic compounds in indoor air in a Japanese university, Environ Health Prev Med 18(4) (2013) 285-292. [64] A. Caron B. Hanoune N. Redon P. Coddeville Gas sensor networks: relevant tools for real-time indoor air quality indicators in low energy buildings Proceedings of the healthy buildings europe 2015 conference 2015 A. Caron, B. Hanoune, N. Redon, P. Coddeville, Gas sensor networks: relevant tools for real-time indoor air quality indicators in low energy buildings, Proceedings of the Healthy Buildings Europe 2015 Conference, 2015. [65] C.-C. Jung P.-C. Wu C.-H. Tseng H.-J. Su Indoor air quality varies with ventilation types and working areas in hospitals Build Environ 85 2015 190 195 C.-C. Jung, P.-C. Wu, C.-H. Tseng, H.-J. Su, Indoor air quality varies with ventilation types and working areas in hospitals, Building and Environment 85 (2015) 190-195.",
    "scopus-id": "85085123032",
    "coredata": {
        "eid": "1-s2.0-S1364032120301787",
        "dc:description": "Since a traditional centralized control system (e.g., building energy management system) with a fixed schedule and manual control is not appropriate to irregularly occupied rooms, it is expected to have a large amount of energy saving potential in operating the HVAC system. To overcome this challenge, this study aimed to develop a novel operation approach for the energy efficiency improvement of the HVAC system in office spaces. The real-time indoor environmental indicators were collected and analyzed to evaluate the current operation status of the HVAC system as well as to propose a novel control strategy in two ways. The significant findings can be illustrated as follows. First, it could be stated that occupants would tend to establish a lower set-point temperature for a cooler indoor environment. To solve this issue, a basic control strategy was proposed to detect the anomaly detection of the HVAC system and to automatically adjust the indoor temperature within a preferred range. Second, it could be evaluated that the HVAC system would be kept operating since occupants would forget to turn off the HVAC system after the meetings. To solve this issue, an advanced control strategy was proposed to operate the automatic on/off control of the HVAC system by considering the indoor temperature and CO2 concentration in real time. The proposed strategies can contribute to a large amount of energy savings in operating the HVAC system of irregularly occupied spaces.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2020-07-31",
        "openaccessUserLicense": null,
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S1364032120301787",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Li, Wenzhuo"
            },
            {
                "@_fa": "true",
                "$": "Koo, Choongwan"
            },
            {
                "@_fa": "true",
                "$": "Hong, Taehoon"
            },
            {
                "@_fa": "true",
                "$": "Oh, Jeongyoon"
            },
            {
                "@_fa": "true",
                "$": "Cha, Seung Hyun"
            },
            {
                "@_fa": "true",
                "$": "Wang, Shengwei"
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S1364032120301787"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S1364032120301787"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": null,
        "pii": "S1364-0321(20)30178-7",
        "prism:volume": "127",
        "articleNumber": "109885",
        "prism:publisher": "Elsevier Ltd.",
        "dc:title": "A novel operation approach for the energy efficiency improvement of the HVAC system in office spaces through real-time big data analytics",
        "prism:copyright": "© 2020 Elsevier Ltd. All rights reserved.",
        "openaccess": "0",
        "prism:issn": "13640321",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Real-time big data analytics"
            },
            {
                "@_fa": "true",
                "$": "Energy efficiency"
            },
            {
                "@_fa": "true",
                "$": "Set-point temperature"
            },
            {
                "@_fa": "true",
                "$": "Change point analysis"
            },
            {
                "@_fa": "true",
                "$": "Occupancy-based control"
            },
            {
                "@_fa": "true",
                "$": "CO2 concentration"
            }
        ],
        "openaccessArticle": "false",
        "prism:publicationName": "Renewable and Sustainable Energy Reviews",
        "openaccessSponsorType": null,
        "prism:pageRange": "109885",
        "pubType": "fla",
        "prism:coverDisplayDate": "July 2020",
        "prism:doi": "10.1016/j.rser.2020.109885",
        "prism:startingPage": "109885",
        "dc:identifier": "doi:10.1016/j.rser.2020.109885",
        "openaccessSponsorName": null
    },
    "objects": {"object": [
        {
            "@category": "standard",
            "@height": "384",
            "@width": "535",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr1.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "64335",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "157",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr1.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "14680",
            "@ref": "gr1",
            "@mimetype": "image/gif"
        },
        {
            "@category": "standard",
            "@height": "323",
            "@width": "535",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr3.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "50261",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "132",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr3.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "13269",
            "@ref": "gr3",
            "@mimetype": "image/gif"
        },
        {
            "@category": "standard",
            "@height": "334",
            "@width": "535",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr2.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "82272",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "137",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr2.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "18411",
            "@ref": "gr2",
            "@mimetype": "image/gif"
        },
        {
            "@category": "standard",
            "@height": "895",
            "@width": "689",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr5.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "141043",
            "@ref": "gr5",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "126",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr5.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "12170",
            "@ref": "gr5",
            "@mimetype": "image/gif"
        },
        {
            "@category": "standard",
            "@height": "922",
            "@width": "535",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr4.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "208745",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "95",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr4.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "14100",
            "@ref": "gr4",
            "@mimetype": "image/gif"
        },
        {
            "@category": "standard",
            "@height": "812",
            "@width": "689",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr6.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "132655",
            "@ref": "gr6",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "139",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr6.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "12681",
            "@ref": "gr6",
            "@mimetype": "image/gif"
        },
        {
            "@category": "high",
            "@height": "1700",
            "@width": "2370",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr1_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "520020",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1431",
            "@width": "2371",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr3_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "243912",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1481",
            "@width": "2371",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr2_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "681543",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "3960",
            "@width": "3050",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr5_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "984339",
            "@ref": "gr5",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "4086",
            "@width": "2371",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr4_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "1984769",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "3596",
            "@width": "3050",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-gr6_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "809791",
            "@ref": "gr6",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-mmc1.doc?httpAccept=%2A%2F%2A",
            "@multimediatype": "Microsoft Word file",
            "@type": "APPLICATION",
            "@size": "403968",
            "@ref": "mmc1",
            "@mimetype": "application/word"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1364032120301787-am.pdf?httpAccept=%2A%2F%2A",
            "@multimediatype": "Acrobat PDF file",
            "@type": "AAM-PDF",
            "@size": "504244",
            "@ref": "am",
            "@mimetype": "application/pdf"
        }
    ]},
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/85085123032"
    }
}}