{"full-text-retrieval-response": {
    "scopus-eid": "2-s2.0-85110488684",
    "originalText": "serial JL 271089 291210 291731 291800 291881 31 90 Energy and Buildings ENERGYBUILDINGS 2021-07-09 2021-07-09 2021-07-19 2021-07-19 2022-01-31T19:00:21 1-s2.0-S0378778821005582 S0378-7788(21)00558-2 S0378778821005582 10.1016/j.enbuild.2021.111274 S300 S300.2 FULL-TEXT 1-s2.0-S0378778821X00175 2022-01-31T20:25:36.256548Z 0 0 20211101 2021 2021-07-09T08:44:45.529322Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid fundingbodyid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder sponsoredaccesstype srctitle srctitlenorm srctype ssids alllist content oa subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table e-component body mmlmath acknowledge affil appendices articletitle auth authfirstini authfull authkeywords authlast highlightsabst orcid primabst ref 0378-7788 03787788 UNLIMITED DEN21 true 250 250 C Volume 250 16 111274 111274 111274 20211101 1 November 2021 2021-11-01 2021 Research Articles article fla © 2021 The Author(s). Published by Elsevier B.V. DEVELOPMENTATOOLPREDICTSOCIOECONOMICCONSEQUENCESBETTERAIRQUALITYTEMPERATURECONTROLINCLASSROOMS TOFTUM J 1 Introduction 2 Methodology 2.1 Model framework 2.2 Modelling approach 2.2.1 Model to estimate outdoor air supply by infiltration 2.2.2 Model to estimate outdoor air supply with single-sided natural ventilation 2.2.2.1 Model to estimate outdoor air supply with cross-flow ventilation 2.2.3 Model to estimate indoor temperatures and heating and cooling needs 2.2.4 Model to estimate temperature and humidity of supply air with a cooling coil in the ventilation system 2.2.5 Occupant generation of heat, moisture and CO2 2.2.6 Classification of the indoor environment 2.2.7 Association between the classroom CO2 concentration and schoolwork performance and absence from school 2.2.8 Association between the classroom CO2-concentration and teacher absence 2.2.9 Association between classroom temperature and pupil performance 2.2.10 Scheme for evaluation of the socio-economic consequences of improved indoor environment in schools 2.2.11 Calculation of Net Present value of better indoor environment in school 3 Example calculation for a Danish school 4 Discussion 5 Conclusions Acknowledgements Appendix A Supplementary data References HADDAD 2016 S THERMALCOMFORTINNATURALLYVENTILATEDSCHOOLSAFIELDSTUDYTHERMALCOMFORTINIRANIANPRIMARYSCHOOLCLASSROOMS DEGIULI 2012 335 345 V TURUNEN 2014 733 739 M HELLWIG 2009 89 98 R GODWIN 2007 109 121 C MONTAZAMI 2012 A AIRCRAFTNOISEOVERHEATINGPOORAIRQUALITYINLONDONPRIMARYSCHOOLSCLASSROOMS BAKOBIRO 2012 215 223 Z TOFTUM 2015 494 503 J WYON 2010 12 16 D HAVERINENSHAUGHNESSY 2011 121 131 U GAIHRE 2014 569 574 S MENDELL 2013 515 528 M SIMONS 2010 1679 1686 E SHENDELL 2004 333 341 D GAO 2014 46 57 J SIMONI 2010 742 749 M CASTLEBERRY 2016 216 228 B DIASPEREIRA 2014 911 922 L CORGNATI 2008 801 809 S FISK 1997 158 172 W FISK 2000 537 566 W SHERMAN 1995 215 224 M CACIOLO 2011 1765 1773 M DEGIDS 1982 4 5 W KARAVA 2011 266 279 P AWBI 2003 H VENTILATIONBUILDINGS ELMAHDY 1977 103 117 A TASHTOUSH 2005 1729 1745 B SATISH 2012 1671 1677 U GUNNARSEN 1992 43 54 L WARGOCKI 2020 106749 P MILTON 2000 212 221 D WARGOCKI 2019 197 204 P HUEBENER 2017 15 34 M AUCEJO 2016 70 87 E BHULLER 2017 993 1030 M ANGRIST 1991 979 1014 J GRENET 2013 176 210 J PISCHKE 2007 1216 1242 J ASHENFELTER 1994 1157 1173 O SHERMAN 1986 M MEASUREDAIRLEAKAGEBUILDINGS COMPARISONMEASUREDPREDICTEDINFILTRATIONUSINGLBLINFILTRATIONMODEL AI 2014 292 300 Z CHOINIERE 1992 2563 2574 Y SANDBERG 2004 409 418 M KOKOGIANNAKIS 2008 209 219 G TOFTUMX2021X111274 TOFTUMX2021X111274XJ Full 2021-07-07T14:14:43Z FundingBody Denmark institutions 2021 http://creativecommons.org/licenses/by/4.0/ 2023-07-19T00:00:00.000Z 2023-07-19T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY license. © 2021 The Author(s). Published by Elsevier B.V. 2021-07-23T00:47:00.905Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/aggregated-refined European Union’s Horizon 2020 research and innovation programme H2020 Horizon 2020 Framework Programme http://data.elsevier.com/vocabulary/SciValFunders/100010661 http://sws.geonames.org/6695072/ 847101 FP7-COH Horizon 2020 http://data.elsevier.com/vocabulary/SciValFunders/100014028 http://sws.geonames.org/2802361 European Union's Horizon 2020 research and innovation programme Horizon 2020 http://data.elsevier.com/vocabulary/SciValFunders/501100007601 http://sws.geonames.org/6695072/ Realdania http://data.elsevier.com/vocabulary/SciValFunders/501100009479 http://sws.geonames.org/2623032 This paper is based on research undertaken in the EU-funded EERAdata project which has received funding from the European Union’s Horizon 2020 research and innovation programme under grant agreement No. 847101. Financial support for the development of the socio-economic calculation framework from Realdania is gratefully acknowledged. This paper is based on research undertaken in the EU-funded EERAdata project which has received funding from the European Union's Horizon 2020 research and innovation programme under grant agreement No. 847101. Financial support for the development of the socio-economic calculation framework from Realdania is gratefully acknowledged. 0 item S0378-7788(21)00558-2 S0378778821005582 1-s2.0-S0378778821005582 10.1016/j.enbuild.2021.111274 271089 2022-01-31T20:25:36.256548Z 2021-11-01 UNLIMITED DEN21 1-s2.0-S0378778821005582-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/MAIN/application/pdf/84e74dbf424cf3b21519d297f1c09031/main.pdf main.pdf pdf true 927614 MAIN 11 1-s2.0-S0378778821005582-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/PREVIEW/image/png/b8555c73e3470651256592b3844b1043/main_1.png main_1.png png 59362 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0378778821005582-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/gr1/DOWNSAMPLED/image/jpeg/c00e187060162540dfeefd5f6a541a27/gr1.jpg gr1 gr1.jpg jpg 85598 760 667 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821005582-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/gr2/DOWNSAMPLED/image/jpeg/04588f2efdd8f43fadafa5715a64e7df/gr2.jpg gr2 gr2.jpg jpg 26078 385 578 IMAGE-DOWNSAMPLED 1-s2.0-S0378778821005582-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/gr1/THUMBNAIL/image/gif/795acb09da6ba5fe6938734e2cb8c6fa/gr1.sml gr1 gr1.sml sml 6782 164 144 IMAGE-THUMBNAIL 1-s2.0-S0378778821005582-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/gr2/THUMBNAIL/image/gif/ac41b279678ef02774436cf04b4319a6/gr2.sml gr2 gr2.sml sml 3727 146 219 IMAGE-THUMBNAIL 1-s2.0-S0378778821005582-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/gr1/HIGHRES/image/jpeg/b8a8473df8144fdfb79a9be855642215/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 512368 3366 2953 IMAGE-HIGH-RES 1-s2.0-S0378778821005582-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/gr2/HIGHRES/image/jpeg/2ac600c960e318341c2df03383fc36fb/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 142739 1703 2559 IMAGE-HIGH-RES 1-s2.0-S0378778821005582-mmc1.docx https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/mmc1/MAIN/application/vnd.openxmlformats-officedocument.wordprocessingml.document/28c5c825ac67d3d6031f7cf2abaf0154/mmc1.docx mmc1 mmc1.docx docx 21585 APPLICATION 1-s2.0-S0378778821005582-si1.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/bf105e6dce9eb931db59018cfdbd3ba0/si1.svg si1 si1.svg svg 16270 ALTIMG 1-s2.0-S0378778821005582-si2.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/76ae1b68cb4c16f10a1d8d98660dabba/si2.svg si2 si2.svg svg 23813 ALTIMG 1-s2.0-S0378778821005582-si3.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/9b93c24dc8390030a59c53cb901d1be0/si3.svg si3 si3.svg svg 11660 ALTIMG 1-s2.0-S0378778821005582-si4.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/501b76d82c071efafdcadacc01d6b1bd/si4.svg si4 si4.svg svg 20786 ALTIMG 1-s2.0-S0378778821005582-si5.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/b5c67e8139f6b5b594688cf387931744/si5.svg si5 si5.svg svg 16220 ALTIMG 1-s2.0-S0378778821005582-si6.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/abf0cbfc9d31bfb8caf3e8ae94758abe/si6.svg si6 si6.svg svg 18114 ALTIMG 1-s2.0-S0378778821005582-si7.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0378778821005582/STRIPIN/image/svg+xml/1cae152b3dff9dd9f67ca78aeb1ce0a1/si7.svg si7 si7.svg svg 17095 ALTIMG 1-s2.0-S0378778821005582-am.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:109NKJ7JHH8/MAIN/application/pdf/2430556ff5aadebb3f348c6a94533203/am.pdf am am.pdf pdf false 447500 AAM-PDF ENB 111274 111274 S0378-7788(21)00558-2 10.1016/j.enbuild.2021.111274 The Author(s) Fig. 1 Flow diagram of the framework elements and calculation process. Fig. 2 Association between classroom ventilation rate and teacher illness absence (dashed segment indicates extrapolation). Based on Milton et al. [44]. Table 1 Quality categories for classrooms for temperature and CO2 concentration [27]. Quality category Temperature range for heating (winter) (°C) Temperature range for cooling (summer) (°C) CO2 concentration range (ppm) I 21–23 23.5–25.5 <950 II 20–21 and 23–24 23–23.5 and 25.5–26 950–1200 III 19–20 and 24–25 22–23 and 26–27 1200–1350 IV 17–19 and 24–25 21–22 and 27–28 1200–1350 Table 2 Estimated performance and absence at CO2-concentrations in different quality categories [43]. Category Category concentration range (ppm) Average concentration in interval (ppm) Relative performance of schoolwork (%) Relative daily attendance (%) I <950 100 100 II 950–1200 1075 96 99.7 III 1200–1350 1275 94 99.4 IV 1350–1750 1550 89 99.2 Outside category >1750 87 98 Table 3 Estimated teacher illness absence attributable to ventilation rate [44]. Category Ventilation rate (L∙s-1 per person) Relative attendance (%) Marginal difference in absence* (days per school year)* I >12 100 0 II 8,4–12 99,2 1.5 III 4,8 – 8,4 99 0.4 IV 3,1 – 4,8 98,9 0.2 Outside category <3,1 98.8 0.1 * At 200 school days per year Table 4 Association between temperature and pupil performance in different quality categories [45]. Quality category Temperature interval (°C) Mean temperature of interval (°C) Relative performance (%) I <23 22 93 II 23–24 23.5 87 III 24–25 24.5 85 IV 25–26 25.5 83 Outside category >26 80 Table 5 Properties of the building envelope of the example classroom. U (W∙ m−2∙K−1) g glazing Thermal accumulation capacity Leakage class Facade Floor Roof Window glazing Window frame 0.306 0.158 0.224 1.6 1.3 0.66 Medium (Table 12, ISO 13,790 2008) E (medium) (Table S1) Table 6 Calculated distribution of time during the school year when the CO2 concentration and temperature belong to different indoor environment quality categories with the studied ventilation modes. Type of ventilation Category CO2 (% of occupied time) Category temperature (% of occupied time) Heating energy demand (kWh m−2) I II III IV Outside I II III IV Outside Single-sided natural 12.7 11.8 6.8 22.4 46.3 32.5 10.8 10.9 8.0 37.8 55 Cross-flow natural 24.7 12.8 7.0 20.2 35.4 32.7 10.5 11.4 8.9 35.6 72 Mechanical, no cooling 67.9 32.1 0 0 0 75.5 6.1 5.3 4.7 8.4 67* * Heat recovery corresponding to 30 kWh m−2 was subtracted from the heating energy demand. Table 7 Socio-economic gains achieved by reduced absence among pupils, their parents and teachers and due to higher learning outcome caused by higher performance in school and by less absence from school. Single-sided natural ventilation Cross-flow natural ventilation Combined single-sided natural and mechanical ventilation NPV of reduced illness absence among pupils (M€) – 0.21 1.1 NPV of reduced illness absence among teachers (M€) – 0.02 0.08 NPV of higher learning performance due to better indoor environment while in school (M€) – 0.2 1.04 NPV of higher learning performance due to reduced absence from school (M€) – 0.03 0.17 Total NPV (M€) – 0.46 2.40 Development of a tool to predict the socio-economic consequences of better air quality and temperature control in classrooms Jørn Toftum a ⁎ Rune Andersen a Jose Joaquin Aguilera Prado a b Kristian Kolstrup c Daniel Sloth Hauberg c d Geo Clausen a a Department of Civil Engineering, Technical University of Denmark, 2800 Lyngby, Denmark Department of Civil Engineering Technical University of Denmark 2800 Lyngby Denmark Department of Civil Engineering, Technical University of Denmark, 2800 Lyngby, Denmark b Department of Mechanical Engineering, Technical University of Denmark, 2800 Denmark Department of Mechanical Engineering Technical University of Denmark 2800 Denmark Department of Mechanical Engineering, Technical University of Denmark, 2800 Denmark c Incentive AS, Holte Stationsvej 14, 1, 2840 Holte, Denmark Incentive AS Holte Stationsvej 14, 1 2840 Holte Denmark Incentive AS, Holte Stationsvej 14, 1, 2840 Holte, Denmark d Pfizer Denmark, Lautrupvang 8, 2750 Ballerup, Denmark Pfizer Denmark Lautrupvang 8 2750 Ballerup Denmark Pfizer Denmark, Lautrupvang 8, 2750 Ballerup, Denmark ⁎ Corresponding author at: Department of Civil Engineering, Technical University of Denmark, 2800 Lyngby, Denmark. Department of Civil Engineering Technical University of Denmark 2800 Lyngby Denmark A simplified modelling framework for the prediction of the indoor environment, energy use and socio-economic consequences of improving air quality and temperature in school buildings is suggested. The framework combines established models for infiltration and different modes of ventilation to estimate yearly distributions of the classroom temperature and CO2 concentration. These distributions are used as input to a prediction of pupil performance of schoolwork, their attendance at school, and teacher absence before and after refurbishment of their school building. Eventually, the framework estimates the socio-economic consequences of an improved classroom environment for a school and may be used to evaluate the feasibility of a range of different refurbishment scenarios and support decisions on building upgrades. Keywords Learning Indoor environment Simulations Wider benefits School Performance Ventilation 1 Introduction Across countries, climate regions and building traditions, elementary school classrooms regularly experience inadequate indoor environments [1–7]. Most prevalent issues are poor air quality and uncomfortable thermal conditions. Effects on pupils comprise reduced learning performance [8–11], increased illness absence [12–15] and reduced wellbeing [16,17]. There are many reasons why classroom conditions are often worse than recommended by relevant standards and guidelines, including inadequate financial resources for the upgrade of ageing school buildings and emphasis on energy conservation [18]. In Denmark, a country with 527.000 pupils in municipal primary and lower secondary school, it is estimated that the area of municipal school buildings amounts to 12 mio m2 [19]. A cautious estimate indicates a maintenance backlog of at least 1.9 billion € for these buildings [20]. This includes costs incurred in both unaccomplished maintenance and energy refurbishment. We have not been able to find similar estimations from other countries, but the magnitude of these numbers in Denmark indicate that financing of maintenance and upgrading of school buildings is a challenge to their municipal owners and managers. The costs projected to incur in renovation of school buildings can routinely be estimated through consultancy. Also, the direct benefits, such as higher energy efficiency, can be valuated with recognized methods and simulation tools. Increasing the energy efficiency of school buildings has therefore been a key driver for renovation [18,21,22] and in later years also municipal obligations to reduce green house gas emissions. Seen isolated, however, the direct benefits may not be sufficient to overcome financial and economical barriers and motivate wide ranging implementation of renovation initiatives. Careful planning and design of energy efficiency measures in schools will also benefit their indoor environment and bring about higher pupil learning and less absence from school [10,23]. Economic valuation of these wider benefits is far more imprecise than assessment of costs and direct benefits. However, even when using conservative estimates the value of the wider benefits may exceed the direct benefits by orders of magnitude [24]. Yet, wider benefits are rarely accounted for when making decisions on renovation of school buildings. One reason may be that the few available studies addressed nationwide valuation of the wider benefits of improved indoor environment, making it difficult to assess the benefits of renovation initiatives at school level. In their pioneering study, Fisk and Rosenfeld [23] showed that the potential financial benefits of improving indoor environments in a wide range of buildings exceeded renovation costs by a factor of 18 to 47. The socio-economic benefit of improving the air quality in Danish schools to a level corresponding to that in Swedish schools has been estimated to an annual increase in GDP of 200 million € (equivalent to approximately 0.08%) and an annual improvement in government finances of 36.2 million € [25]. The benefits came mostly from better qualified pupils that would be more productive in their working life and from less illness absence among their teachers. Analyses of this nature rely on somewhat general assumptions of the potential of improving the indoor environment at societal level and they cannot be used to evaluate the socio-economic potential of upgrading a particular school. The aim of this study was to use existing knowledge and standardised models to develop a simplified methodology to assess the wider benefits of energy and indoor environment measures in school buildings. 2 Methodology 2.1 Model framework A suite of programs already exists that can evaluate indoor environment and energy use of buildings, but most of these are proprietary and require comprehensive and detailed input by an expert user. Based on calculation methods reported in the scientific literature and in international standards, a transparent model framework was therefore established to estimate indoor temperature and air quality to evaluate the socio-economic consequences of energy efficiency and indoor environment upgrades of classrooms. With outset in a baseline level that may reflect a building's state prior to renovation, the tool estimates the effects of measures such as improving ventilation or envelope properties. These renovation measures affect mostly the thermal environment and the air quality. For this reason and because less information is available to express relationships between pupil performance and lighting or acoustical parameters, the calculations focus on thermal environment and air quality parameters [23,26]. 2.2 Modelling approach When evaluating wider benefits at building level, it is not meaningful to assume one fixed indoor environment condition before and another fixed condition after renovation, as was done by Fisk and Rosenfeld [23] and Slotsholm [25]. Occupant actions and varying internal and external loads cause variation of the indoor environment parameters that should be accounted for. Thus, to reflect the dynamics of buildings and their environments, distributions of temperatures and CO2 concentrations are used as input to the socio-economic assessment. This is aligned with the suggested assessment approach recommended in DS/EN 16798–1 [27]. The framework builds on several existing and peer-reviewed models for infiltration, one-sided natural ventilation, cross-flow natural ventilation, mechanical ventilation and energy performance. The calculation flow starts with definition of an existing object building (defined by location, geometry, air leakage, heat transfer properties, windows, ventilation, cooling and heating set-point temperatures). With a defined occupancy and occupancy schedule, the framework then calculates in hourly time steps the indoor temperature, air humidity and energy needed to heat and cool the building to maintain the specified temperature set points. As hourly time steps do not allow prediction of the dilution of the classroom air caused by short-term window opening events, calculation of natural ventilation is subsequently carried out with higher resolution, e.g. in 5 min time steps. The distribution of the output variables, such as indoor CO2 concentration, indoor temperature, air humidity, and ventilation rate are first established for a reference case and then the calculation is repeated for the upgraded building. Exposure-response functions are used with the distributions of classroom temperature and CO2 concentration to quantify differences in the performance of school work and illness absence, which are then used as input to the estimation of the wider benefits in monetary terms. In the following, the individual elements of the framework are described. First, each of the models used to predict indoor environment are summarized. Then the classification of the indoor environment as suggested in standards is described and finally how these classifications are used to estimate socio-economic effects of indoor environment exposures. So far, the models have been programmed in Java and implemented in a standalone application. Work is underway to convert this application to an online, open-access tool. Fig. 1 shows a flow diagram of the different elements of the framework and the calculation progress. 2.2.1 Model to estimate outdoor air supply by infiltration Infiltration is uncontrolled exchange of air through leaks in the building envelope. The outdoor air supply caused by infiltration depends on the building, its layout, the wind pressure on the building and on the indoor-outdoor temperature difference. The framework uses the LBL (Lawrence Berkeley Laboratory) simplified infiltration model to estimate air exchange rate by infiltration by combining weather data and the tightness of the building [28]. The conceptual framework of the LBL model is building leakage characterized by an Effective Leakage Area (ELA), prediction by a square-root law, and addition of wind and stack effects in quadrature [29]. The simplified model assumes that the building is a simple rectangular box. Details of the infiltration model are included in the supplementary material. 2.2.2 Model to estimate outdoor air supply with single-sided natural ventilation In classrooms or other building typologies where ventilation is achieved mostly by manual opening of windows, the amount of outdoor air entering the building varies considerably between summer and winter. In temperate to cold climate regions, occupants frequently open windows in summer, while in winter they may be reluctant to do so due to entrainment of cold outdoor air causing draught. Estimation of the distribution of ventilation during the year in such buildings is therefore important for the overall evaluation of the indoor air quality. Single-sided natural ventilation is less efficient than cross-flow ventilation, as the air simultaneously has to travel in and out of the same aperture. Single-sided situations may be more prevalent in practice, as they correspond to common space configurations as cellular offices or classrooms in which doors or internal partitions prevent air from moving from one side of the building to the other [30]. To estimate single-sided ventilation by window opening, a simple, empirical model that considers the contributions of wind and buoyancy effects together was suggested by De Gidds and Phaff [31]: (1) q v , single sided = A opening · v eq and (2) v eq = C 1 ∙ v wind 2 + C 2 ∙ H 0 ∙ Δ T + C 3 veq is the equivalent air velocity (m∙s−1) through the opening with an effective opening area Aopening (m2), H0 is the opening height (m) and C1, C2 and C3 are empirical constants derived by Phaff and De Gids in their measurements in 31 apartments (Table S4). 2.2.2.1 Model to estimate outdoor air supply with cross-flow ventilation Ventilation airflow rate with wind-driven cross-ventilation can be estimated with a simple orifice equation [32]. The orifice equation has the general form (3) q v = C D ∙ A ∙ Δ p ρ qv is ventilation airflow rate (m3∙s−1), A the effective opening area (m2), Δp the pressure difference between the inlet and outlet openings (Pa) and ρ the density of air (kg∙m−3). The user of the calculation framework may only have limited information about the building to be evaluated. Therefore, several simplifications and assumptions were made to enable estimation of the airflow rate with cross-flow ventilation. Window layout will differ between buildings, which means that the potential flow paths will differ. Windows may have different sizes, be positioned in different facades and in different heights. As a simplification, the estimation assumes that windows are of equal size and are installed in the same height in two parallel facades opposite each other. The ventilation airflow rate qv (m3∙s−1) is then calculated with the expression derived by Karava et al.[32]: (4) q v = 1 2 ∙ C D ∙ A ∙ U ref ∙ C Pw - C Pl CD is the discharge coefficient for the window openings (–), A the effective window opening area (m2), Uref the wind speed at building height (m∙s−1) and CPw and CPl pressure coefficients on the windward and leeward sides of the building (–), respectively. As a further simplification, the total effective window opening area (number of windows × window area × ratio of opening to total area of window) is assumed equally distributed on the four walls of the building. Thus, 50% of the total effective window area is used in the calculations distributed on 25% on each of two opposite facades. Since the orientation of the openable windows is unknown, it is assumed that wind direction always corresponds to an angle of 45 deg with a normal to the window. This assumption applies to the calculation of both single-sided and cross-flow natural ventilation. The supplementary material presents further details on the model used to estimate cross-flow ventilation. The combined airflow due to infiltration and window opening is determined by quadratic addition [33]. 2.2.3 Model to estimate indoor temperatures and heating and cooling needs Indoor temperatures and heating and cooling needs are calculated according to the hourly method specified in ISO 13790 [34]. The method makes a simplified estimation of air and operative temperatures, heating or cooling needs in one-hour time steps based on the following information: • Ventilation and transmission properties • Internal and external heat gains • Climate data for the location of the building • Description of building systems and their use • Set point temperatures for heating and cooling. The model is based on an equivalent resistance–capacitance model as a simplification of a dynamic simulation. It considers the building as a single zone, which is a reasonable assumption when the set-point temperatures for heating or cooling of the spaces in the building differ by no >4 °C; when the spaces are serviced by the same heating and/or cooling system; when the amount of ventilation in the spaces differ by no more than a factor of four within 80% of the floor area, or the doors between the spaces are likely to be frequently open [34]. Inputs to the calculation are building geometry, heat transfer properties of opaque and translucent surfaces, internal heat capacity, area related with the thermal mass of the building, infiltration and ventilation airflow rates and outdoor weather. The heating or cooling needs are estimated for each hour by first predicting the temperature in the building under free-floating building conditions (i.e. no heating or cooling supply). Then the temperature calculation is repeated with a fixed heating or cooling supply of 10 W/m2 floor area. Linear inter- or extrapolation is then used to estimate the heating or cooling power needed to reach the temperature set-point in the time step. Monthly or yearly energy needs are obtained by summation of the hourly values. The calculation of the solar heat gain assumes that the building facades are oriented towards the north, west, south and east. Within a time step, the sum of direct, diffuse and reflected area-normalized radiation on all four facades is calculated and multiplied with 25% of the total glazed window area. Thus, the solar load in the zone is a direction-independent average of the solar irradiation through the glazed window area equally distributed on all four orientations. The g-factor of the glazing is considered for the calculation of the solar heat transfer and a shading coefficient is considered if solar shading is defined and active in a given time step. At the current stage of development, shading is either 100% active at all times or entirely inactive. If the building has a central ventilation system, the energy needs for heating or cooling the supply air is included in the calculated energy need for general heating and cooling of the building [34]. If the ventilation system is equipped with a heat recovery unit, its efficiency and the supplied airflow rate are used to calculate the amount of energy that is recovered, which is subtracted from the total heating need. 2.2.4 Model to estimate temperature and humidity of supply air with a cooling coil in the ventilation system The indoor air humidity and air temperature in a building with a ventilation system equipped with heating and cooling coils depend on a combination of the supply air condition and the internal moisture and thermal loads. As air travels from outdoors to indoors, cooling in a cooling coil may cause both cooling and condensation and thus a decrease of the supply air temperature and humidity ratio. Heating the air in a heating coil will result in an increase of the supply air temperature, but will not affect the humidity ratio. When no dedicated system for humidification or dehumidification is installed, the humidity ratio of the indoor air is therefore only affected by the supply air during time steps with cooling. When cooling is available in the ventilation system, supply air temperature and humidity ratio are calculated according to a model suggested by Elmahdy et al. [35] (cited in Tashtoush et al. [36]). The details of the model are shown in the supplementary material. No option to reheat the supply air after the cooling coil has been implemented. 2.2.5 Occupant generation of heat, moisture and CO2 Indoors, humans are significant sources of heat, moisture and air pollution. The amount generated of these compounds depends on occupant surface area and activity level as well as on a number of secondary variables including diet [37,38]. Air pollution generated by occupants include a wide range of compounds, which are generally difficult to quantify. One exception is carbon dioxide, which is typically used as a proxy for air pollution generated by humans [39,40]. The carbon dioxide concentration in occupied spaces expresses a balance between the occupancy and the outdoor air supply. Dynamic CO2 concentration and air humidity are calculated based on mass balances between the generation of CO2 and moisture and the air supply and condition assuming full mixing of the air in the zone. The estimation of heat and moisture generated by occupants is based on reference values corresponding to sedentary activity of Mref = 1,2 met, a reference surface area of Adu,ref = 1,70 m2 and a reference moisture generation of GH2O,ref = 50 g∙h−1 [38]. For children at school age, weight and height are first estimated based on information of class and taking into account average growth curves. Body surface area is then estimated from weight and height and used as input to the estimation of the moisture generation. Values are averages of boys and girls, as within-gender variation is large and as there are only minor differences between genders in the considered age span from 6 to 15 years. Table S6 shows the applied relation between class, age, height, weight, and surface area determined for standard values for Danish school children [41]. Occupants are considered the only indoor source of moisture and other moisture generated by e.g. plants, or activities such as washing the floor or drying clothes is not considered. 2.2.6 Classification of the indoor environment Indoor environment standards suggest quality categories for ranges of temperature, CO2 concentration and ventilation rates for comfort in different building typologies (e.g. [27,42]). The percentage of time that the temperature or CO2 concentration belongs to a certain quality category is used to quantify the impacts of the indoor environment on pupil performance and pupil and teacher attendance. For classrooms in buildings without mechanical cooling, Table 1 shows quality categories for temperature and CO2 concentration. The quality categories address different levels of expectation from high to low [27]. Category I (high level of expectation) targets sensitive occupants such as children, the elderly, or persons with disabilities. Category II (medium level of expectation) targets levels normally used for design and operation of buildings. Category III (moderate level of expectation) provides an acceptable environment with some risk of reduced performance of the occupants. Category IV (low level of expectation) should only be used during short periods of the year or in spaces that are occupied only during shorter periods. Buildings with very poor conditions may even be outside the four categories 2.2.7 Association between the classroom CO2 concentration and schoolwork performance and absence from school Based on a meta-analysis of 16 studies of air quality and learning in schools, Wargocki et al. [43] suggested a relationship between the classroom CO2 concentration and the performance of schoolwork: (5) P = 1 . 5 · 1 0 - 7 · CO 2 2 - - 0 , 5 · 1 0 - 3 · CO 2 + 1 . 3 00 2 P is the performance of schoolwork as a fraction of the optimal performance; CO2 is the classroom CO2 concentration (ppm). The studies included in the analysis had few or no observations of CO2 concentrations below 900 ppm and it was therefore assumed that maximum performance will be reached at 900 ppm or below. Likewise, an upper cut-off is reached at 2000 ppm, at which no further performance decrement will appear at even higher CO2 concentrations. Based on analysis of three additional studies, Wargocki et al. [43] also suggested a relation between the classroom CO2 concentration and pupils' daily attendance: (6) A = - 6 · 1 0 - 13 · CO 2 3 + 4 · 1 0 - 0 9 · CO 2 2 - 1 0 - 0 5 · CO 2 + 1 . 0 1 0 4 A is pupils’ daily attendance as a fraction of full attendance (–); CO2 is the classroom CO2 concentration (ppm). These associations were used to quantify the loss of performance and reduced attendance as a consequence of insufficient classroom air quality (Table 2 ). It was decided to modify slightly the standard indoor environment quality categories to distinguish between categories III and IV, which are identical in standard [27]. Category III then spans the interval 1200 ppm to 1350 ppm and category IV the interval 1350 ppm to 1750 ppm. CO2-concentrations below 950 ppm were assumed to correspond with 100% performance and attendance (100% - absence) and for concentrations above 1750 ppm (outside category) to 87% performance and 98% attendance. 2.2.8 Association between the classroom CO2-concentration and teacher absence Only very few studies focused on quantifying the effect of the classroom environment and ventilation on teacher absence. Therefore, teacher absence was estimated from available data that originate in one comprehensive American study among office employees [44]. The study found that short-term illness absence attributable to ventilation was reduced by 35% when the ventilation rate was increased from 12 L∙s−1 per person to 24 L∙s−1 per person. However, even the minimum ventilation rate of 12 L∙s−1 per person as observed by Milton et al. [44] was higher than in most schools. As the influence of ventilation on illness absence presumably is higher at lower ventilation rates, the data from Milton et al.'s study was extrapolated to representative classroom conditions, even though extrapolation may add extra uncertainty. A conservative, exponential association between the ventilation rate and illness absence was assumed and estimated as shown in Fig. 2 . Table 3 estimates teacher illness absence in the applied quality categories for minimum recommended ventilation rates for classrooms in low-polluting buildings [27]. The numbers in the table indicate that teachers' illness absence agrees fairly well with that of pupils.Table 4 . 2.2.9 Association between classroom temperature and pupil performance A recent meta-analysis by Wargocki et al. [45] identified 18 studies that examined associations between temperature and pupil performance through school tasks and psychological tests [45]. Based on 10 of the studies, Wargocki et al. suggested a function describing the relationship between relative performance and temperature: (7) P = 0 . 2269 · t a 2 - 13 . 441 · t a + 277 . 84 P is the relative performance of schoolwork as a fraction of optimal performance (–); ta is the classroom air temperature (°C). According to Eq. (7), 100% performance is reached at an air temperature of 20 °C, which is below the temperature range of the highest quality category, even during the heating season (Table 1). In this case requirements to temperature for optimal thermal comfort and to highest pupil performance are in conflict. It was therefore decided to prioritize thermal comfort and estimate the temperature effect on performance with outset in the temperature quality categories for the heating season. The average of the heating season temperature intervals was then used to estimate a performance decrement for the different temperature quality categories. This was assumed the most feasible approach in a Scandinavian climate, but it could be adapted to other, warmer climates. 2.2.10 Scheme for evaluation of the socio-economic consequences of improved indoor environment in schools So far, the evaluation scheme for socio-economic benefits has been prepared only for schools. The main assumptions and elements of the scheme are summarized in this section. To estimate the socio-economic consequences of upgrading the indoor environment in a school, the relative performance and attendance are first weighted by the percentage of occupied hours when the temperature or CO2 concentration belong to a given quality category (output of the simulation models described in the previous sections). This calculation provides weighted average annual performance and attendance before and after building renovation. Both temperature and CO2 concentration affect performance, but the combined effect of these parameters is not known. As a conservative measure, the increase in learning due to better indoor environment was therefore estimated either for reduced CO2 concentration or for better temperature control, whichever resulted in the highest increase. This means that potential synergy between temperature and air quality is not accounted for. Input to the economical calculations comprises population average hourly salary and average hourly salary for teachers, number of work hours per day and number of work days per year. Also, assumptions must be made regarding the percentage of their work day that teachers spend in the upgraded classrooms, percentage of the teaching that takes place in classrooms with upgraded indoor environment and a percentage of the learning that takes place in other settings than at school, e.g. at home. Some studies indicate a relation between increased number of teaching hours and better marks [46–48]. Increasing the teaching hours by reducing absence may provide the highest benefit, although this result is not conclusive. As a simplification it is therefore assumed that the magnitude of the effect on pupil performance of improved indoor environment is equivalent to an increase of the number of teaching hours, i.e. that 5% higher learning performance is equivalent to 5% more teaching hours. Several studies indicate that choice of education depends on grades achieved in school [49–51]. However, the analyses carried out in these studies do not permit evaluating the extent by which increased learning and higher marks affect the choice of education and this effect is therefore not considered. More robust knowledge is available to assess how increased duration of education will affect income later in life. Several studies estimated the relation between duration of education and income, but the relations varied considerably between 0 and 16% [52–56]. The calculations used in this study assumes a conservative estimate of 2% increased income with a marginal additional year's schooling. Table S7 shows the parameters and default values used to calculate socioeconomy. 2.2.11 Calculation of Net Present value of better indoor environment in school Net Present Value (NPV) is determined for one pupil who spends nine years in school with improved indoor environment. The pupil is assumed to have 50 years on the labour market after a latency period of five years from when she or he leaves primary school until entry to the labour market. The intermediate time is considered spent on further education. NPV for a population of pupils in a school that receives an indoor environment upgrade comprises the effect during the typical life span of e.g. a ventilation system or other building upgrades (20 years by default). The NPV includes all pupils attending the school during the service life of the upgrade and their increased income during their time on the labour market. The oldest pupils will benefit from the upgrade between one to eight years. The benefit for them is therefore weighed 1/9 per year they spend at the school after the upgrade was carried through. Other input to the calculations comprise average growth in real wages and adjustment of gains according to the discount rate. Reduced illness absence among pupils will increase labour supply among parents due to fewer days at home to care for an ill child. It is assumed that only pupils from 0th to 6th grades need adult care when ill and that illness is evenly distributed among all grades. Thus, 66% of all absence is assumed to result in an adult being absent from the labour market. In addition, some parents are unemployed or not on the labour market for other reasons. For Denmark in 2017 and converted to equivalent full-time employment, this amounted to 48% of the population in the age range 24 to 49 years [41]. Also, some pupils are cared for by persons not affiliated with the labour market (e.g. retired grandparents), by parents working flexible hours or by parents who can work while caring for the ill child. No statistics are available that describe this and it is thus assumed that 10% of the pupil absence will not affect the labour market. Altogether, this input and these assumptions imply that by default 31% of the pupil absence days will result in an adult being unavailable to the labour market. Tax rates can be used to divide socio-economic benefits between state, municipality and citizen. All details of the socio-economic calculations are described in Madsen et al. [57]. 3 Example calculation for a Danish school The modelling framework is illustrated with an example based on simulations of indoor environment for one classroom in a school located in Denmark. Three cases are considered: A reference with only single-sided natural ventilation, a case with cross-flow natural ventilation, and a case with a mechanical ventilation system. The wider benefits of the latter two are compared with the reference case. The estimation of the wider benefits are made for the whole school hosting 500 pupils and 40 teachers. The area of one standard classroom is 56 m2, the room height is 2.6 m and the window area is 12% of the floor area corresponding to 6.72 m2 distributed equally on all facades (1.68 m2). Effective window area is assumed to be 50% of the total window area. Solar shading consists of interior blinds with a shading factor of 0.7. Table 5 shows other technical properties of the building envelope. Occupancy is schooldays (200 per year) from 8 hrs to 15 hrs. In January, February, November and December windows are assumed open 5 min per hour; in March, September and October 10 min per hour; in April 15 min per hour and in June and August 20 min per hour. Windows are closed during school holidays including winter (week 7), Easter (approximately week 12 depending on the year), summer (weeks 26 to 31), fall (week 42) and Christmas (week 51 to 52). In addition to the regular hourly opening, windows are assumed open during the morning break from 9:30 to 9:50 and during the lunch breaks from 11:30 to 12:00. During these breaks, occupancy is reduced to 50%. Other simulation details include an internal heat gain of 10 W∙m−2 floor area and a setpoint for heating of 20 °C. No schools in Denmark have mechanical cooling, which is therefore not considered in the example. The volume flowrate with mechanical ventilation corresponds to the minimum specified in the Danish building code equivalent to 5 L∙s−1 per person and an additional 0.3 L∙s−1 per m2 floor area [58]. The ventilation system has a heat recovery unit with a default temperature efficiency of 0.7. The system runs from 7 hrs to 15 hrs on school days. Table 6 shows the distribution of the occupied time during the school year when the CO2 concentration and temperature belong to different quality categories with the different ventilation modes. Changing the supply of ventilation air clearly improved the annual distributions of CO2 concentration and temperature. Table 7 shows the socio-economic gains achieved by improving the classroom environment. Changing ventilation mode from single-sided to cross-flow ventilation only had minor influence on the distribution of temperature and CO2 concentration and thus on the total NPV. This illustrates that with the simulated building geometry and occupant behaviour it is difficult to achieve sufficient outdoor air supply with natural ventilation when the occupant density is as high as in many classrooms. More significant improvement of the indoor environment followed from installation of a mechanical ventilation system, which in particular affected the NPV of reduced pupil illness absence and of higher learning outcome while in school. This change of outdoor air supply reduced both the number of occupied hours with high CO2 concentration and high temperature. 4 Discussion There is an urgent need to reduce greenhouse gas emissions caused by the building stock in both Europe and abroad [59]. Yet, the rate at which building energy efficiency is increased is far too slow to meet UN Sustainable Development Goals and the goals of the EU Green Deal [60,61]. It is not common practice to account for the socio-economic effects of indoor environment improvement when making feasibility assessment of building upgrades. A change of this practice may motivate decision makers to invest more in renovation efforts. After implementation, the framework suggested in this study may aid local administrations in the planning and prioritisation of renovation measures at building level. So far, the framework has been prepared only for schools, but ongoing work uses the same methodology to expand the scope of the framework to residential and commercial buildings. The modelling framework relies on many simplifications and assumptions. These were necessary to enable the implementation in a web based application in which the user may have only limited knowledge about the building. The limitations comprise both the models used to estimate outdoor air supply with infiltration and ventilation, temperature and heating/cooling demand and in particular the applied relations between classroom environment and pupil performance and pupil and teacher attendance. Sherman and Modera [62] examined the accuracy of the LBL infiltration model and found that for short-term measurements, the model predicted to within 20%, while the long-term (weeks) averages were more accurate at between 7% and 15% as compared with measured values, even though the model uses averages of the wind direction. Another critical property for estimation of air supply through infiltration is the assumed building leakage. Persily [63] estimated leakage of different building types and locations including schools in Canada and New York and industry buildings in Sweden. Means of the Normalized Leakage for selected building types and locations were 0.09 (9 Swedish industrial buildings) and 0.45 (11 Canadian schools) and 0.58 (22 New York schools) covering a range between very and medium airtight (Table S1). No data was available for Danish schools, which is why a leakage class had to be assumed in the calculation example. Few empirical models have been proposed to calculate the outdoor air supply of single-sided ventilation resulting from the combination of stack and wind effects [30]. The advantage of the applied model by De Gidds and Phaff [31] is that it predicts ventilation rate with very few inputs, which, however, may compromise its accuracy. A comparison with experimental results showed that the average deviation calculated as the mean of the flow through openings on the windward and leeward sides of a building was 32%. This was slightly higher than the best, but far below the worst performing, comparable models [64]. With cross-flow ventilation, Karava et al. [32] found that the orifice equation predicted the ventilation flowrate with reasonable accuracy for configurations with openings located in the middle or upper section of a building façade and wall porosity lower than 10%, while it underestimated the flow rate if any of the inlet or outlet openings covered >10% of the wall area. For configurations with openings below the mid-height of the building, the orifice model overestimated the ventilation flow rate, except for configurations with large inlets and outlets (20% wall porosity). The wall porosity is the ratio of the window-opening-to-facade-area. Airflow rates with both single-sided and cross-flow ventilation will depend on the distribution of wind pressures around the building, which again depends on the building geometry (ratio of length and height of the building and its façade porosity), wind speed and direction [65,66]. The simulation framework approximates the local wind speed at building height from climate data representative for the location, adjusted for the terrain class and the shielding class. The terrain class is affected by large-scale obstructions near the building while the shielding class is determined by obstructions located in its immediate vicinity [67]. The method used to estimate volume flowrate with cross-flow ventilation considers wind direction, but a simplified approach with a fixed flow angle was adopted here for simplicity. This may overestimate the flowrate in some wind directions and underestimate it in other. To quantify the effect of wind direction on ventilation, a building model comparable with the example school building located in Copenhagen was set up in an advanced, dynamic building simulation program [68]. Cross-flow ventilation with openable windows in either north–south or east–west axes were simulated. For both axis directions, the average air change rate was around 0.6 h−1, while the maximum was 0.8 h−1 in north–south and 0.7 h−1 in east–west. Thus, the influence of wind direction (or building orientation) on average and maximum outdoor air supply was rather modest. The annual heating energy demand calculated with the hourly method described in ISO 13790 [34] differed between 16% and 26% from the IDA ICE simulation. This is in agreement with Kokogiannakis et al. [69] and Cirrincione et al. [70] who also found fairly good agreement between the heating energy demand estimated with the hourly method in ISO 13790 and the output of validated, more advanced simulation programs. On the other hand, the two studies found that the calculation of cooling energy demand was less accurate. Cooling is available in the proposed framework, but was not considered relevant for the example with schools in Scandinavia. The estimation of temperature and CO2 concentration are classified according to standards' quality categories to estimate the socio-economic benefits of upgrading the indoor environment. This allows for some uncertainty in the predicted variables without affecting severely the socio-economic calculation and extreme values outside of category will not skew the socio-economic outcome. The estimation considers only a few of the entire suite of parameters that characterize the indoor environment. We hope that generation of new knowledge over time will allow the inclusion of visual and acoustical parameters in the framework. In temperate and cold climate zones, open windows during the heating season may cause discomfort due to draft or uncomfortably low temperatures, in particular for pupils seated near windows. This is a major reason for insufficient ventilation in classrooms during the heating season. Currently, estimation of indoor air speeds and air temperatures can be made only with advanced Computational Fluid Dynamics simulations, which are beyond the scope of the simplified simulations used in the suggested framework. Assessment of thermal comfort is therefore somewhat crude and based on an operative temperature for the classroom, calculated by weighing the air and average surface temperatures by 50% each. The correctness of the applied exposure–response relations between indoor environment and performance and attendance is far more difficult to quantify. For temperature and air quality effects on pupil performance of schoolwork and attendance we used recent meta-studies, which are probably the best available aggregated knowledge [43,45]. Only one study was used to estimate effects on teacher absence of the outdoor air supply, which suggests that this is the weakest element of the framework. Yet, a conservative approach was used to estimate the effect of ventilation rate on teacher absence, which constitutes only a very minor percentage of the calculated socio-economic benefits. Using distributions of temperature and CO2 concentration during the year rather than assuming values that were fixed before and after refurbishment may have caused more conservative estimates of the achievable economic benefits than predicted in earlier studies. For the school example with 500 pupils, the benefits of upgrading classroom ventilation was estimated at 2.4 million €. A large Danish field study recently estimated that around 30% of Danish classrooms only offered natural ventilation by manual opening of windows [1]. With a total of 527.000 pupils in Danish schools, this corresponds to 158.100 pupils. A very simplified estimation of the wider benefits of upgrading ventilation in these schools will then amount to a NPV of 759 million € accumulated over a 20 year period. The considered economical benefits included better qualified pupils that would be more productive in their working life and reduced absence among teachers. It excluded benefits accrued from improved health later in life that will result in reduced societal costs. This is a consequence of the idea to refine the socio-economic estimations to school level as compared with previous approaches that focused on assessing socio-economic benefits of indoor environment at societal level. The suggested framework accounts for the fraction of the school hours that are spent in refurbished classrooms, that not all teaching takes place in school and therefore is not affected by the classroom conditions, and it estimates derived effects of pupil absence for those pupils who need adult care when absent from school. As such, calculations are made at a much higher level of detail than in earlier studies. Also, the framework considers associations between elementary school teaching and continued education established for Denmark. However, all country specific input can be adapted to national or regional levels. 5 Conclusions Incentives to upgrade buildings generally rely on the ratio between the costs and the benefits of the actions. Benefits can be evaluated with rather high certainty when the investment is only weighted against the profitability of higher energy efficiency. It is far more complex to estimate the value of improved indoor environment that follows from upgrading building envelopes, ventilation, or other building features that affect the indoor environment. The developed model framework, with all its simplifications and assumptions, prioritises functionality rather than high accuracy, but may provide useful support to decisions on building refurbishment. The simplified model framework combines established models for infiltration and different modes of ventilation to estimate yearly distributions of the classroom temperature and CO2 concentration, which are used as input to prediction of pupil performance of schoolwork, attendance at school and teacher absence before and after refurbishment of their school building. The framework enables estimation of the wider benefits of improved classroom environment at school rather than on societal level and it can be used to evaluate a range of different refurbishment scenarios and support decisions on building upgrades. Declaration of Competing Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgements This paper is based on research undertaken in the EU-funded EERAdata project which has received funding from the European Union’s Horizon 2020 research and innovation programme under grant agreement No. 847101. Financial support for the development of the socio-economic calculation framework from Realdania is gratefully acknowledged. Appendix A Supplementary data Supplementary data to this article can be found online at https://doi.org/10.1016/j.enbuild.2021.111274. Appendix A Supplementary data The following are the Supplementary data to this article: Supplementary Data 1 References [1] G.H. Clausen, J. Toftum, G. Bekö. Large-scale CO2 measurement campaigns in Danish schools. Proc. Of Indoor Air 2016, 3-8 July 2016, Gent, Belgium, paper no. 532. [2] S. Haddad Thermal comfort in naturally ventilated schools: a field study of thermal comfort in Iranian primary school classrooms 2016 The University of New South Wales Ph.D.-thesis Faculty of Built Environment Haddad, S. (2016). Thermal comfort in naturally ventilated schools: a field study of thermal comfort in Iranian primary school classrooms. Ph.D.-thesis Faculty of Built Environment, The University of New South Wales. [3] Valeria De Giuli Osvaldo Da Pos Michele De Carli Indoor environmental quality and pupil perception in Italian primary schools Build. Environ. 56 2012 335 345 De Giuli, V., Da Pos, O., & De Carli, M. (2012). Indoor environmental quality and pupil perception in Italian primary schools. Building and Environment, 56, 335-345. [4] Mari Turunen Oluyemi Toyinbo Tuula Putus Aino Nevalainen Richard Shaughnessy Ulla Haverinen-Shaughnessy Indoor environmental quality in school buildings, and the health and wellbeing of students Int. J. Hyg. Environ. Health 217 7 2014 733 739 Turunen, M., Toyinbo, O., Putus, T., Nevalainen, A., Shaughnessy, R., & Haverinen-Shaughnessy, U. (2014). Indoor environmental quality in school buildings, and the health and wellbeing of students. International journal of hygiene and environmental health, 217(7), 733-739. [5] Runa Tabea Hellwig Florian Antretter Andreas Holm Klaus Sedlbauer Untersuchungen zum Raumklima und zur Fensterlüftung in Schulen Bauphysik 31 2 2009 89 98 10.1002/bapi.v31:210.1002/bapi.200910013 Hellwig, R. T., Antretter, F., Holm, A., & Sedlbauer, K. (2009). Untersuchungen zum Raumklima und zur Fensterlüftung in Schulen. Bauphysik, 31(2), 89–98. https://doi.org/10.1002/bapi.200910013 [6] C. Godwin S. Batterman (2007) Indoor air quality in Michigan schools Indoor Air 17 2 2007 109 121 Godwin, C., Batterman, S. (2007) Indoor air quality in Michigan schools. Indoor Air 2007, 17, 109–121. [7] A. Montazami Aircraft Noise, Overheating and Poor Air Quality in London Primary Schools' Classrooms Doctoral dissertation 2012 London Metropolitan University Montazami, A. (2012). Aircraft noise, overheating and poor air quality in London primary schools' classrooms (Doctoral dissertation, London Metropolitan University). [8] Z. Bakó-Biró D.J. Clements-Croome N. Kochhar H.B. Awbi M.J. Williams Ventilation rates in schools and pupils’ performance Build. Environ. 48 2012 215 223 Bakó-Biró Z., Clements-Croome., D.J., Kochhar, N., Awbi, H.B., Williams, M.J. (2012) Ventilation rates in schools and pupils’ performance. Build. Environ. 48, 215–223. [9] Jørn Toftum Birthe U. Kjeldsen Pawel Wargocki Henriette R. Menå Eva M.N. Hansen Geo Clausen Association between classroom ventilation mode and learning outcome in Danish schools Build. Environ. 92 2015 494 503 Toftum, J., Kjeldsen, B. U., Wargocki, P., Menå, H. R., Hansen, E. M., & Clausen, G. (2015). Association between classroom ventilation mode and learning outcome in Danish schools. Building and Environment, 92, 494-503. [10] D. Wyon P. Wargocki J. Toftum G. Clausen Classroom ventilation must be improved for better health and learning REHVA. Eur. HVAC. J 3 2010 12 16 Wyon, D., Wargocki, P., Toftum, J., & Clausen, G. (2010). Classroom ventilation must be improved for better health and learning. REHVA. Eur. HVAC. J, 3, 12-16. [11] U. Haverinen-Shaughnessy D.J. Moschandreas R.J. Shaughnessy Association between substandard classroom ventilation rates and students’ academic achievement Indoor Air 21 2 2011 121 131 10.1111/j.1600-0668.2010.00686.x Haverinen-Shaughnessy, U., Moschandreas, D. J., & Shaughnessy, R. J. (2011). Association between substandard classroom ventilation rates and students’ academic achievement. Indoor Air, 21(2), 121–131. https://doi.org/10.1111/j.1600-0668.2010.00686.x [12] Santosh Gaihre Sean Semple Janice Miller Shona Fielding Steve Turner Classroom carbon dioxide concentration, school attendance, and educational attainment J. Sch. Health 84 9 2014 569 574 Gaihre, S., Semple, S., Miller, J., Fielding, S., & Turner, S. (2014). Classroom carbon dioxide concentration, school attendance, and educational attainment. Journal of school health, 84(9), 569-574. [13] M.J. Mendell E.A. Eliseeva M.M. Davies M. Spears A. Lobscheid W.J. Fisk M.G. Apte Association of classroom ventilation with reduced illness absence: a prospective study in California elementary schools Indoor Air 23 6 2013 515 528 10.1111/ina.12042 Mendell, M.J., Eliseeva, E.A., Davies, M.M., Spears, M., Lobscheid, A., Fisk, W.J., Apte, M.G. (2013) Association of Classroom Ventilation with Reduced Illness Absence: A Prospective Study in California Elementary Schools. Indoor Air, 23(6), 515-528 (doi:10.1111/ina.12042). [14] Elinor Simons Syni-An Hwang Edward F. Fitzgerald Christine Kielb Shao Lin The impact of school building conditions on student absenteeism in upstate New York Am. J. Public Health 100 9 2010 1679 1686 Simons, E., Hwang, S. A., Fitzgerald, E. F., Kielb, C., & Lin, S. (2010). The impact of school building conditions on student absenteeism in upstate New York. American journal of public health, 100(9), 1679-1686. [15] D.G. Shendell R. Prill W.J. Fisk M.G. Apte D. Blake D. Faulkner Associations between classroom CO2 concentrations and student attendance in Washington and Idaho Indoor Air 14 5 2004 333 341 Shendell, D. G., Prill, R., Fisk, W. J., Apte, M. G., Blake, D., Faulkner, D. (2004). Associations between classroom CO2 concentrations and student attendance in Washington and Idaho. Indoor air, 14(5), 333-341. [16] Jie Gao Pawel Wargocki Yi Wang Ventilation system type, classroom environmental quality and pupils' perceptions and symptoms Build. Environ. 75 2014 46 57 Gao, J., Wargocki, P., & Wang, Y. (2014). Ventilation system type, classroom environmental quality and pupils' perceptions and symptoms. Building and Environment, 75, 46-57. [17] M. Simoni I. Annesi-Maesano T. Sigsgaard D. Norback G. Wieslander W. Nystad School air quality related to dry cough, rhinitis and nasal patency in children Eur. Respir. J. 35 4 2010 742 749 Simoni, M., Annesi-Maesano, I., Sigsgaard, T., Norback, D., Wieslander, G., Nystad, W., ... & Viegi, G. (2010). School air quality related to dry cough, rhinitis and nasal patency in children. European Respiratory Journal, 35(4), 742-749. [18] Becca Castleberry Travis Gliedt J. Scott Greene Assessing drivers and barriers of energy-saving measures in Oklahoma’s public schools Energy Policy 88 2016 216 228 Castleberry, B., Gliedt, T., & Greene, J. S. (2016). Assessing drivers and barriers of energy-saving measures in Oklahoma’s public schools. Energy Policy, 88, 216-228. [19] UVM (2020). Danish Ministry of Children and Education. www.uvm.dk (Accessed 15 March 2021). [20] DACE (2016 and 2020). The Danish Association of Consulting Engineers – State of the nation 2016 and 2020. (https://www.frinet.dk/om-den-raadgivende-ingenioerbranche/state-of-the-nation-2020/ accessed 15 March 2021). [21] Luísa Dias Pereira Daniela Raimondo Stefano Paolo Corgnati Manuel Gameiro da Silva Energy consumption in schools–a review paper Renew. Sustain. Energy Rev. 40 2014 911 922 Pereira, L. D., Raimondo, D., Corgnati, S. P., & Da Silva, M. G. (2014). Energy consumption in schools–A review paper. Renewable and Sustainable Energy Reviews, 40, 911-922. [22] Stefano Paolo Corgnati Vincenzo Corrado Marco Filippi A method for heating consumption assessment in existing buildings: a field survey concerning 120 Italian schools Energy Build. 40 5 2008 801 809 Corgnati, S. P., Corrado, V., & Filippi, M. (2008). A method for heating consumption assessment in existing buildings: A field survey concerning 120 Italian schools. Energy and buildings, 40(5), 801-809. [23] William J. Fisk Arthur H. Rosenfeld Estimates of improved productivity and health from better indoor environments Indoor Air 7 3 1997 158 172 Fisk, W. J., & Rosenfeld, A. H. (1997). Estimates of improved productivity and health from better indoor environments. Indoor air, 7(3), 158-172. [24] W.J. Fisk Health and productivity gains from better indoor environments and their relationship with building energy efficiency Annu. Rev. Energy Env. 25 1 2000 537 566 Fisk, W. J. (2000). Health and productivity gains from better indoor environments and their relationship with building energy efficiency. Annual review of energy and the environment, 25(1), 537-566. [25] Slotsholm A/S (2012). Samfundsøkonomiske konsekvenser af bedre luftkvalitet i grundskolen (Socioeconomic benefits of better air quality in elementary school). www.slotsholm.dk (in Danish). [26] Innobyg (2017). Totalværdi og indeklima (Total value of the indoor environment). Project report by Innobyg, Technical University of Denmark, Danish Technological Insitute. https://www.innobyg.dk/media/75148/totalvaerdi_indeklima_projektrapport_mindre.pdf (Accessed 08 April 2021). [27] DS/EN 16798-1 (2019). Energy performance of buildings – Ventilation for buildings – Part 1: Indoor environmental input parameters for design and assessment of energy performance of buildings addressing indoor air quality, thermal environment, lighting and acoustics – Module M1-6. Danish Standards. [28] M.H. Sherman, D.T. Grimsrud. The Measurement of Infiltration using Fan Pressurization and Weather Data. Proc. First International Air Infiltration Centre Conference, London, England. Lawrence Berkeley Laboratory Report, LBL-10852 (1980). [29] M. Sherman The use of blower-door data Indoor Air 5 3 1995 215 224 Sherman, M. (1995). The Use of Blower‐Door Data. Indoor Air, 5(3), 215-224. [30] Marcello Caciolo Pascal Stabat Dominique Marchio Full scale experimental study of single-sided ventilation: analysis of stack and wind effects Energy Build. 43 7 2011 1765 1773 Caciolo, M., Stabat, P., & Marchio, D. (2011). Full scale experimental study of single-sided ventilation: analysis of stack and wind effects. Energy and Buildings, 43(7), 1765-1773. [31] W. De Gids H. Phaff Ventilation rates and energy consumption due to open windows: a brief overview of research in the Netherlands Air Infiltration Rev. 4 1 1982 4 5 De Gids, W., & Phaff, H. (1982). Ventilation rates and energy consumption due to open windows: a brief overview of research in the Netherlands. Air infiltration review, 4(1), 4-5. [32] P. Karava T. Stathopoulos A.K. Athienitis Airflow assessment in cross-ventilated buildings with operable façade elements Build. Environ. 46 1 2011 266 279 Karava, P., Stathopoulos, T., & Athienitis, A. K. (2011). Airflow assessment in cross-ventilated buildings with operable façade elements. Building and environment, 46(1), 266-279. [33] H.B. Awbi Ventilation of Buildings 2003 Taylor & Francis Awbi, H. B. (2003). Ventilation of buildings. Taylor & Francis. [34] ISO 13790 (2008). Energy performance of buildings – Calculation of energy use for space heating and cooling. International Organisation for Standardisation, Geneva. [35] A.H. Elmahdy G.P. Mitalas Simple model for cooling and dehumidifying coils for use in calculating energy requirements for buildings ASHRAE Trans. 83 2 1977 103 117 Elmahdy, A.H., Mitalas, G.P. (1977). Simple model for cooling and dehumidifying coils for use in calculating energy requirements for buildings. ASHRAE Trans. 83(2), 103–117. [36] Bourhan Tashtoush M. Molhim M. Al-Rousan Dynamic model of an HVAC system for control analysis Energy 30 10 2005 1729 1745 Tashtoush, B., Molhim, M., & Al-Rousan, M. (2005). Dynamic model of an HVAC system for control analysis. Energy, 30(10), 1729-1745. [37] ISO 8996 (2004). Ergonomics of the thermal environment – Determination of metabolic heat production. International Organisation for Standardisation, Geneva. [38] ASTM D6245-98 (2002). Standard Guide for using indoor carbon dioxide concentrations to evaluate indoor air quality and ventilation. ASTM International, West Conshohocken, PA, www.astm.org. [39] Usha Satish Mark J. Mendell Krishnamurthy Shekhar Toshifumi Hotchi Douglas Sullivan Siegfried Streufert William J. Fisk Is CO2 an indoor pollutant? Direct effects of low-to-moderate CO2 concentrations on human decision-making performance Environ. Health Perspect. 120 12 2012 1671 1677 Satish, U., Mendell, M. J., Shekhar, K., Hotchi, T., Sullivan, D., Streufert, S., & Fisk, W. J. (2012). Is CO2 an indoor pollutant? Direct effects of low-to-moderate CO2 concentrations on human decision-making performance. Environmental health perspectives, 120(12), 1671-1677. [40] Lars Gunnarsen P. Ole Fanger Adaptation to indoor air pollution Environ. Int. 18 1 1992 43 54 Gunnarsen, L., & Fanger, P. O. (1992). Adaptation to indoor air pollution. Environment International, 18(1), 43-54. [41] Statistics Denmark (2020). Statistikbanken. www.statistikbanken.dk (accessed 16 March 2021). [42] ISO 17772-2 (2018). Energy performance of buildings – Overall assessment procedures- Part 2: Guideline for using indoor environmental input parameters for the design and energy performance of buildings. International Organisation for Standardisation, Geneva. [43] Pawel Wargocki Jose Ali Porras-Salazar Sergio Contreras-Espinoza William Bahnfleth The relationships between classroom air quality and children’s performance in school Build. Environ. 173 2020 106749 10.1016/j.buildenv.2020.106749 Wargocki, P., Porras-Salazar, J. A., Contreras-Espinoza, S., & Bahnfleth, W. (2020). The relationships between classroom air quality and children’s performance in school. Building and Environment, 173, 106749. [44] D.K. Milton P.M. Glencross M.D. Walters Risk of sick leave associated with outdoor ventilation level, humidification, and building related complaints Indoor Air 10 4 2000 212 221 Milton, D. K., Glencross, P. M., & Walters, M. D. (2000). Risk of sick leave associated with outdoor ventilation level, humidification, and building related complaints. Indoor Air, 10(4), 212-221. [45] Pawel Wargocki Jose Ali Porras-Salazar Sergio Contreras-Espinoza The relationship between classroom temperature and children’s performance in school Build. Environ. 157 2019 197 204 Wargocki, P., Porras-Salazar, J. A., & Contreras-Espinoza, S. (2019). The relationship between classroom temperature and children’s performance in school.Building and Environment,157, 197-204. [46] P. Bingley, E. Heinesen, K.F. Krassel, & N. Kristensen. The timing of instruction time: accumulated hours, timing and pupil achievement. Study paper 131. Rockwool Foundation (2018). https://www.rockwoolfonden.dk/app/uploads/2018/09/Study-Paper-131_The-Timing-of-Instruction-Time.pdf (accessed 16 March 2021). [47] Mathias Huebener Susanne Kuger Jan Marcus Increased instruction hours and the widening gap in student performance Labour Econ. 47 2017 15 34 Huebener, M., Kuger, S., & Marcus, J. (2017). Increased instruction hours and the widening gap in student performance. Labour Economics, 47, 15-34. [48] Esteban M. Aucejo Teresa Foy Romano Assessing the effect of school days and absences on test score performance Econ. Educ. Rev. 55 2016 70 87 Aucejo, E. M., & Romano, T. F. (2016). Assessing the effect of school days and absences on test score performance. Economics of Education Review, 55, 70-87. [49] DEA (2015). Kun de bedste fra grundskolen starter på videregående uddannelse (Only the best from elementary school continue to further education). Think tank DEA. https://dea.nu/i-farver/publikationer/kun-de-bedste-fra-grundskolen-starter-pa-videregaende-uddannelse/ (accessed 16 March 2021). [50] DEA (2016). Hvad betyder grundskolekarakterer for vejen gennem uddannelsessystemet (Influence of elementary school grades for educational attainment). Think tank DEA. https://dea.nu/sort-paa-hvidt/publikationer/hvad-betyder-grundskolekarakterer-for-vejen-gennem-uddannelsessystemet/ (accessed 16 March 2021). [51] Hvidtfeldt, C., Tranæs, T. (2013). Folkeskolekarakterer og succes på erhvervsuddannelserne (elementary school grades and succes at vocational education). Arbejdspapir 29, Rockwool Fonden. https://www.rockwoolfonden.dk/app/uploads/2015/12/Arbpapir_29_Final.pdf (Accessed 16 March 2021). [52] Manudeep Bhuller Magne Mogstad Kjell G. Salvanes Life-cycle earnings, education premiums, and internal rates of return J. Labor Econ. 35 4 2017 993 1030 Bhuller, M., Mogstad, M., & Salvanes, K. G. (2017). Life-cycle earnings, education premiums, and internal rates of return. Journal of Labor Economics, 35(4), 993-1030. [53] J.D. Angrist A.B. Keueger Does compulsory school attendance affect schooling and earnings? Q. J. Econ. 106 4 1991 979 1014 Angrist, J. D., & Keueger, A. B. (1991). Does compulsory school attendance affect schooling and earnings? The Quarterly Journal of Economics, 106(4), 979-1014. [54] J. Grenet Is extending compulsory schooling alone enough to raise earnings? Evidence from French and British compulsory schooling laws Scand. J. Econ. 115 1 2013 176 210 Grenet, J. (2013). Is extending compulsory schooling alone enough to raise earnings? Evidence from French and British compulsory schooling laws. The Scandinavian Journal of Economics, 115(1), 176-210. [55] J.S. Pischke The impact of length of the school year on student performance and earnings: evidence from the German short school years Econ. J. 117 523 2007 1216 1242 Pischke, J. S. (2007). The impact of length of the school year on student performance and earnings: Evidence from the German short school years. The Economic Journal, 117(523), 1216-1242. [56] O. Ashenfelter A. Krueger Estimates of the economic return to schooling from a new sample of twins Am. Econ. Rev. 1994 1157 1173 Ashenfelter, O., & Krueger, A. (1994). Estimates of the economic return to schooling from a new sample of twins. The American economic review, 1157-1173. [57] M. Madsen, D.S. Hauberg, K. Kolstrup, J. Toftum. Samfundsøkonomiske gevinster ved forbedret indeklima (Socioeconomic benefits of better indoor environment). Report to Realdania (2019). https://realdania.dk/publikationer/faglige-publikationer/samfundsoekonomiske-gevinster-ved-forbedret-indeklima (Accessed 16 March 2021). [58] Danish Building Code (2018). Bygningsreglementet, BR 2018. https://bygningsreglementet.dk/ (Accessed 16 March 2021). [59] EU (2018). Energy efficiency directive. https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32018L2002&from=EN (Accessed 08 April 2021). [60] UN (2016). United Nations Sustainable Development Goals. https://sdgs.un.org/goals (Accessed 08 April 2021). [61] EU (2019). A European Green Deal: Actions being taken by the EU. https://ec.europa.eu/info/strategy/priorities-2019-2024/european-green-deal/actions-being-taken-eu_en (Accessed 08 April 2021): [62] M.H. Sherman M.P. Modera Comparison of measured and predicted infiltration using the LBL infiltration model Measured Air Leakage of Buildings 1986 ASTM International Sherman, M. H., & Modera, M. P. (1986). Comparison of measured and predicted infiltration using the LBL infiltration model. In Measured air leakage of buildings. ASTM International. [63] A.K. Persily. Airtightness of commercial and institutional buildings: blowing holes in the myth of tight buildings. Gaithersburg: Building and Fire Research Laboratory, National Institute of Standards and Technology. Ashrae Spec, pp. 829-837 (1998). [64] Z.T. Ai C.M. Mak Determination of single-sided ventilation rates in multistory buildings: evaluation of methods Energy Build. 69 2014 292 300 Ai, Z. T., & Mak, C. M. (2014). Determination of single-sided ventilation rates in multistory buildings: evaluation of methods. Energy and buildings, 69, 292-300. [65] Y. Choinière H. Tanaka J.A. Munroe A. Suchorski-Tremblay Prediction of wind-induced ventilation for livestock housing J. Wind Eng. Ind. Aerodyn. 44 1-3 1992 2563 2574 Choiniere, Y., Tanaka, H., Munroe, J. A., & Suchorski-Tremblay, A. (1992). Prediction of wind-induced ventilation for livestock housing. Journal of Wind Engineering and Industrial Aerodynamics, 44(1-3), 2563-2574. [66] Mats Sandberg An alternative view on the theory of cross-ventilation Int. J. Vent. 2 4 2004 409 418 Sandberg, M. (2004). An alternative view on the theory of cross-ventilation. International journal of ventilation, 2(4), 409-418. [67] D. Grimsrud, M. Sherman, R. Sonderegger. Calculating infiltration: Implications for a construction quality standard. ASHRAE/DOE Conference on Thermal Performance of the Exterior Envelope of Buildings II, Las Vegas, LBL-9416 (1983). [68] IDA ICE (2021). IDA Indoor Climate and Energy version 4.8. EQUA Simulation AB, Stockholm, Sweden. [69] Georgios Kokogiannakis Paul Strachan Joe Clarke Comparison of the simplified methods of the ISO 13790 standard and detailed modelling programs in a regulatory context J. Build. Perform. Simul. 1 4 2008 209 219 Kokogiannakis, G., Strachan, P., & Clarke, J. (2008). Comparison of the simplified methods of the ISO 13790 standard and detailed modelling programs in a regulatory context. Journal of Building Performance Simulation, 1(4), 209-219. [70] L. Cirrincione, A. Marvuglia, G. Peri, G. Rizzo, G. Scaccianoce, The European standards for energy efficiency in buildings: An analysis of the evolution with reference to a case study. in: AIP Conference Proceedings (Vol. 2191, No. 1, p. 020049). AIP Publishing LLC, 2019.",
    "scopus-id": "85110488684",
    "coredata": {
        "eid": "1-s2.0-S0378778821005582",
        "dc:description": "A simplified modelling framework for the prediction of the indoor environment, energy use and socio-economic consequences of improving air quality and temperature in school buildings is suggested. The framework combines established models for infiltration and different modes of ventilation to estimate yearly distributions of the classroom temperature and CO2 concentration. These distributions are used as input to a prediction of pupil performance of schoolwork, their attendance at school, and teacher absence before and after refurbishment of their school building. Eventually, the framework estimates the socio-economic consequences of an improved classroom environment for a school and may be used to evaluate the feasibility of a range of different refurbishment scenarios and support decisions on building upgrades.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2021-11-01",
        "openaccessUserLicense": "http://creativecommons.org/licenses/by/4.0/",
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S0378778821005582",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Toftum, Jørn"
            },
            {
                "@_fa": "true",
                "$": "Andersen, Rune"
            },
            {
                "@_fa": "true",
                "$": "Aguilera Prado, Jose Joaquin"
            },
            {
                "@_fa": "true",
                "$": "Kolstrup, Kristian"
            },
            {
                "@_fa": "true",
                "$": "Sloth Hauberg, Daniel"
            },
            {
                "@_fa": "true",
                "$": "Clausen, Geo"
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S0378778821005582"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S0378778821005582"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": "Full",
        "pii": "S0378-7788(21)00558-2",
        "prism:volume": "250",
        "articleNumber": "111274",
        "prism:publisher": "The Author(s). Published by Elsevier B.V.",
        "dc:title": "Development of a tool to predict the socio-economic consequences of better air quality and temperature control in classrooms",
        "prism:copyright": "© 2021 The Author(s). Published by Elsevier B.V.",
        "openaccess": "1",
        "prism:issn": "03787788",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Learning"
            },
            {
                "@_fa": "true",
                "$": "Indoor environment"
            },
            {
                "@_fa": "true",
                "$": "Simulations"
            },
            {
                "@_fa": "true",
                "$": "Wider benefits"
            },
            {
                "@_fa": "true",
                "$": "School"
            },
            {
                "@_fa": "true",
                "$": "Performance"
            },
            {
                "@_fa": "true",
                "$": "Ventilation"
            }
        ],
        "openaccessArticle": "true",
        "prism:publicationName": "Energy and Buildings",
        "openaccessSponsorType": "FundingBody",
        "prism:pageRange": "111274",
        "pubType": "fla",
        "prism:coverDisplayDate": "1 November 2021",
        "prism:doi": "10.1016/j.enbuild.2021.111274",
        "prism:startingPage": "111274",
        "dc:identifier": "doi:10.1016/j.enbuild.2021.111274",
        "openaccessSponsorName": "Denmark institutions 2021"
    },
    "objects": {"object": [
        {
            "@category": "standard",
            "@height": "760",
            "@width": "667",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-gr1.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "85598",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "385",
            "@width": "578",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-gr2.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "26078",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "144",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-gr1.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "6782",
            "@ref": "gr1",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "146",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-gr2.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "3727",
            "@ref": "gr2",
            "@mimetype": "image/gif"
        },
        {
            "@category": "high",
            "@height": "3366",
            "@width": "2953",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-gr1_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "512368",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1703",
            "@width": "2559",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-gr2_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "142739",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-mmc1.docx?httpAccept=%2A%2F%2A",
            "@multimediatype": "Microsoft Word file",
            "@type": "APPLICATION",
            "@size": "21585",
            "@ref": "mmc1",
            "@mimetype": "application/word"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si1.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "16270",
            "@ref": "si1",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si2.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "23813",
            "@ref": "si2",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si3.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "11660",
            "@ref": "si3",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si4.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "20786",
            "@ref": "si4",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si5.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "16220",
            "@ref": "si5",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si6.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "18114",
            "@ref": "si6",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "thumbnail",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-si7.svg?httpAccept=%2A%2F%2A",
            "@multimediatype": "Scalable Vector Graphics file",
            "@type": "ALTIMG",
            "@size": "17095",
            "@ref": "si7",
            "@mimetype": "image/svg+xml"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0378778821005582-am.pdf?httpAccept=%2A%2F%2A",
            "@multimediatype": "Acrobat PDF file",
            "@type": "AAM-PDF",
            "@size": "447500",
            "@ref": "am",
            "@mimetype": "application/pdf"
        }
    ]},
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/85110488684"
    }
}}