{"full-text-retrieval-response": {
    "scopus-eid": "2-s2.0-85076994963",
    "originalText": "serial JL 271434 291210 291731 291800 291881 31 Building and Environment BUILDINGENVIRONMENT 2019-11-18 2019-11-18 2019-12-28 2019-12-28 2020-03-13T06:57:28 1-s2.0-S0360132319307309 S0360-1323(19)30730-9 S0360132319307309 10.1016/j.buildenv.2019.106518 S300 S300.1 FULL-TEXT 1-s2.0-S0360132319X00219 2021-03-08T15:13:42.756575Z 0 0 20200301 20200331 2020 2019-11-18T16:09:25.504017Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor grantsponsorid highlightsabst primabst ref 0360-1323 03601323 true 170 170 C Volume 170 24 106518 106518 106518 202003 March 2020 2020-03-01 2020-03-31 2020 VSI: Sust Healthy Bldgs&Comm article fla © 2019 Elsevier Ltd. All rights reserved. MODELINGDATAINFRASTRUCTUREFORHUMANCENTRICDESIGNOPERATIONSUSTAINABLEHEALTHYBUILDINGSTHROUGHACASESTUDY TAO Y 1 Introduction 1.1 Vision and objective 1.2 Wellbeing and sustainable design 2 Literature review 2.1 Human behavior in buildings 2.2 Occupant characteristics (time based) 2.3 Data and model types 2.3.1 Physics-based and statistic models 2.3.2 Qualitative and quantitative models 2.3.3 Data integration and sharing 2.4 Quantification of health and wellness 2.4.1 WELL standard 2.4.2 Living Building Challenge (LBC) 2.4.3 Lighting 2.5 Integrating wellbeing with the built environment 3 A conceptual framework 4 A case study - method of data collection 4.1 Case description: a birth and wellness clinic in the midwest 4.2 Feedback from health providers and patients 4.2.1 Meaning of wellness 4.2.2 Space/place (LBC) 4.2.3 Community 4.3 Results based on important data types provided by three standards 4.3.1 Light (daylight and well-placed indirect electrical light) 4.3.2 Views 4.3.3 Other wellbeing factors 4.3.3.1 Materials (Across all three rating systems) 4.3.3.2 Cleaning supplies 4.3.3.3 Health and happiness (LBC) 4.3.3.4 Nourishment 4.3.3.5 Thermal comfort 4.3.3.6 Acoustics 4.4 Energy consumption and building systems 4.5 Concluding observations 5 Conclusions Acknowledgements References INTERNATIONALWELLBUILDINGINSTITUTE DODGE 2012 222 235 R DIPPOLD 2014 435 474 T LADD 2010 451 478 H RESEARCHEXPERIMENTALPOVERTYTHRESHOLDS 2018 ANNUALENERGYOUTLOOK2018PROJECTIONS2050 YAN 2017 258 270 D JANDA 2011 15 22 K MAHDAVI 2007 72 75 A ABUSHARKH 2005 S ABUSHAKRA 2001 B COMPILATIONDIVERSITYFACTORSSCHEDULESFORENERGYCOOLINGLOADCALCULATIONSASHRAERESEARCHPROJECT1093RPFINALREPORT YAN 2015 264 278 D KOUPAEI 2019 D ATECHNIQUEFORDEVELOPINGHIGHRESOLUTIONRESIDENTIALOCCUPANCYSCHEDULESFORURBANENERGYMODELS PASSE 2019 U SIMAUD ATECHNIQUEFORDEVELOPINGHIGHRESOLUTIONRESIDENTIALOCCUPANCYSCHEDULESFORURBANENERGYMODELS REINHART 2013 C 13THCONFERENCEINTERNATIONALBUILDINGPERFORMANCESIMULATIONASSOCIATION UMIANURBANSIMULATIONENVIRONMENTFORBUILDINGENERGYUSEDAYLIGHTINGWALKABILITY WOOLDRIDGE 1995 M INTELLIGENTAGENTSTHEORYPRACTICECAMBRIDGEORG LEE 2014 407 416 Y PUTRA 2017 845 859 H CAO 2015 49 57 Y NARASIMHAN 2019 K COMPUTATIONALSOCIALSCIENCECONFERENCE DEMYSTIFYINGINCONSPICUOUSENERGYCONSUMPTIONINHOUSEHOLDSUSINGAGENTBASEDMODEL CHEN 2012 515 524 J CHAPMAN 2018 604 621 J HONG 2016 272 281 T AJZEN 1991 179 211 I DONG 2015 892 901 B DEMENEZES 2012 A ASSESSINGIMPACTOCCUPANTBEHAVIOURELECTRICITYCONSUMPTIONFORLIGHTINGSMALLPOWERINOFFICEBUILDINGS DOCA 2016 S INTRODUCTIONOCCUPANTBEHAVIORMOTIVATIONSURVEYFRAMEWORK STEG 2009 309 317 L BORSHCHEV 2004 A 22NDINTERNATIONALCONFERENCESYSTEMDYNAMICSSOCIETY SYSTEMDYNAMICSDISCRETEEVENTPRACTICALAGENTBASEDMODELINGREASONSTECHNIQUESTOOLS KOUPAEI 2019 M CONFERENCEINTERNATIONALBUILDINGPERFORMANCESIMULATIONASSOCIATION DEVELOPMENTAMODELINGFRAMEWORKFORREFINEDRESIDENTIALOCCUPANCYSCHEDULES CAPIC 2018 T AUSTRALIANUNITYWELLBEINGINDEXAUWIFINANCIALCONTROLMELBOURNEAUSTRALIA HOWARD 1989 18 32 H ZHU 2006 237 246 Y GAO 2015 14 25 G HAM 2015 214 224 Y DONG 2018 1645 1650 X PROCEEDINGS2018INTERNATIONALCONFERENCEMANAGEMENTDATASIGMOD18 DATAINTEGRATIONMACHINELEARNING BOUBEKRI 2014 603 611 M JONES 2013 R BUILTENVIRONMENTHEALTHEVIDENCEREVIEWGLASGOWUK DEARRY 2004 600 601 A RYAN 2014 62 76 C DOWNTON 2016 168 182 P IUDC2016SMARTCITIES21STCENTURYAUSTPROC9THINTURBANDESCONF BIOPHILIAINURBANDESIGNPATTERNSPRINCIPLESFORSMARTAUSTRALIANCITIES LING 2018 187 197 T GRAYMORE 2010 459 468 M REINHART 2016 196 202 C ORTIZ 2017 323 335 M SAXENA 1997 263s 266s S WATSON 2018 232 243 K BUTTERWORTH 2000 I RELATIONSHIPBETWEENBUILTENVIRONMENTWELLBEINGALITERATUREREVIEW SCHAUBROECK 2017 1464 1477 T ALNASSAR 2016 2579 2590 F MAHDAVI 2019 A CLIMA2019CONGRESS INQUIRYCERTIFICATIONPOTENTIALBUILTENVIRONMENTSAFFORDANCE DIVAFORRHINO TAOX2020X106518 TAOX2020X106518XY https://vtw.elsevier.com/content/oragreement/10144 CHU_NSF publishAcceptedManuscriptIndexable http://www.elsevier.com/open-access/userlicense/1.0/ 2020-12-28T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2019 Elsevier Ltd. All rights reserved. 2019-11-01T17:51:49.806Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/eoas NSF National Science Foundation http://data.elsevier.com/vocabulary/SciValFunders/501100008982 http://sws.geonames.org/1227603 item S0360-1323(19)30730-9 S0360132319307309 1-s2.0-S0360132319307309 10.1016/j.buildenv.2019.106518 271434 2020-10-25T00:33:09.542687Z 2020-03-01 2020-03-31 1-s2.0-S0360132319307309-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/MAIN/application/pdf/3251f953e12ce4d5f853115a76867faa/main.pdf main.pdf pdf true 1539935 MAIN 9 1-s2.0-S0360132319307309-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/PREVIEW/image/png/868db75d638c8b69f39c286e88d37610/main_1.png main_1.png png 50386 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0360132319307309-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr2/DOWNSAMPLED/image/jpeg/69137d9eab7a1cc73e25c761eb7fa7d0/gr2.jpg gr2 gr2.jpg jpg 188786 1014 574 IMAGE-DOWNSAMPLED 1-s2.0-S0360132319307309-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr3/DOWNSAMPLED/image/jpeg/2ad0c86b2bdbaddcf3a3c6472cee57f1/gr3.jpg gr3 gr3.jpg jpg 90727 500 540 IMAGE-DOWNSAMPLED 1-s2.0-S0360132319307309-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr1/DOWNSAMPLED/image/jpeg/f8cc94118bba204b599c1316470d78a7/gr1.jpg gr1 gr1.jpg jpg 102322 404 713 IMAGE-DOWNSAMPLED 1-s2.0-S0360132319307309-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr4/DOWNSAMPLED/image/jpeg/074db867e6f7a5d4c1fafbfd3215432d/gr4.jpg gr4 gr4.jpg jpg 33355 234 357 IMAGE-DOWNSAMPLED 1-s2.0-S0360132319307309-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr2/THUMBNAIL/image/gif/713fd42a33f6d60cc97e38aa66c7c1b0/gr2.sml gr2 gr2.sml sml 21110 163 92 IMAGE-THUMBNAIL 1-s2.0-S0360132319307309-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr3/THUMBNAIL/image/gif/0e65a78010c49466ae314e2cf9b36f0f/gr3.sml gr3 gr3.sml sml 26399 164 177 IMAGE-THUMBNAIL 1-s2.0-S0360132319307309-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr1/THUMBNAIL/image/gif/d49932c0ed6e0ce3ca16bdadd45a6cbd/gr1.sml gr1 gr1.sml sml 16161 124 219 IMAGE-THUMBNAIL 1-s2.0-S0360132319307309-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr4/THUMBNAIL/image/gif/461032e03d9628844c1a6b653913a9c7/gr4.sml gr4 gr4.sml sml 26052 143 219 IMAGE-THUMBNAIL 1-s2.0-S0360132319307309-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr2/HIGHRES/image/jpeg/f840c2f6ba119f2fc018dc7b5d7c1195/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 1677117 4496 2544 IMAGE-HIGH-RES 1-s2.0-S0360132319307309-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr3/HIGHRES/image/jpeg/9ee975c3e48811f502ae92cd83a38ca2/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 665928 2215 2390 IMAGE-HIGH-RES 1-s2.0-S0360132319307309-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr1/HIGHRES/image/jpeg/55d7a5d3b0e91fb2ef830a645a5fd357/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 618282 1789 3158 IMAGE-HIGH-RES 1-s2.0-S0360132319307309-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360132319307309/gr4/HIGHRES/image/jpeg/fff8b4ea26e1d3a261d73f046a38c786/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 158774 1037 1583 IMAGE-HIGH-RES 1-s2.0-S0360132319307309-am.pdf am am.pdf pdf 764733 AAM-PDF https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10359TQX1LX/MAIN/application/pdf/359a41bd50ad3d8394daf3d7227978ac/am.pdf BAE 106518 106518 S0360-1323(19)30730-9 10.1016/j.buildenv.2019.106518 Elsevier Ltd Fig. 1 A conceptual framework connecting sustainability and human wellbeing at the building level. Notes: Bubbles are categorical concepts and boxes are exemplary subcategories or items of the category. Yellow bubbles are built environment categories/sub-categories and green bubbles are metrics. Blue boxes are items in the categories. Fig. 1 Fig. 2 Point in Time Illuminance Simulations with DIVA 4 Rhino for five months (January, March, June, August, October) at three times of the day (9am, 12noon and 3pm) highlighting the important daily and seasonal variations. (the color scale represents illuminance levels in lux from dark blue being ‘0’ to bright red being 2000 lux and higher). (For interpretation of the references to color in this figure legend, the reader is referred to the Web version of this article.) Fig. 2 Fig. 3 Daylight Autonomy Simulation in DIVA 4 Rhino indicating 100% DA in the rooms with windows, 41.82% overall. Fig. 3 Fig. 4 Daylight rendering of one of the consultation rooms to highlight the availability of daylight. (furniture and other more personal features are omitted to protect the privacy of the place). Fig. 4 Modeling and data infrastructure for human-centric design and operation of sustainable, healthy buildings through a case study Yong X. Tao a ∗ Yimin Zhu b Ulrike Passe c a Cleveland State University, USA Cleveland State University USA Cleveland State University, USA b Louisiana State University, USA Louisiana State University USA Louisiana State University, USA c Iowa State University, USA Iowa State University USA Iowa State University, USA ∗ Corresponding author. This paper focuses on data infrastructure that is central to the modeling of design and operation of sustainable and healthy buildings. While reducing energy consumption by making buildings more energy efficient has been touted as an easily obtainable approach to promoting carbon-neutral energy societies, the sustainable buildings’ benefits and impacts on human wellbeing have not been clearly quantified to the extent that they may directly influence the decision of adopting sustainable building designs. The authors argue that focusing on the wellbeing of people occupying the buildings will lead to significant changes in the decision-making process of the design and operation of sustainable buildings. The authors propose a framework to define the type of data that can be measured or acquired and contributed to the design and operation of buildings for energy efficiency in relation to human wellbeing and social economic aspects. The framework can benefit building designers and operators for decision-making using wellbeing-centric life cycle assessment. The methodology presented in the paper is supported through a case study. Keywords Human wellbeing Sustainable buildings Data analytics 1 Introduction The evaluation of sustainable building design and operation practices has been a focus in research and professional practice over the past decades with increasing interest since green building standards were implemented around the end of the 20th century. While architects and engineers initiated most early studies in conjunction with legal and policy professionals, current research also involves social, behavioral, and computational scientists for multidisciplinary approaches to determine the fundamental questions about the ultimate societal goals of sustainable development in response to constraints imposed by natural environment and resources. Among many measures for a sustainable building, the measure of energy savings in a “sustainable building” is of utmost concern. While Energy Use Intensity (EUI), the energy use per useable area for a given building, is one way to measure, the wellbeing of people who occupy buildings should also matter. In other words, given two buildings with the same EUI, would the building with higher occupant satisfaction be considered a better building? Here the occupant satisfaction should be defined by human factors such as essential comfort (lighting, temperature and acoustics), healthy necessity (good air quality, clean water, pleasant interior design, etc.), convenience (human building system interaction, service access, etc.) and other contextual factors such as community, school district, transportation, etc. When human factors become part of the equation, decision-making is getting more complicated. In order to truly achieve the long-term goals of sustainability, building sustainability evaluation must go beyond the design and construction phases. If we all agree that life-cycle measures including human wellbeing should be considered when evaluating sustainability, the subsequent questions are inevitably related to data that quantify the occupant wellbeing as a result of building occupancy. Assuming these data can be gathered and analyzed with usefulness, the next question will be “can they be tied to the value of the building in economic and social senses?” 1.1 Vision and objective Given the highly fragmented nature of the architecture, engineering and construction industry and the increasing adaptation to computer-mediated decision-making processes in the industry, we propose the following holistic vision: A data infrastructure promoting the development of a coherent data analytics methodology that is available for key stakeholders to link individual human wellbeing indicators to built environments, and collectively, allows the scaleup to a community level for social and economic decisions, no matter where the community is located. Based on the above vision, we define the objective of this study: To identify the missing links and potential pathways to connect energy efficiency and wellbeing in a building-level sustainability framework with the goal of using human wellbeing as a motivation for adopting sustainable building design and operation. 1.2 Wellbeing and sustainable design In 2014 the WELL Building Standard [1] was launched as the first, systematic attempt to define criteria that measure, certify, and monitor built environment features. Such features impact human health and wellness through air, water, nourishment, light, fitness, comfort, and mind. The research background for WELL standards has been derived primarily from medical research into individual health and wellness and their relations with the built environment. While often quoted exchangeable, wellness and wellbeing are not the same [2]. Wellbeing refers to a whole-of-life experience, whereas wellness traditionally refers to physical health. For example, employers can have a big influence over employees’ wellbeing, but often they focus only on their physical wellness related to job performance. In addition, it has been known [3] that the decision for green building certification is significantly influenced in areas with well-educated people and a political preference [4] and with the environmental orientation of the population. And it also is known that poverty levels directly correlate to education levels of population [4]. It therefore can be naturally deduced that green building, as well WELL, certifications seem correlated with well-off population. Yet the latest data, reported by the US Bureau of Labor Statistics, shows that nearly half of the US population is considered to be of low-income (100–199% of poverty level) [5]. Therefore, the above-stated vision must consider this fact to broaden the impact of relevant research. In this paper data infrastructure is a general term underlining a proposed framework (Section 3) that organizes the relations among various modeling tools and input and output data. Under the context of design and operation of sustainable, and healthy built environments, these models may well be across multiple disciplines, depending on the nature of data and targeted analytical results. In particular, this paper attempts to link the modeling technique used in engineering field to that is often used in social science field, for example, human reactions to the design and operation. The paper proposes such a framework and select one typical case to demonstrate the aforementioned linkage, which may stimulate further exploration of complex interactions among determining factors, influencing collective or individual decisions in building design and operation. 2 Literature review 2.1 Human behavior in buildings According to the 2018 Annual Energy Outlook [6], the building sector (both residential and commercial) accounted for more than 27% of total U.S. delivered energy in 2017. Unfortunately, projections are predicted to be growing by about 0.3% per year. As a consequence, energy use in buildings has become a growing concern of both the public and professionals in the field [7]. However, “Buildings don't use energy: people do” [8]. Therefore, an understanding of occupancy energy behavior and its implications for energy use is vital [9,10]. Hence, in recent years, the body of literature concerned with energy-related occupant behavior in buildings increased [7]. As a result, almost all energy modelling software tools use some sort of data linked to occupant behavior as a defining factor for the calculations of yearly for heating, cooling, lighting ventilation and plug load profiles. ‘‘Diversity profiles,’’ a schematic occupant presence profile of a space or thermal zone over a given period of time intend to reproduce the real occupancy of the space in order to accurately estimate the impact of people's presence and activity levels on building energy load demand calculations [11]. These profiles usually consist of a combination of weekday and weekend schedules for the type of buildings (for instance residential or commercial) in discussion. Software users are often given the choice of using the predefined generic schedules in the simulation tool's default library or defining their own profiles instead, which could have the user flexibility and higher precision. Given that occupancy has a considerable influence on internal loads, ventilation requirements and thus building energy consumption [12], the use of such generic schedules results in large gaps between the predicted and actual energy use of buildings [11]. As one of the attempts to fill the gaps, Malekpour et al., 2019 [13] have recently used a community energy use survey to develop a Markov chain transition probability matrix based on the American Time-Use Survey (ATUS) database [14]. The resulting refined schedules were incorporated into the Urban Modeling Interface (UMI) [15] and were then tested on their pilot case study, a relatively low-income dense neighborhood in Iowa, US. Recent research uses agent-based models (ABMs) [16], including human-building interaction for commercial building occupant behavior, perceived thermal comfort, and energy consumption [17,18], and in residential buildings [19,20]. Other ABMs connect agents via social networks to represent effects of social influence and information sharing on energy-related behavior [21]. Co-simulation with an ABM and EnergyPlus can facilitate data transfer between the two platforms [22,23]. 2.2 Occupant characteristics (time based) The theory of planned behavior (TPB) [24], is a well-known model that has been applied widely to studying occupant behavior and behavior changes. It suggests that one's intention determines behavior. Attitude and subjective norms determine one's intention. In addition, behavior is also determined by a person's perceived behavior control (i.e., a person's perception of his/her ability or feeling of self-efficacy to perform). While attitudes, norms, and perceptions of behavioral control can be dynamic and context specific, the beliefs, statuses, and experiences that provide the foundation for these cognitions are somewhat static. Therefore, an occupant behavior model should begin with the assessment of these somewhat stable factors and variables, such as gender, nationality, residency experiences, socio-economic status, among others [25]. These formative attributes shape the beliefs and attitudes that dictate how individuals might engage with their environments (e.g., energy appliances) and the sense of values and responsibilities that reflect attitudes toward energy consumption and conservation [26]. In addition, how others in our social circle, family, workplace, and geographic/national culture engage energy consumption also affect occupant behaviors [27]. In practice, Steg and Vlek [28] summarized general factors that affect environmental behaviors, which can be used to design surveys and explain occupant energy consumption behaviors. 2.3 Data and model types 2.3.1 Physics-based and statistic models In general, the analyses of building design and performance, especially energy modeling, adopt physics-based modeling (PBM) techniques, where the data and phenomena described can be used in or presented by laws of physics with continuum mathematics, or approximated by discrete mathematics while maintain the levels of details in micro or operational scales; also known as deterministic models, for example, EnergyPlus. On the other hand, statistical modeling is widely used in medical sciences, business and finance, and social science where the scales of data and phenomena trends at macro, aggregated levels, or complex correlations among phenomenological parameters are sought. Matured Agent-Based Modeling technique (ABM) noted above are uniquely suitable for a range of data scales between micro and macro as summarized by system dynamics researchers [29]. A growing body of research is addressing the challenge of stochastic/probability data into otherwise deterministic or static building energy models. Two International Energy Agency Annexes (Annex 66 and 75) have been working on these challenging issues. Recent developments [13,30] include an attempt to balance between complexity and accuracy among the aforementioned models for the sole purpose of energy use studies in the context of residential neighborhoods. A probabilistic occupancy model is used based on the American Time Use Survey (ATUS), and the input from the population of study is used to develop representative occupancy schedules. 2.3.2 Qualitative and quantitative models Studies on wellbeing that involve human behavior patterns, emotions, social and cognitive sciences, mostly collect qualitative data as. certain aspects are better conveyed through words and cannot directly be observed in numerical form [31]. However, in order to yield meaningful analysis that can endure rigorous validation and verification, quantitative analysis that can be duplicated and have broader impacts is often required. Therefore, almost all quantitative studies present their qualitative data in a quantifiable way, such as the Likert scale on survey questionnaires. An indicator such as wellbeing index (often defined by life satisfaction scores) is then developed. The results are usually compared with a norm from a surveyed population to represent its significance. For example, it was reported that one in eight mid-aged Australians has a satisfaction score below normal [31] when a Personal Wellbeing Index (PWI) was applied. The challenges in developing data infrastructure pertinent to the objective identified in Section 1.1 lie in an expectation of new models that can be developed so that the output of personal wellbeing studies, such as PWI obtained at a given time, can be integrated into a PBM as an input. The opposite can also be beneficial if an output of a PBM, such as EnergyPlus, can be integrated into a PWI model to study the sensitivity of, for example, energy saving pattern, or attitude towards sustainability, to the wellbeing index. 2.3.3 Data integration and sharing Data integration and sharing are two related but different challenges. Data integration deals with problems of integrating heterogeneous data when data are shareable; while data sharing deals with motivations and mechanisms to share data. A major challenge facing the building community for decades is highly fragmented data sources [32]. Fragmentation results from multiple factors including the uniqueness of each building, the diverse ownership of building data, various data granularities and formats, and data security and privacy and security concerns. Data integration strategies and methods have been studied for decades including standard-based approaches, machine learning approaches, and hybrid approaches [33]. The standard-based approaches have been widely adopted in the building industry and various data standards such as the industry foundation classes have been developed and applied (e.g. Refs. [34,35]). On the other hand, machine learning has been used for data integration in entity resolution, data fusion, and data extraction [36]. 2.4 Quantification of health and wellness 2.4.1 WELL standard The International WELL Building Institute (IWBI) [1] developed the WELL Building Standard and certification process, based on scientific and medical research as well as literature on environmental health, behavioral factors, health outcomes and demographic risk factors. The certification categories thus circle around the relationship of the occupant to the environment created by the building. It focuses more on the interior conditions and thus complements the criteria certified under USBGC, which relate more to the building in its environmental context. The recently released 10 concepts in WELL v2 are: Air, Water, Nourishment, Light, Movement, Thermal Comfort, Sound, Materials, Mind and Community. While the content of these topics should be common sense other factors, such as economic considerations in the development of built projects might have prevented addressing them in the past. Some, like air quality also might provide trade-offs for energy use as fresh air needs to be conditioned. 2.4.2 Living Building Challenge (LBC) The Living Building Challenge by the International Living Future Institute is a global network dedicated to provide a healthy future for all. With this goal, they go beyond both USGBC LEED and the WELL standard and combine health and energy strategies. Buildings certified by this group are creating more energy than they need, capture and treat all water on site and use healthy materials. The design outcomes are regenerative buildings that connect occupants to light, air, food, nature, and community. Those buildings are self-sufficient and remain within the resource limits of their site. Finally, they create a positive impact on the human and natural systems that interact with them. The criteria are thus Place, Water, Energy, Passive Design and Energy efficiency, Health and Happiness, Daylight and Views of nature/healthy materials, Materials outside the Red list, Equity, and Beauty. The Place petal addresses walkability, connection to nature and community integration, which resonate with the WELL standard. 2.4.3 Lighting A large body of research exists, which connects the availability of daylight specifically for office workers with their health and wellbeing. The availability of daylighting is therefore a significant criterion for both WELL and LEED standards. For example, in Ref. [37] the impact of daylight exposure on the health of office workers is examined from the perspective of subjective well-being and sleep quality as well as actigraphy measures of light exposure, activity, and sleep-wake patterns. Workers in windowless environments reported poorer scores than their counterparts—role limitation due to physical problems and vitality—as well as poorer overall sleep quality. Compared to the group without windows, workers with windows at the workplace had more light exposure during the workweek, a trend toward more physical activity, and longer sleep duration as measured by actigraphy. It is suggested that architectural design of office environments should place more emphasis on sufficient daylight exposure of the workers in order to promote office workers' health and well-being. 2.5 Integrating wellbeing with the built environment It is commonly understood that the built environment has significant impact on human wellbeing (e.g. Refs. [38–40]) and consequently planning, design, and operations of the build environment should always take human wellbeing into considerations (e.g. Refs. [41–43]). In general, the built environment includes all man-made space where people live, play, and work, including homes, buildings, transportation systems, parks, and other civil and utility infrastructures. Human wellbeing has been included in the sustainability assessment of different studies (e.g. Ref. [44]). Challenges exists to transfer models and knowledge from field to field, such as from building level models to urban level models [45]. Operationally, the concept of wellbeing has many variations (e.g. Refs. [2,46]). The World Health Organization defines wellbeing from a quality of life perspective using key concepts such as “a person's physical health, psychological state, personal beliefs, social relationships, and their relationship to salient features of their environment” [47]. In this study we present a uniquely identifiable concept or set of related concepts that can be used to define and measure wellbeing in a particular context. For example, such a construct can be comfort (including thermal, visual, and acoustic comfort, and indoor air quality) at homes and offices, or stress at work places, safety of public transport systems, or equal access to healthy food and clean water in cities [2]. Also wellbeing research in the built environment focuses on, for example, comfort, indoor environmental quality, health, and happiness [48], while at the urban scale focus is on planning and social consequence of the built environment, using constructs such as public health and equal access to infrastructure [49]. It is important to have a multidisciplinary network of expertise to deal with emerging needs due to social-technological changes, map relationships between known constructs and emerging ones, develop data acquisition and analysis methods, and create data sharing and interoperability strategies. 3 A conceptual framework In the context of the built environment, the concept of life cycle assessment (LCA) as a method to estimate the environmental performance of building products and processes, as well as buildings themselves has been evolving from solely focusing on environmental consequences to a broader scope, also including economic and social life cycle assessment. The extension of environmental LCA to life cycle sustainability assessment ultimately needs to put human and wellbeing at the center. However, this is not a simple switch; rather it requires fundamental rethinking about the area of protection (AoP) [50]. For example, conventional life cycle assessment includes air quality and human health as part of the social impact [51], however the consideration of impact on human health is general and not individual specific. Consequently, such assessment is useful for comparing planning, design, engineering, or operation plans, but not quite useful for assisting designers and operators in understanding and maintaining wellbeing in the built environment. The spatial and temporal nature of some wellbeing constructs such as stress requires a new assessment method, which demands us to think through questions such as “Will the anthropocentric approach require us to consider the life cycle of human, human groups or communities rather than man-made artefacts as the subject of analysis?” or “To develop the anthropocentric approach within the framework of the conventional life cycle assessment, what do we need to change in order to put human and wellbeing at the center?” Based on the literature review, we propose a conceptual framework (Fig. 1 ) that links the data technology for individual wellbeing to wellbeing-centric built environment life cycle assessment. Fig. 1 shows four interrelated concepts for constructing wellbeing-centric life cycle assessment. Firstly, human is at the center of the framework. Secondly, the built environment such as buildings, infrastructure, and communities connects with human through the interfaces of the built environment, or affordance, i.e., “the availability, effectiveness, and usability of control devices and their interfaces” [52]. Traditionally, affordance narrowly refers to providing comfort, especially in buildings. With considerations for wellbeing, additional affordance of the built environment has been included such as providing lighting, water, air, and nourishment, and at different levels of the built environment such as buildings, infrastructure, and communities. Such affordance, or the level of affordance, affects humans, so there is a need to assess affordance from a human perspective. Thirdly, the wellbeing and built environment interface metrics include physical, physiological, psychological, and behavioral measures such as health, stress, emotion, and routine habit, as well as built environment perception measures such as controllability. Lastly, the wellbeing-centric life cycle assessment metrics should assess both the conventional sustainability of the built environment and the wellbeing of human. Underlining the above four interrelated concepts are the four key elements of data infrastructure: Element 1: Data technology, an interface between human and the built environment. Here, we refer to data technology narrowly as the identification and application of sensing or sensor technologies while data collection and curation are included in Element 4. Element 2: Data of wellbeing-centric built environments. This element includes data of built environments at the component level, such as energy efficiency and building controls and all wellbeing and wellness related constructs such as space utilization, lighting, and comfort controls. A built environment component refers to a building or an infrastructure facility. Element 2 focuses on the affordance and wellbeing at such a level. Element 3: Data for built environment affordance. In this element, focus is given to collecting and curating data at the community and societal level, and aggregating component-level wellbeing data and scaling it up to the community and societal level. Element 4: Data integration. This element covers a range of topics including wellbeing constructs, data interoperability and sharing strategies, data analytics, ethics, and data privacy, security and ownership issues. The four elements play different roles in the framework. Element 1 sets a technical foundation to acquire data essential for individual wellbeing such as assessing human stress and emotion, as well as for understanding the impact of human habitual behaviors and ability to control building systems on energy efficiency. While Element 2 is about individual built environment components, Element 3 brings an important social economic aspect into the framework by developing scaling up capabilities for larger scale analysis. Finally, Element 4, data integration for the conceptual framework, addresses the need to better support data management in the overall framework. Element 4 ultimately enabled dealing with a large amount of data to fulfill the needs of four interrelated concepts before the benefits of modern data science and data technologies can be beneficial to building design and engineering. 4 A case study - method of data collection Proposed framework has two layers: One is the four categorial concepts, including metrices, such as wellbeing and built environment interface, and LCA, and affordances, such as comfort affordances and others. These metrics and affordances connect sustainability and human wellbeing at the building level, as illustrated in Fig. 1. The other layer is of four underlining elements that consist of essential modeling and data infrastructure and their integration, and act as threads tying the technological and socioeconomic research exploration together. To stipulate the potential of the proposed framework, we present a case study of a health and wellness clinic designed towards USBGC LEED Platinum to demonstrate the use of the elements of framework to support design and understand the relationships between sustainability and wellbeing. The case contains the selected items within the metrics of wellbeing and built environment interface, as well as the relevant items in the subcategory of comfort affordance, as indicated in Fig. 1. Occupant's perception data of the building was collected through a focus group interview session; therefore, all voices are kept anonymous. The participants were recruited through an email to all employees working in the health and wellness center and 6 respondents participated in one and half hour focus group meeting. The interview and conversation prompts were based on 27 questions approved as an exempt human subject study by the institutional review board. Energy data and thermal data were collected through metering and provided through a data sharing agreement. Based on the responses by the participants, daylight simulations were conducted in DIVA 4 Rhino [53], a validated daylighting simulation software using the Radiance raytracing engine. 4.1 Case description: a birth and wellness clinic in the midwest The building is a retrofit of an early 20th century small-scale commercial building with three floors and a new addition. The building enclosure has been carefully upgraded with insulation and new windows. A green roof and a photovoltaic array were added while retaining the historic character of the building. Most historic materials like lath timber from walls have been reused for interior design features. Achieving proper daylighting and acoustic privacy were of utmost concern. One of the building design features is court-yard centered space with no long corridors. During the interview session, in winter, the windows were closed, but there is a flow-path to let outside air stream through the building from the southern side up through the skylight in the center and the windows in the front. Those front windows, original to the building are beloved by all workers and customers alike. The purpose of the building is women's care. The working occupants are supporting women throughout their pregnancy, during birth and afterwards. They are thus providing holistic care of women and their family such as wellness support through life. 4.2 Feedback from health providers and patients 4.2.1 Meaning of wellness According to the providers, the development from wellness to health evolves in stages. Each person has a different idea or concept, what they want their health to be. Health is considered a state of being, while wellness is the mode to get there, and wellness is the lifestyle choices people make and health is the outcome of the journey. The clinic thus provides essential oils, nutritional guidance, herbals, acupuncture, chiropractor, energy healing, many educational health and wellness programs and connection to the community. 4.2.2 Space/place (LBC) Users report a difference, a peace, a building that embraces them. The building is comforting for all users (providers and clients) through its views, material, light, smells. It relaxes everyone through its beautiful wooden walls made from the recycled lath of the removed walls. The main ceiling in the meeting room has no edge. As one provider put it: “when it is very appealing to your eyes, then you know it is appealing to other eyes as well.” Different spaces exist for different activities of the program. The library acts as waiting room. Other rooms are clinic rooms, laundry, utility room where they wash instruments. The mechanical room in the basement runs the building. There is a waiting area/midwife staging area outside the birth suits. Every room is different because of the clay and its colors, each room has its own color, the birth suits feel very different, and the women get to choose where they gravitate towards, where they want to be. In that regard, the clinic operates more like a “bed and breakfast”. The provider has the same options about flexibility in using space; some days they can work here, some days there. Occupants can choose their workplace based on individual moods. The building thus supports the diversity of its users. The providers are very connected with clients and each other. 4.2.3 Community While this is a clinic for women to give birth, it is a holistic place for the family. There is always space for the family to join the conversation. Men are welcome. Space is available to breath, men can walk out, can walk in, they can find their place. They have less fear, because their loved ones are coming here, when she feels safe, they like that. They are all the time part of the activity, it is family centric care with amble space. The building is representative of the care being a model for the change we would like to see, as a leader in the industry. 4.3 Results based on important data types provided by three standards 4.3.1 Light (daylight and well-placed indirect electrical light) The light conditions contribute to the positive impression, there are no fluorescent light bulbs, which relates to the impact of color rendition and color quality. Fluorescent light would be too ‘edgy’ as one provider phrased it. Daylight and warm colors appear more natural. Electrical lights are mostly recessed and indirect. The experience depends on the time of day (as seen in Fig. 2 .) The designer was also aware, that the building is often occupied, at night, when the place feels so cozy, nurturing. One provider noted, that she has never been in a building where she would like to hug the wall, they appreciate/love the clay, feeling that it is natural. The office has less direct light. There the daylight comes in through the top windows. There are some windows between the rooms. Most did not have that in previous environments, where workers were tucked inside. Once they were more exposed to daylight they had realized, what they were missing. Fig. 3 shows the annual daylight autonomy simulation based on 300 lux, where even the central space with the skylight is well daylit across the year. The building uses much less electrical light even while utilizing indirect lighting. Indirect light relates well to the reclined position of the clients who often need to look up to the ceiling, thus it is important to include the ceiling in the visual environment. Occupants noted, that the building had sometimes glare issues on the south side, but there are blinds. 4.3.2 Views Views have a particular meaning in this building and the landscape around the building was of special concern to the designer. The women love the views and like to face the window during consultations as highlighted in Fig. 4 . This shows a real need for the visual, but the option to shade and desire privacy exists as well. The opportunity for a flexible operation of the windows is important, user control is critical. Some rooms are more turned on themselves, some are more directed to the outside, and views to outside are important to many clients. 4.3.3 Other wellbeing factors 4.3.3.1 Materials (Across all three rating systems) The use of non-toxic locally sourced materials such as the clay wall resonates across all three rating systems, for reasons of health and wellness as well as resource efficiency. Working in a space, a facility and care, supporting physiological birth, in tune with nature. Thus, the design and function of the building have a direct impact on both wellbeing and energy use. where all materials derived from natural elements, wood, clay metal, the water, the light, relates the building to nature and allows it to be part of the earth. This creates a strong synergy between the building and the work. 4.3.3.2 Cleaning supplies An important aspect is the selection of cleaning supplies. The way we clean our world is a large issue covered in the criteria regarding VOCs. Therefore, also in this health clinic, the selection of cleaning supplies is a conscious decision. Thus, the interviewees could wholeheartedly confirm, that there are no chemicals in the building. Clients still do not hesitate to place the kids on the floor here. . 4.3.3.3 Health and happiness (LBC) This LBC criteria relates to individual autonomy and decision making in operations. The level of care provided in this clinic is possible, because the providers operate on the shared decision-making model, which for them directly relates to sustainability. They jointly decide how the environment is utilized. The providers believe that the human body can reach a certain level of vitality if it is supported, the body will heal, be without pain, if a person is balanced in his/her body, and therefore the daily processes will happen naturally. Natural processes relate to the planetary processes. Sustainability requires more connectedness to the planet and the body. This approach does take work and personal awareness. The interviewed providers are aware that they have to lead by example to empower their clients. Therefore, the clinical practice, the work that they do, does not feel stressed. If a stressful situation arises, they work through it together. 4.3.3.4 Nourishment The nourishment concept is also covered in this case project through the food related community classes they offer. The building has a big kitchen and a lot of groups meet to discuss food and health related topics. 4.3.3.5 Thermal comfort The building controls for thermal comfort are very flexible. Each room has its own thermostats. As the center supports women of all ages as well as their partners and children, the systems can be adjusted in all of the rooms. Yet, the building is generally maintained at a comfortable level, typically at 72° Fahrenheit, which is required by OSHA and supported by measured data. In winter, they provide blankets pillows, to create personal comfort environments. During the focus group interviews, no one could describe a non-comfortable situation. The project thus highlights the importance that the environment is able to adjust. 4.3.3.6 Acoustics The acoustic privacy is imperative to their operation and has to be compliant with HIPPA. Sound barrier provide that required level of privacy. One person can be in the library and speaking with client, while a birth is going on two rooms away. This is also part of wellness: Sound softness. Each of the rooms can play music, which plays a big role in yoga and meditation, calm, usual music at birth, making it like a spa. Other features include less reverberation, lot of diffusion in the room, not a lot of echo, soft soles, and indoor shoes only. 4.4 Energy consumption and building systems The building was retrofitted from a desolate small red stone commercial main street building. Insulation and new windows were added, and the lath of the demolished wall and floors reused. While the building systems had some failures, regarding excess condensation, and heating system had some issues with expansion and contraction, given that the building is 100 years old the optimum for energy efficiency has been achieved. A ground-coupled heat pump avoids the use of fossil fuel energy consumption. with an energy use intensity of 15–21 kWh/sq. ft/year. An average of 10% of electricity consumption is provided by solar photovoltaic power with a peak of 18% in June. 4.5 Concluding observations The key features of the case study project which combine WELL standard, the Living Building Challenge and USGBC LEED are: • Flexibility in space use and time contributes to wellbeing, comfort and personal control, • Proper use of daylight and indirect electrical light. • The spatial configuration avoids long corridor and provides connected spaces as well as privacy through careful design. • The ceiling design is an important factor for proper daylight and views from the reclined position of the patient. • The use of natural materials corresponds to health through less toxicity and reduced embodied energy. • Consciously placed views to the outdoors including framed views of trees and natural elements contribute to the feeling of comfort. • Acoustic considerations are essential for privacy and wellbeing. • The operational schedule of the building allows for an inclusive, family, parent and mother centric daily work pattern. All those criteria confirm the conceptual framework in Fig. 1. 5 Conclusions This study examines approaches to achieve long-term sustainability goals that must go beyond the design and construction phases. The authors present an argument that how people interact with or use sustainable buildings through their lifecycle will ultimately define the meaning of sustainability and verify it. While many researchers agree that there are intimate relations between human wellbeing and built environments, the challenges to quantify the relations and consequently bring the results to the design and construction processes inevitably require a data infrastructure that enables such investigations. The literature review reveals that links from the data technology for individual wellbeing to wellbeing-centric built environment life cycle assessment are lacking. The authors propose a data infrastructure to fill this gap by defining following four key elements: 1. Data technology for individual wellbeing including WELL metrics. 2. Data for wellbeing-centric built environments. 3. Data for built environment affordance. 4. Data integration. These elements underline the development of a conceptual framework, aiming at research methodology towards linking individual human wellbeing indicators and collectively, scale up to a community scale for social and economic decisions for wider ranges of stakeholders including the underdeveloped communities. As a first attempt towards the presented vision in this study, a case study for a birth and wellness clinic has been presented, with a limited scope based on qualitative data, to illustrate the overlap of wellbeing data and building performance data collected and typical analysis performed. The findings demonstrate the possibility to quantify the building related wellbeing parameters using daylighting as one key parameter, which is connects well-being with energy performance, in conjunction with energy related parameters and metrics, while further study is needed to expand the study to link the building performance data for design and construction domain. In the end, good design will always provide better occupancy satisfaction, yet the qualitative aspects of a design are challenging to grasp with quantitative measurements. Finally the case study demonstrated daylighting as an example that connects the well-being and energy realm of the built environment. Daylighting metrics are well studied and validated through experimental research. Material and indoor air quality are the other two major metrics, which could be studied next, but those metrics are more complex. The conclusions and findings illustrate the aspects of Elements 1 to 3 in the proposed framework, and lead to future works. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgements The authors would like to acknowledge the funding support from the Iowa State University Center For Building Energy Research (CBER), and from National Science Foundation (NSF Award #1664881 and #1640818) and the undergraduate architecture students Tanya Sharma for the help with the diagrams and Evan Harrison for the daylight simulations. Authors would also like to thank the workers at the case study project site for their participation in the data collection. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation. References [1] International WELL Building Institute [Online] https://www.wellcertified.com/ “International WELL Building Institute.” [Online]. https://www.wellcertified.com/. [Accessed: 26-Apr-2019]. [2] R. Dodge A. Daly J. Huyton L. Sanders The challenge of defining wellbeing Int. J. Wellbeing 2 3 2012 222 235 R. Dodge, A. Daly, J. Huyton, and L. Sanders, “The challenge of defining wellbeing,” Int. J. Wellbeing, vol. 2, no. 3, pp. 222-235, 2012. [3] T. Dippold J. Mutl J. Zietz Opting for a green certificate: the impact of local attitudes and economic conditions J. Real Estate Res. 36 4 2014 435 474 T. Dippold, J. Mutl, and J. Zietz, “Opting for a green certificate: The impact of local attitudes and economic conditions,” J. Real Estate Res., vol. 36, no. 4, pp. 435-474, 2014. [4] H.F. Ladd Education and poverty: confronting the evidence J. Policy Anal. Manag. 29 3 2010 451 478 H. F. Ladd, “Education and Poverty: Confronting the Evidence,” J. Policy Anal. Manag., vol. 29, no. 3, pp. 451-478, 2010. [5] Research Experimental Poverty Thresholds [Online] http://www.bls.gov/pir/spmhome.htm “Research Experimental Poverty Thresholds.” [Online]. http://www.bls.gov/pir/spmhome.htm. [Accessed: 29-Apr-2019]. [6] U.S. Energy Information Administration Annual Energy Outlook 2018: with Projections to 2050 2018 U.S. Energy Information Administration, “Annual Energy Outlook 2018: with projections to 2050,” 2018. [7] D. Yan IEA EBC Annex 66: definition and simulation of occupant behavior in buildings Energy Build. 156 2017 258 270 D. Yan et al., “IEA EBC Annex 66: Definition and simulation of occupant behavior in buildings,” Energy Build., vol. 156, pp. 258-270, 2017. [8] K.B. Janda “Buildings don't use energy: people do Architect. Sci. Rev. 54 1 2011 15 22 K. B. Janda, “Buildings don’t use energy: people do,” Archit. Sci. Rev., vol. 54, no. 1, pp. 15-22, 2011. [9] A. Mahdavi L. Lambeva A. Mohammadi E. Kabir C. Pröglhöf “Two case studies on user interactions with buildings' environmental systems Bauphysik 29 1 Feb. 2007 72 75 A. Mahdavi, L. Lambeva, A. Mohammadi, E. Kabir, and C. Proglhof, “Two case studies on user interactions with buildings’ environmental systems,” Bauphysik, vol. 29, no. 1, pp. 72-75, Feb. 2007. [10] S. Abu-Sharkh Microgrids: distributed on-site generation Tyndall Centre for Climate Change Research 2005 S. Abu-Sharkh et al., Microgrids: distributed on-site generation. Tyndall Centre for Climate Change Research, 2005. [11] B. Abushakra A. Sreshthaputra J.S. Haberl D.E. Claridge Compilation of Diversity Factors and Schedules for Energy and Cooling Load Calculations, ASHRAE Research Project 1093-RP, Final Report 2001 B. Abushakra, A. Sreshthaputra, J. S. Haberl, and D. E. Claridge, “Compilation of Diversity Factors and Schedules for Energy and Cooling Load Calculations, ASHRAE Research Project 1093-RP, Final Report” 2001. [12] D. Yan Occupant behavior modeling for building performance simulation: current state and future challenges Energy Build. 107 2015 264 278 D. Yan et al., “Occupant behavior modeling for building performance simulation: Current state and future challenges,” Energy Build., vol. 107, pp. 264-278, 2015. [13] D.M. Koupaei F. Hashemi V. Tabard-fortecoëf U. Passe A Technique for Developing High-Resolution Residential Occupancy Schedules for Urban Energy Models April, 2019 no D. M. Koupaei, F. Hashemi, V. Tabard-fortecoef, and U. Passe, “A Technique for Developing High-Resolution Residential Occupancy Schedules for Urban Energy Models,” no. April, 2019. [14] U. Passe D. Malekpour F. Hashemi V. Tabard A technique for developing high-resolution residential occupancy schedules for urban energy models SimAUD 2019 2019 U. Passe, D. Malekpour, F. Hashemi, and V. Tabard, “A Technique for Developing High-Resolution Residential Occupancy Schedules for Urban Energy Models,” in SimAUD 2019, 2019. [15] C. Reinhart T. Dogan J.A. Jakubiec T. Rakha A. Sang Umi-an urban simulation environment for building energy use, daylighting and walkability 13th Conference of International Building Performance Simulation Association 2013 C. Reinhart, T. Dogan, J. A. Jakubiec, T. Rakha, and A. Sang, “Umi-an urban simulation environment for building energy use, daylighting and walkability,” in 13th Conference of International Building Performance Simulation Association, 2013. [16] M. Wooldridge N. J.-T. knowledge engineering review, and undefined Intelligent Agents: Theory and Practice,” cambridge.Org 1995 M. Wooldridge, N. J.-T. knowledge engineering review, and undefined 1995, “Intelligent agents: Theory and practice,” cambridge.org. [17] Y.S. Lee A.M. Malkawi Simulating multiple occupant behaviors in buildings: an agent-based modeling approach Energy Build. 69 Feb. 2014 407 416 Y. S. Lee and A. M. Malkawi, “Simulating multiple occupant behaviors in buildings: An agent-based modeling approach,” Energy Build., vol. 69, pp. 407-416, Feb. 2014. [18] H.C. Putra C.J. Andrews J.A. Senick An agent-based model of building occupant behavior during load shedding Build. Simul. 10 6 Dec. 2017 845 859 H. C. Putra, C. J. Andrews, and J. A. Senick, “An agent-based model of building occupant behavior during load shedding,” Build. Simul., vol. 10, no. 6, pp. 845-859, Dec. 2017. [19] Y. Cao T. Wang X. Song An energy-aware, agent-based maintenance-scheduling framework to improve occupant satisfaction Autom. ConStruct. 60 Dec. 2015 49 57 Y. Cao, T. Wang, and X. Song, “An energy-aware, agent-based maintenance-scheduling framework to improve occupant satisfaction,” Autom. Constr., vol. 60, pp. 49-57, Dec. 2015. [20] K. Narasimhan N. Gilbert A. Hope Demystifying the inconspicuous energy consumption in households using an agent-based model Computational Social Science Conference 2019 K. Narasimhan, N. Gilbert, and A. Hope, “Demystifying the inconspicuous energy consumption in households using an agent-based model,” in Computational Social Science Conference, 2019. [21] J. Chen J.E. Taylor H.-H. Wei Modeling building occupant network energy consumption decision-making: the interplay between network structure and conservation Energy Build. 47 Apr. 2012 515 524 J. Chen, J. E. Taylor, and H.-H. Wei, “Modeling building occupant network energy consumption decision-making: The interplay between network structure and conservation,” Energy Build., vol. 47, pp. 515-524, Apr. 2012. [22] J. Chapman P.-O. Siebers D. Robinson On the multi-agent stochastic simulation of occupants in buildings J. Build. Perform. Simul. 11 5 Sep. 2018 604 621 J. Chapman, P.-O. Siebers, and D. Robinson, “On the multi-agent stochastic simulation of occupants in buildings,” J. Build. Perform. Simul., vol. 11, no. 5, pp. 604-621, Sep. 2018. [23] T. Hong H. Sun Y. Chen S.C. Taylor-Lange D. Yan An occupant behavior modeling tool for co-simulation Energy Build. vol. 117 Apr. 2016 272 281 T. Hong, H. Sun, Y. Chen, S. C. Taylor-Lange, and D. Yan, “An occupant behavior modeling tool for co-simulation,” Energy Build., vol. 117, pp. 272-281, Apr. 2016. [24] I. Ajzen R. Netemeyer M. Van Ryn The theory of planned behavior Organ. Behav. Hum. Decis. Process. 50 2 1991 179 211 I. Ajzen, R. Netemeyer, and M. Van Ryn, “The theory of planned behavior,” Organ. Behav. Hum. Decis. Process., vol. 50, no. 2, pp. 179-211, 1991. [25] B. Dong Z. Li G. Mcfadden An investigation on energy-related occupancy behavior for low-income residential buildings Sci. Technol. Built Environ. 21 6 Aug. 2015 892 901 B. Dong, Z. Li, and G. Mcfadden, “An investigation on energy-related occupancy behavior for low-income residential buildings,” Sci. Technol. Built Environ., vol. 21, no. 6, pp. 892-901, Aug. 2015. [26] A.C.K. de Menezes R. Tetlow C.P. Beaman D. Bouchlaghem A. Cripps R.A. Buswell Assessing the Impact of Occupant Behaviour on Electricity Consumption for Lighting and Small Power in Office Buildings 2012 A. C. K. de Menezes, R. Tetlow, C. P. Beaman, D. Bouchlaghem, A. Cripps, and R. A. Buswell, “Assessing the impact of occupant behaviour on electricity consumption for lighting and small power in office buildings,” 2012. [27] S. D’oca S. Corgnati A.L. Pisello T. Hong Introduction to an Occupant Behavior Motivation Survey Framework 2016 S. D’oca, S. Corgnati, A. L. Pisello, and T. Hong, “Introduction to an occupant behavior motivation survey framework,” 2016. [28] L. Steg C. Vlek Encouraging pro-environmental behaviour: an integrative review and research agenda J. Environ. Psychol. 29 3 2009 309 317 L. Steg and C. Vlek, “Encouraging pro-environmental behaviour: An integrative review and research agenda,” J. Environ. Psychol., vol. 29, no. 3, pp. 309-317, 2009. [29] A. Borshchev A. Filippov From system dynamics and discrete event to practical agent based modeling: reasons, techniques, tools The 22nd International Conference of the System Dynamics Society 2004 A. Borshchev and A. Filippov, “From system dynamics and discrete event to practical agent based modeling: reasons, techniques, tools,” in The 22nd International Conference of the System Dynamics Society, 2004. [30] M.D. Koupaei F. Hashemi V. Tabard-Fortecoef U. Passe Development of a modeling framework for refined residential occupancy schedules Conference of the International Building Performance Simulation Association 2019 M. D. Koupaei, F. Hashemi, V. Tabard-Fortecoef, and U. Passe, “Development of a modeling framework for refined residential occupancy schedules,” in Conference of the International Building Performance Simulation Association, 2019. [31] T. Capic Australian Unity Wellbeing Index (AUWI) Financial Control,” Melbourne, Australia 2018 T. Capic et al., “Australian Unity Wellbeing Index (AUWI) Financial Control,” Melbourne, Australia, 2018. [32] H.C. Howard R.E. Levitt B.C. Paulson J.G. Pohl C.B. Tatum Computer integration: reducing fragmentation in AEC industry J. Comput. Civ. Eng. 3 1 Jan. 1989 18 32 H. C. Howard, R. E. Levitt, B. C. Paulson, J. G. Pohl, and C. B. Tatum, “Computer Integration: Reducing Fragmentation in AEC Industry,” J. Comput. Civ. Eng., vol. 3, no. 1, pp. 18-32, Jan. 1989. [33] Y. Zhu A. Pandit W. Mao Framework to support the representations of semantic mappings for a hybrid integration strategy J. Comput. Civ. Eng. 20 4 Jul. 2006 237 246 Y. Zhu, A. Pandit, and W. Mao, “Framework to Support the Representations of Semantic Mappings for a Hybrid Integration Strategy,” J. Comput. Civ. Eng., vol. 20, no. 4, pp. 237-246, Jul. 2006. [34] G. Gao Y.-S. Liu M. Wang M. Gu J.-H. Yong A query expansion method for retrieving online BIM resources based on Industry Foundation Classes Autom. ConStruct. 56 Aug. 2015 14 25 G. Gao, Y.-S. Liu, M. Wang, M. Gu, and J.-H. Yong, “A query expansion method for retrieving online BIM resources based on Industry Foundation Classes,” Autom. Constr., vol. 56, pp. 14-25, Aug. 2015. [35] Y. Ham M. Golparvar-Fard Mapping actual thermal properties to building elements in gbXML-based BIM for reliable building energy performance modeling Autom. ConStruct. 49 Jan. 2015 214 224 Y. Ham and M. Golparvar-Fard, “Mapping actual thermal properties to building elements in gbXML-based BIM for reliable building energy performance modeling,” Autom. Constr., vol. 49, pp. 214-224, Jan. 2015. [36] X.L. Dong T. Rekatsinas Data integration and machine learning Proceedings of the 2018 International Conference on Management of Data - SIGMOD ’18 2018 1645 1650 X. L. Dong and T. Rekatsinas, “Data Integration and Machine Learning,” in Proceedings of the 2018 International Conference on Management of Data - SIGMOD ’18, 2018, pp. 1645-1650. [37] M. Boubekri I.N. Cheung K.J. Reid C.H. Wang P.C. Zee Impact of windows and daylight exposure on overall health and sleep quality of office workers: a case-control pilot study J. Clin. Sleep Med. 10 6 2014 603 611 M. Boubekri, I. N. Cheung, K. J. Reid, C. H. Wang, and P. C. Zee, “Impact of windows and daylight exposure on overall health and sleep quality of office workers: A case-control pilot study,” J. Clin. Sleep Med., vol. 10, no. 6, pp. 603-611, 2014. [38] R. Jones G. Yates “The Built Environment and Health: an Evidence Review,” Glasgow, UK 2013 R. Jones and G. Yates,“The built environment and health: an evidence review,” Glasgow, UK, 2013. [39] A. Dearry Impacts of our built environment on public health Environ. Health Perspect. 112 11 2004 600 601 A. Dearry, “Impacts of our built environment on public health,” Environ. Health Perspect., vol. 112, no. 11, pp. 600-601, 2004. [40] J. Kent and S. Thompson, “Health and the built environment: exploring foundations for a new interdisciplinary profession,” J. Environ. Public Health, vol. 2012, no. iii, 2012. [41] C.O. Ryan W.D. Browning J.O. Clancy S.L. Andrews N.B. Kallianpurkar Biophilic design patterns: emerging nature-based parameters for health and well-being in the built environment Archnet-IJAR 8 2 2014 62 76 C. O. Ryan, W. D. Browning, J. O. Clancy, S. L. Andrews, and N. B. Kallianpurkar, “Biophilic design patterns: Emerging nature-based parameters for health and well-being in the built environment,” Archnet-IJAR, vol. 8, no. 2, pp. 62-76, 2014. [42] P. Downton D. Jones J. Zeunert Biophilia in urban design: patterns and principles for smart Australian cities IUDC 2016 Smart Cities 21st Century Aust. Proc. 9th Int. Urban Des. Conf. vol 2016 2016 168 182 March 2017 P. Downton, D. Jones, and J. Zeunert, “Biophilia in Urban Design: Patterns and principles for smart Australian cities,” IUDC 2016 Smart Cities 21st Century Aust. Proc. 9th Int. Urban Des. Conf. 2016, no. March 2017, pp. 168-182, 2016. [43] T.Y. Ling Y.C. Chiang Well-being, health and urban coherence-advancing vertical greening approach toward resilience: a design practice consideration J. Clean. Prod. 182 2018 187 197 T. Y. Ling and Y. C. Chiang, “Well-being, health and urban coherence-advancing vertical greening approach toward resilience: A design practice consideration,” J. Clean. Prod., vol. 182, pp. 187-197, 2018. [44] M.L.M. Graymore N.G. Sipe R.E. Rickson Sustaining Human Carrying Capacity: a tool for regional sustainability assessment Ecol. Econ. 69 3 2010 459 468 M. L. M. Graymore, N. G. Sipe, and R. E. Rickson, “Sustaining Human Carrying Capacity: A tool for regional sustainability assessment,” Ecol. Econ., vol. 69, no. 3, pp. 459-468, 2010. [45] C.F. Reinhart C. Cerezo Davila Urban building energy modeling - a review of a nascent field Build. Environ. 97 2016 196 202 C. F. Reinhart and C. Cerezo Davila, “Urban building energy modeling - A review of a nascent field,” Build. Environ., vol. 97, pp. 196-202, 2016. [46] M.A. Ortiz S.R. Kurvers P.M. Bluyssen A review of comfort, health, and energy use: understanding daily energy use and wellbeing for the development of a new approach to study comfort Energy Build. 152 2017 323 335 M. A. Ortiz, S. R. Kurvers, and P. M. Bluyssen, “A review of comfort, health, and energy use: Understanding daily energy use and wellbeing for the development of a new approach to study comfort,” Energy Build., vol. 152, pp. 323-335, 2017. [47] S. Saxena J. Orley Quality of life assessment: the world health organization perspective Eur. Psychiatry 12 SUPPL. 3 1997 263s 266s S. Saxena and J. Orley, “Quality of life assessment: The World Health Organization perspective,” Eur. Psychiatry, vol. 12, no. SUPPL. 3, pp. 263s-266s, 1997. [48] K.J. Watson Establishing psychological wellbeing metrics for the built environment Build. Serv. Eng. Technol. 39 2 2018 232 243 K. J. Watson, “Establishing psychological wellbeing metrics for the built environment,” Build. Serv. Eng. Res. Technol., vol. 39, no. 2, pp. 232-243, 2018. [49] I. Butterworth The Relationship between the Built Environment and Wellbeing: A Literature Review 2000 no. February I. Butterworth, “The Relationship Between the Built Environment and Wellbeing: A Literature Review,” no. February, 2000. [50] T. Schaubroeck B. Rugani A revision of what life cycle sustainability assessment should entail: towards modeling the net impact on human well-being J. Ind. Ecol. 21 6 2017 1464 1477 T. Schaubroeck and B. Rugani, “A Revision of What Life Cycle Sustainability Assessment Should Entail: Towards Modeling the Net Impact on Human Well-Being,” J. Ind. Ecol., vol. 21, no. 6, pp. 1464-1477, 2017. [51] F. AL-Nassar R. Ruparathna G. Chhipi-Shrestha H. Haider K. Hewage R. Sadiq Sustainability assessment framework for low rise commercial buildings: life cycle impact index-based approach Clean Technol. Environ. Policy 18 8 2016 2579 2590 F. AL-Nassar, R. Ruparathna, G. Chhipi-Shrestha, H. Haider, K. Hewage, and R. Sadiq, “Sustainability assessment framework for low rise commercial buildings: life cycle impact index-based approach,” Clean Technol. Environ. Policy, vol. 18, no. 8, pp. 2579-2590, 2016. [52] A. Mahdavi C. Berger “An inquiry into the certification potential of built environments ’ affordance CLIMA 2019 Congress vol 111 2019 A. Mahdavi and C. Berger, “An inquiry into the certification potential of built environments ’ affordance,” in CLIMA 2019 Congress, 2019, vol. 111. [53] DIVA for Rhino [Online] http://diva4rhino.com/ “DIVA for Rhino” [Online]. http://diva4rhino.com/. [Accessed: 29-Apr-2019].",
    "scopus-id": "85076994963",
    "coredata": {
        "eid": "1-s2.0-S0360132319307309",
        "dc:description": "This paper focuses on data infrastructure that is central to the modeling of design and operation of sustainable and healthy buildings. While reducing energy consumption by making buildings more energy efficient has been touted as an easily obtainable approach to promoting carbon-neutral energy societies, the sustainable buildings’ benefits and impacts on human wellbeing have not been clearly quantified to the extent that they may directly influence the decision of adopting sustainable building designs. The authors argue that focusing on the wellbeing of people occupying the buildings will lead to significant changes in the decision-making process of the design and operation of sustainable buildings. The authors propose a framework to define the type of data that can be measured or acquired and contributed to the design and operation of buildings for energy efficiency in relation to human wellbeing and social economic aspects. The framework can benefit building designers and operators for decision-making using wellbeing-centric life cycle assessment. The methodology presented in the paper is supported through a case study.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2020-03-31",
        "openaccessUserLicense": null,
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S0360132319307309",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Tao, Yong X."
            },
            {
                "@_fa": "true",
                "$": "Zhu, Yimin"
            },
            {
                "@_fa": "true",
                "$": "Passe, Ulrike"
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S0360132319307309"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S0360132319307309"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": null,
        "pii": "S0360-1323(19)30730-9",
        "prism:volume": "170",
        "articleNumber": "106518",
        "prism:publisher": "Elsevier Ltd.",
        "dc:title": "Modeling and data infrastructure for human-centric design and operation of sustainable, healthy buildings through a case study",
        "prism:copyright": "© 2019 Elsevier Ltd. All rights reserved.",
        "openaccess": "0",
        "prism:issn": "03601323",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Human wellbeing"
            },
            {
                "@_fa": "true",
                "$": "Sustainable buildings"
            },
            {
                "@_fa": "true",
                "$": "Data analytics"
            }
        ],
        "openaccessArticle": "false",
        "prism:publicationName": "Building and Environment",
        "openaccessSponsorType": null,
        "prism:pageRange": "106518",
        "pubType": "fla",
        "prism:coverDisplayDate": "March 2020",
        "prism:doi": "10.1016/j.buildenv.2019.106518",
        "prism:startingPage": "106518",
        "dc:identifier": "doi:10.1016/j.buildenv.2019.106518",
        "openaccessSponsorName": null
    },
    "objects": {"object": [
        {
            "@category": "standard",
            "@height": "1014",
            "@width": "574",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr2.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "188786",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "500",
            "@width": "540",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr3.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "90727",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "404",
            "@width": "713",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr1.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "102322",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@height": "234",
            "@width": "357",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr4.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-DOWNSAMPLED",
            "@size": "33355",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "thumbnail",
            "@height": "163",
            "@width": "92",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr2.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "21110",
            "@ref": "gr2",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "164",
            "@width": "177",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr3.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "26399",
            "@ref": "gr3",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "124",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr1.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "16161",
            "@ref": "gr1",
            "@mimetype": "image/gif"
        },
        {
            "@category": "thumbnail",
            "@height": "143",
            "@width": "219",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr4.sml?httpAccept=%2A%2F%2A",
            "@multimediatype": "GIF image file",
            "@type": "IMAGE-THUMBNAIL",
            "@size": "26052",
            "@ref": "gr4",
            "@mimetype": "image/gif"
        },
        {
            "@category": "high",
            "@height": "4496",
            "@width": "2544",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr2_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "1677117",
            "@ref": "gr2",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "2215",
            "@width": "2390",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr3_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "665928",
            "@ref": "gr3",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1789",
            "@width": "3158",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr1_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "618282",
            "@ref": "gr1",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "high",
            "@height": "1037",
            "@width": "1583",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-gr4_lrg.jpg?httpAccept=%2A%2F%2A",
            "@multimediatype": "JPEG image file",
            "@type": "IMAGE-HIGH-RES",
            "@size": "158774",
            "@ref": "gr4",
            "@mimetype": "image/jpeg"
        },
        {
            "@category": "standard",
            "@_fa": "true",
            "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0360132319307309-am.pdf?httpAccept=%2A%2F%2A",
            "@multimediatype": "Acrobat PDF file",
            "@type": "AAM-PDF",
            "@size": "764733",
            "@ref": "am",
            "@mimetype": "application/pdf"
        }
    ]},
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/85076994963"
    }
}}